const STANDARDS_DATA = {
  "subjects": [
    {
      "grade": "1",
      "semester": "1",
      "dept": "국어",
      "name": "공통국어1",
      "credits": 4,
      "cat": "공통"
    },
    {
      "grade": "1",
      "semester": "1",
      "dept": "수학",
      "name": "공통수학1",
      "credits": 4,
      "cat": "공통"
    },
    {
      "grade": "1",
      "semester": "1",
      "dept": "영어",
      "name": "공통영어1",
      "credits": 4,
      "cat": "공통"
    },
    {
      "grade": "1",
      "semester": "1",
      "dept": "사회",
      "name": "한국사1",
      "credits": 3,
      "cat": "공통"
    },
    {
      "grade": "1",
      "semester": "1",
      "dept": "사회",
      "name": "통합사회1",
      "credits": 4,
      "cat": "공통"
    },
    {
      "grade": "1",
      "semester": "1",
      "dept": "과학",
      "name": "통합과학1",
      "credits": 4,
      "cat": "공통"
    },
    {
      "grade": "1",
      "semester": "1",
      "dept": "과학",
      "name": "과학탐구실험1",
      "credits": 1,
      "cat": "공통"
    },
    {
      "grade": "1",
      "semester": "1",
      "dept": "예체능",
      "name": "체육1",
      "credits": 2,
      "cat": "일반선택"
    },
    {
      "grade": "1",
      "semester": "1",
      "dept": "예체능",
      "name": "음악",
      "credits": 3,
      "cat": "일반선택"
    },
    {
      "grade": "1",
      "semester": "1",
      "dept": "예체능",
      "name": "미술",
      "credits": 3,
      "cat": "일반선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "국어",
      "name": "문학",
      "credits": 4,
      "cat": "일반선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "국어",
      "name": "독서 토론과 글쓰기",
      "credits": 3,
      "cat": "융합선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "수학",
      "name": "대수",
      "credits": 4,
      "cat": "일반선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "수학",
      "name": "인공지능 수학",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "영어",
      "name": "영어Ⅰ",
      "credits": 4,
      "cat": "일반선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "영어",
      "name": "영미 문학 읽기",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "사회",
      "name": "세계시민과 지리",
      "credits": 4,
      "cat": "일반선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "사회",
      "name": "사회와 문화",
      "credits": 4,
      "cat": "일반선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "사회",
      "name": "현대사회와 윤리",
      "credits": 4,
      "cat": "일반선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "사회",
      "name": "동아시아 역사 기행",
      "credits": 4,
      "cat": "진로선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "과학",
      "name": "물리학",
      "credits": 4,
      "cat": "일반선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "과학",
      "name": "생명과학",
      "credits": 4,
      "cat": "일반선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "과학",
      "name": "과학과제 연구",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "과학",
      "name": "과학의 역사와 문화",
      "credits": 3,
      "cat": "융합선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "기술가정정보",
      "name": "생활과학 탐구",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "기술가정정보",
      "name": "정보",
      "credits": 3,
      "cat": "일반선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "제2외국어",
      "name": "중국어",
      "credits": 3,
      "cat": "일반선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "제2외국어",
      "name": "일본어",
      "credits": 3,
      "cat": "일반선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "예체능",
      "name": "스포츠 과학",
      "credits": 1,
      "cat": "진로선택"
    },
    {
      "grade": "2",
      "semester": "1",
      "dept": "예체능",
      "name": "미술 감상과 비평",
      "credits": 2,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "국어",
      "name": "화법과 작문",
      "credits": 3,
      "cat": "일반선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "국어",
      "name": "언어와 매체",
      "credits": 3,
      "cat": "일반선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "국어",
      "name": "심화 국어",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "수학",
      "name": "미적분",
      "credits": 3,
      "cat": "일반선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "수학",
      "name": "기하",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "수학",
      "name": "경제 수학",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "수학",
      "name": "수학과제 탐구",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "영어",
      "name": "영어 독해와 작문",
      "credits": 3,
      "cat": "일반선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "영어",
      "name": "영어권 문화",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "영어",
      "name": "심화 영어Ⅰ",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "사회",
      "name": "세계지리",
      "credits": 3,
      "cat": "일반선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "사회",
      "name": "동아시아사",
      "credits": 3,
      "cat": "일반선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "사회",
      "name": "사회·문화",
      "credits": 3,
      "cat": "일반선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "사회",
      "name": "윤리와 사상",
      "credits": 3,
      "cat": "일반선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "사회",
      "name": "여행지리",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "사회",
      "name": "사회문제 탐구",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "사회",
      "name": "고전과 윤리",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "과학",
      "name": "물리학Ⅱ",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "과학",
      "name": "화학Ⅱ",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "과학",
      "name": "생명과학Ⅱ",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "과학",
      "name": "지구과학Ⅱ",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "과학",
      "name": "생활과 과학",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "과학",
      "name": "융합과학",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "과학",
      "name": "고급 화학",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "과학",
      "name": "고급 생명과학",
      "credits": 3,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "기술가정정보",
      "name": "인간 발달",
      "credits": 2,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "기술가정정보",
      "name": "프로그래밍",
      "credits": 2,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "제2외국어",
      "name": "일본 문화",
      "credits": 2,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "제2외국어",
      "name": "중국 문화",
      "credits": 2,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "예체능",
      "name": "스포츠 생활",
      "credits": 1,
      "cat": "진로선택"
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "교양",
      "name": "논술",
      "credits": 2,
      "cat": ""
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "교양",
      "name": "환경",
      "credits": 2,
      "cat": ""
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "교양",
      "name": "과학융합",
      "credits": 2,
      "cat": ""
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "교양",
      "name": "교육학",
      "credits": 2,
      "cat": ""
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "교양",
      "name": "심리학",
      "credits": 2,
      "cat": ""
    },
    {
      "grade": "3",
      "semester": "1",
      "dept": "교양",
      "name": "보건",
      "credits": 2,
      "cat": ""
    }
  ],
  "st12": [
    {
      "dept": "국어",
      "subject": "공통 국어1",
      "domain": "매체",
      "code": "10공국1-06-02",
      "desc": "소통 맥락과 매체 특성을 고려하여 다양한 목적의 매체 자료를 제작한다."
    },
    {
      "dept": "국어",
      "subject": "공통 국어1",
      "domain": "매체",
      "code": "10공국1-06-01",
      "desc": "사회적 의제를 다룬 매체 자료를 비판적으로 분석한다."
    },
    {
      "dept": "국어",
      "subject": "공통 국어1",
      "domain": "문학",
      "code": "10공국1-05-03",
      "desc": "작품 구성 요소의 유기적 관계와 맥락에 유의하여 작품을 수용하고 생산한다."
    },
    {
      "dept": "국어",
      "subject": "공통 국어1",
      "domain": "문학",
      "code": "10공국1-05-02",
      "desc": "갈래에 따른 형상화 방법의 특성을 고려하며 작품을 수용한다."
    },
    {
      "dept": "국어",
      "subject": "공통 국어1",
      "domain": "문학",
      "code": "10공국1-05-01",
      "desc": "문학 소통의 특성을 고려하며 문학 소통에 참여한다."
    },
    {
      "dept": "국어",
      "subject": "공통 국어1",
      "domain": "문법",
      "code": "10공국1-04-03",
      "desc": "다양한 분야의 글과 담화에 나타난 문법 요소 및 어휘의 표현 효과를 평가하고 적절한 표현을 생성한다."
    },
    {
      "dept": "국어",
      "subject": "공통 국어1",
      "domain": "문법",
      "code": "10공국1-04-02",
      "desc": "음운 변동을 탐구하여 발음과 표기에 올바르게 적용한다."
    },
    {
      "dept": "국어",
      "subject": "공통 국어1",
      "domain": "읽기",
      "code": "10공국1-02-02",
      "desc": "자신의 진로나 관심 분야와 관련한 다양한 글이나 자료를 찾아 주제 통합적으로 읽고 읽은 결과를 공유한다."
    },
    {
      "dept": "국어",
      "subject": "공통 국어1",
      "domain": "쓰기",
      "code": "10공국1-03-01",
      "desc": "내용 전개의 일반적 원리를 고려하여 사회적 쟁점에 대한 자신의 견해를 정교하게 표현하는 글을 쓴다."
    },
    {
      "dept": "국어",
      "subject": "공통 국어1",
      "domain": "읽기",
      "code": "10공국1-02-01",
      "desc": "다양한 글이나 자료를 읽으며 논증의 타당성을 평가하고 자신의 관점을 바탕으로 논증을 재구성한다."
    },
    {
      "dept": "국어",
      "subject": "공통 국어1",
      "domain": "듣기‧말하기",
      "code": "10공국1-01-02",
      "desc": "논제의 필수 쟁점별로 논증을 구성하고 논증이 타당한지 평가하며 토론한다."
    },
    {
      "dept": "국어",
      "subject": "공통 국어1",
      "domain": "쓰기",
      "code": "10공국1-03-02",
      "desc": "다양한 언어 공동체의 특성을 고려하며 필자의 개성이 드러나는 글을 쓴다."
    },
    {
      "dept": "국어",
      "subject": "공통 국어1",
      "domain": "문법",
      "code": "10공국1-04-01",
      "desc": "언어 공동체가 다변화함에 따라 다양해진 언어 실천 양상을 분석하고 언어 주체로서 책임감을 가지며 국어생활을 한다."
    },
    {
      "dept": "국어",
      "subject": "공통 국어1",
      "domain": "듣기‧말하기",
      "code": "10공국1-01-01",
      "desc": "대화의 원리를 고려하여 대화하고 자신의 듣기･말하기 과정과 공동체의 담화 관습을 성찰한다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "방정식과 부등식",
      "code": "10공수1-02-10",
      "desc": "절댓값을 포함한 일차부등식을 풀 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "방정식과 부등식",
      "code": "10공수1-02-09",
      "desc": "미지수가 1개인 연립일차부등식을 풀 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "방정식과 부등식",
      "code": "10공수1-02-08",
      "desc": "미지수가 2개인 연립이차방정식을 풀 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "방정식과 부등식",
      "code": "10공수1-02-06",
      "desc": "이차함수의 최대, 최소를 탐구하고, 이를 실생활과 연결하여 유용성을 인식할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "방정식과 부등식",
      "code": "10공수1-02-05",
      "desc": "이차함수의 그래프와 직선의 위치 관계를 판단할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "방정식과 부등식",
      "code": "10공수1-02-04",
      "desc": "이차방정식과 이차함수를 연결하여 그 관계를 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "방정식과 부등식",
      "code": "10공수1-02-01",
      "desc": "복소수의 뜻과 성질을 설명하고, 사칙연산을 수행할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "다항식",
      "code": "10공수1-01-03",
      "desc": "다항식의 인수분해를 할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "행렬",
      "code": "10공수1-04-02",
      "desc": "행렬의 연산을 수행하고, 관련된 문제를 해결할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "행렬",
      "code": "10공수1-04-01",
      "desc": "행렬의 뜻을 알고, 실생활 상황을 행렬로 표현할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "경우의 수",
      "code": "10공수1-03-03",
      "desc": "조합의 개념을 이해하고, 조합의 수를 구하는 방법을 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "경우의 수",
      "code": "10공수1-03-02",
      "desc": "순열의 개념을 이해하고, 순열의 수를 구하는 방법을 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "경우의 수",
      "code": "10공수1-03-01",
      "desc": "합의 법칙과 곱의 법칙을 이해하고, 적절한 전략을 사용하여 경우의 수와 관련된 문제를 해결할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "방정식과 부등식",
      "code": "10공수1-02-11",
      "desc": "이차부등식과 이차함수를 연결하여 그 관계를 설명하고, 이차부등식과 연립이차부등식을 풀 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "방정식과 부등식",
      "code": "10공수1-02-07",
      "desc": "간단한 삼차방정식과 사차방정식을 풀 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "방정식과 부등식",
      "code": "10공수1-02-03",
      "desc": "이차방정식의 근과 계수의 관계를 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "방정식과 부등식",
      "code": "10공수1-02-02",
      "desc": "이차방정식의 실근과 허근을 이해하고, 판별식을 이용하여 이차방정식의 근을 판별할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "다항식",
      "code": "10공수1-01-02",
      "desc": "항등식의 성질과 나머지정리를 이해하고, 이를 활용하여 문제를 해결할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "공통수학1",
      "domain": "다항식",
      "code": "10공수1-01-01",
      "desc": "다항식의 사칙연산의 원리를 설명하고, 그 계산을 할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "이해",
      "code": "10공영1-01-01",
      "desc": "말이나 글에 포함된 세부 정보를 파악한다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "이해",
      "code": "10공영1-01-02",
      "desc": "말이나 글의 주제나 요지를 파악한다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "이해",
      "code": "10공영1-01-03",
      "desc": "말이나 글의 분위기나 화자나 인물의 심정 및 의도 등을 추론한다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "이해",
      "code": "10공영1-01-04",
      "desc": "말이나 글에 나타난 일이나 사건의 논리적 관계를 파악한다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "이해",
      "code": "10공영1-01-05",
      "desc": "말이나 글에 포함된 표현의 함축적 의미를 추론한다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "이해",
      "code": "10공영1-01-06",
      "desc": "말이나 글의 전개 방식이나 구조를 파악한다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "이해",
      "code": "10공영1-01-07",
      "desc": "말이나 글의 이해를 위한 적절한 전략을 적용한다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "이해",
      "code": "10공영1-01-08",
      "desc": "말이나 글에 나타난 다양한 관점이나 의견을 포용적인 태도로 분석한다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "표현",
      "code": "10공영1-02-01",
      "desc": "실물, 그림, 사진, 도표 등을 활용하여 내용을 설명한다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "표현",
      "code": "10공영1-02-02",
      "desc": "사실적 정보나 지식을 말이나 글로 전달한다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "표현",
      "code": "10공영1-02-03",
      "desc": "경험이나 계획 등을 말하거나 기술한다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "표현",
      "code": "10공영1-02-04",
      "desc": "자신의 생각이나 의견, 감정, 감상 등을 표현한다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "표현",
      "code": "10공영1-02-05",
      "desc": "듣거나 읽은 내용을 요약하여 말하거나 기술한다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "표현",
      "code": "10공영1-02-06",
      "desc": "어휘나 표현을 점검하여 내용을 명확하게 전달한다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "표현",
      "code": "10공영1-02-07",
      "desc": "적절한 전략과 다양한 매체를 활용하여 상황과 목적에 맞게 말하거나 쓴다."
    },
    {
      "dept": "영어",
      "subject": "공통영어1",
      "domain": "표현",
      "code": "10공영1-02-08",
      "desc": "상대방의 생각이나 관점을 존중하고 언어 예절을 갖추어 표현한다."
    },
    {
      "dept": "역사",
      "subject": "한국사1",
      "domain": "근대 이전 한국사의 이해",
      "code": "10한사1-01-01",
      "desc": "고대 국가의 형성과 성장 과정을 파악한다."
    },
    {
      "dept": "역사",
      "subject": "한국사1",
      "domain": "근대 이전 한국사의 이해",
      "code": "10한사1-01-02",
      "desc": "고려의 통치 체제와 지배 세력의 변화를 이해한다."
    },
    {
      "dept": "역사",
      "subject": "한국사1",
      "domain": "근대 이전 한국사의 이해",
      "code": "10한사1-01-03",
      "desc": "조선의 성립과 정치 운영의 변화를 파악한다."
    },
    {
      "dept": "역사",
      "subject": "한국사1",
      "domain": "근대 이전 한국사의 이해",
      "code": "10한사1-01-04",
      "desc": "조선 후기에 등장한 새로운 변화 양상을 이해한다."
    },
    {
      "dept": "역사",
      "subject": "한국사1",
      "domain": "근대 이전 한국사의 탐구",
      "code": "10한사1-02-01",
      "desc": "근대 이전 국제 관계와 대외 교류의 시대적 특징을 비교한다."
    },
    {
      "dept": "역사",
      "subject": "한국사1",
      "domain": "근대 이전 한국사의 탐구",
      "code": "10한사1-02-02",
      "desc": "근대 이전의 수취 체제 변화를 농업 중심의 경제생활과 관련하여 탐구한다."
    },
    {
      "dept": "역사",
      "subject": "한국사1",
      "domain": "근대 이전 한국사의 탐구",
      "code": "10한사1-02-03",
      "desc": "근대 이전 사회 구조를 신분제를 중심으로 분석한다."
    },
    {
      "dept": "역사",
      "subject": "한국사1",
      "domain": "근대 이전 한국사의 탐구",
      "code": "10한사1-02-04",
      "desc": "근대 이전의 사상과 문화를 국제 교류와 관련하여 탐구한다."
    },
    {
      "dept": "역사",
      "subject": "한국사1",
      "domain": "근대 이전 한국사의 탐구",
      "code": "10한사1-02-05",
      "desc": "근대 이전 한국사 주제를 설정하여 탐구하고, 그 결과를 다양한 방법으로 표현한다."
    },
    {
      "dept": "역사",
      "subject": "한국사1",
      "domain": "근대 국가 수립의 노력",
      "code": "10한사1-03-01",
      "desc": "조선의 개항을 국제 질서의 변동과 연관하여 분석한다."
    },
    {
      "dept": "역사",
      "subject": "한국사1",
      "domain": "근대 국가 수립의 노력",
      "code": "10한사1-03-02",
      "desc": "여러 세력이 추진한 근대 국가 수립의 다양한 노력을 이해한다."
    },
    {
      "dept": "역사",
      "subject": "한국사1",
      "domain": "근대 국가 수립의 노력",
      "code": "10한사1-03-03",
      "desc": "개항 이후 사회·경제 변화를 파악하고, 서구 문물의 도입이 문화에 미친 영향을 탐구한다."
    },
    {
      "dept": "역사",
      "subject": "한국사1",
      "domain": "근대 국가 수립의 노력",
      "code": "10한사1-03-04",
      "desc": "일제의 국권 침탈 과정을 조사하고, 이에 맞선 국권 수호 운동의 흐름을 파악한다."
    },
    {
      "dept": "사회",
      "subject": "통합사회1",
      "domain": "통합적 관점",
      "code": "10통사1-01-01",
      "desc": "인간, 사회, 환경을 바라보는 시간적, 공간적, 사회적, 윤리적 관점의 의미와 특징을 사례를 통해 파악한다."
    },
    {
      "dept": "사회",
      "subject": "통합사회1",
      "domain": "통합적 관점",
      "code": "10통사1-01-02",
      "desc": "인간, 사회, 환경의 탐구에 통합적 관점이 요청되는 이유를 도출하고 이를 탐구에 적용한다."
    },
    {
      "dept": "사회",
      "subject": "통합사회1",
      "domain": "인간, 사회, 환경과 행복",
      "code": "10통사1-02-01",
      "desc": "시대와 지역에 따라 다르게 나타나는 행복의 기준을 사례를 통해 비교하여 평가하고, 삶의 목적으로서 행복의 의미를 성찰한다."
    },
    {
      "dept": "사회",
      "subject": "통합사회1",
      "domain": "인간, 사회, 환경과 행복",
      "code": "10통사1-02-02",
      "desc": "행복한 삶을 실현하기 위한 조건으로 질 높은 정주 환경의 조성, 경제적 안정, 민주주의 발전 및 도덕적 실천의 필요성에 관해 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "통합사회1",
      "domain": "자연환경과 인간",
      "code": "10통사1-03-01",
      "desc": "자연환경이 인간의 생활에 미치는 영향에 관한 과거와 현재의 사례를 조사하여 분석하고, 안전하고 쾌적한 환경에서 살아가는 것이 시민의 권리임을 주장한다."
    },
    {
      "dept": "사회",
      "subject": "통합사회1",
      "domain": "자연환경과 인간",
      "code": "10통사1-03-02",
      "desc": "자연에 대한 인간의 다양한 관점을 사례를 통해 비교하고, 인간과 자연의 바람직한 관계를 제안한다."
    },
    {
      "dept": "사회",
      "subject": "통합사회1",
      "domain": "자연환경과 인간",
      "code": "10통사1-03-03",
      "desc": "환경 문제 해결을 위한 정부, 시민사회, 기업 등의 다양한 노력을 조사하고, 생태 시민으로서 실천 방안을 모색한다."
    },
    {
      "dept": "사회",
      "subject": "통합사회1",
      "domain": "문화와 다양성",
      "code": "10통사1-04-01",
      "desc": "자연환경과 인문환경의 영향을 받아 형성된 다양한 문화권의 특징과 삶의 방식을 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "통합사회1",
      "domain": "문화와 다양성",
      "code": "10통사1-04-02",
      "desc": "문화 변동의 다양한 양상을 이해하고 현대 사회에서 전통문화가 지니는 의의를 탐색한다."
    },
    {
      "dept": "사회",
      "subject": "통합사회1",
      "domain": "문화와 다양성",
      "code": "10통사1-04-03",
      "desc": "문화적 차이에 대한 상대주의적 태도의 필요성을 이해하고, 보편 윤리의 차원에서 자문화와 타문화를 평가한다."
    },
    {
      "dept": "사회",
      "subject": "통합사회1",
      "domain": "문화와 다양성",
      "code": "10통사1-04-04",
      "desc": "다문화 사회의 현황을 조사하고, 문화적 다양성을 존중하는 태도를 바탕으로 갈등 해결 방안을 모색한다."
    },
    {
      "dept": "사회",
      "subject": "통합사회1",
      "domain": "생활공간의 변화",
      "code": "10통사1-05-01",
      "desc": "산업화, 도시화로 인해 나타난 생활공간과 생활양식의 변화 양상을 조사하고, 이에 따른 문제점의 해결 방안을 제안한다."
    },
    {
      "dept": "사회",
      "subject": "통합사회1",
      "domain": "생활공간의 변화",
      "code": "10통사1-05-02",
      "desc": "교통ㆍ통신 및 과학기술의 발달과 함께 나타난 생활공간과 생활양식의 변화 양상을 조사하고, 이에 따른 문제점의 해결 방안을 제안한다."
    },
    {
      "dept": "사회",
      "subject": "통합사회1",
      "domain": "생활공간의 변화",
      "code": "10통사1-05-03",
      "desc": "자신이 거주하는 지역을 사례로 공간 변화가 초래한 양상 및 문제점을 탐구하고, 공동체의 구성원으로서 지역사회의 변화를 위한 방안을 모색하고 이를 실천한다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "과학의 기초",
      "code": "10통과1-01-01",
      "desc": "자연을 시간과 공간에서 기술할 수 있음을 알고, 길이와 시간 측정의 현대적 방법과 다양한 규모의 측정 사례를 조사할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "과학의 기초",
      "code": "10통과1-01-02",
      "desc": "과학 탐구에서 중요한 기본량의 의미를 알고, 자연 현상을 기술하는 데 단위가 가지는 의미와 적용사례를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "과학의 기초",
      "code": "10통과1-01-03",
      "desc": "과학 탐구에서 측정과 어림의 의미를 알고, 일상생활의 여러 가지 상황에서 측정 표준의 유용성과 필요성을 논증할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "과학의 기초",
      "code": "10통과1-01-04",
      "desc": "자연에서 일어나는 다양한 변화를 측정ㆍ분석하여 정보를 산출함을 알고, 이러한 정보를 디지털로 변환하는 기술을 정보 통신에 활용하여 현대 문명에 미친 영향을 인식한다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "물질과 규칙성",
      "code": "10통과1-02-01",
      "desc": "천체에서 방출되는 빛의 스펙트럼을 분석하여 우주 초기에 형성된 원소와 천체의 구성 물질을 추론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "물질과 규칙성",
      "code": "10통과1-02-02",
      "desc": "우주 초기의 원소들로부터 태양계의 재료이면서 생명체를 구성하는 원소들이 형성되는 과정을 통해 지구와 생명의 역사가 우주 역사의 일부분임을 해석할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "물질과 규칙성",
      "code": "10통과1-02-03",
      "desc": "세상을 구성하는 원소들의 성질이 주기성을 나타내는 현상을 통해 자연의 규칙성을 도출하고, 지구와 생명체를 구성하는 주요 원소들이 결합을 형성하는 이유를 해석할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "물질과 규칙성",
      "code": "10통과1-02-04",
      "desc": "인류의 생존에 필수적인 물, 산소, 소금 등이 만들어지는 결합의 차이를 이해하고 각 물질의 성질과 관련지어 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "물질과 규칙성",
      "code": "10통과1-02-05",
      "desc": "지각과 생명체를 구성하는 물질들이 기본 단위체의 결합을 통해서 형성된다는 것을 규산염 광물, 단백질과 핵산의 예를 통해 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "물질과 규칙성",
      "code": "10통과1-02-06",
      "desc": "지구를 구성하는 물질을 전기적 성질에 따라 구분할 수 있고, 물질의 전기적 성질을 응용하여 일상생활과 첨단기술에서 다양한 소재로 활용됨을 인식한다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "시스템과 상호작용",
      "code": "10통과1-03-01",
      "desc": "지구시스템은 태양계라는 시스템의 구성요소임을 알고, 지구시스템을 구성하는 권역들 간의 물질 순환과 에너지 흐름의 결과로 나타나는 현상을 논증할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "시스템과 상호작용",
      "code": "10통과1-03-02",
      "desc": "지권의 변화를 판구조론 관점에서 해석하고, 에너지 흐름의 결과로 발생하는 지권의 변화가 지구시스템에 미치는 영향을 추론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "시스템과 상호작용",
      "code": "10통과1-03-03",
      "desc": "중력의 작용으로 인한 지구 표면과 지구 주위의 다양한 운동을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "시스템과 상호작용",
      "code": "10통과1-03-04",
      "desc": "상호작용이 없을 때 물체가 가속되지 않음을 알고, 충격량과 운동량의 관계를 충돌 관련 안전장치와 스포츠에 적용할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "시스템과 상호작용",
      "code": "10통과1-03-05",
      "desc": "생명 시스템을 유지하기 위해서 다양한 화학 반응과 물질 출입이 필요함을 이해하고, 일상생활에서 활용되는 화학 반응 사례를 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "통합과학1",
      "domain": "시스템과 상호작용",
      "code": "10통과1-03-06",
      "desc": "생명 시스템의 유지에 필요한 세포 내 정보의 흐름을 유전자로부터 단백질이 만들어지는 과정을 중심으로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학탐구실험1",
      "domain": "과학의 본성과 역사 속의 과학 탐구",
      "code": "10과탐1-01-01",
      "desc": "과학사에서 패러다임의 전환을 가져온 결정적 실험을 따라 해보고, 과학의 발전 과정에 관해 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학탐구실험1",
      "domain": "과학의 본성과 역사 속의 과학 탐구",
      "code": "10과탐1-01-02",
      "desc": "과학사의 다양한 사례들로부터 과학의 본성을 추론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학탐구실험1",
      "domain": "과학 탐구의 과정과 절차",
      "code": "10과탐1-02-01",
      "desc": "직접적인 관찰을 통한 탐구를 수행하고, 귀납적 탐구 방법을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학탐구실험1",
      "domain": "과학 탐구의 과정과 절차",
      "code": "10과탐1-02-02",
      "desc": "가설 설정을 포함한 과학사의 대표적인 탐구실험을 수행하고, 연역적 탐구 방법의 특징을 예증할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학탐구실험1",
      "domain": "과학 탐구의 과정과 절차",
      "code": "10과탐1-02-03",
      "desc": "탐구 수행에서 얻은 정성적 혹은 정량적 데이터를 분석하고 그 결과를 다양하게 표상하고 소통할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학탐구실험1",
      "domain": "과학 탐구의 과정과 절차",
      "code": "10과탐1-02-04",
      "desc": "흥미와 호기심을 갖고 과학 탐구에 참여하고, 분야 간 협동 연구 등을 통해 협력적 탐구 활동을 수행하며, 도출한 결과를 증거에 근거하여 해석하고 평가할 수 있다."
    },
    {
      "dept": "체육",
      "subject": "체육1",
      "domain": "건강 관리",
      "code": "12체육1-01-01",
      "desc": "신체활동이 건강에 영향을 미치는 기전과 효과를 탐구한다."
    },
    {
      "dept": "체육",
      "subject": "체육1",
      "domain": "건강 관리",
      "code": "12체육1-01-02",
      "desc": "생애주기별 건강 관리 방법에 따라 건강을 체계적으로 관리하여 자아 존중감을 높인다."
    },
    {
      "dept": "체육",
      "subject": "체육1",
      "domain": "건강 관리",
      "code": "12체육1-01-03",
      "desc": "건강 관리 측면에서 고려해야 할 다양한 안전 요소를 이해하고, 안전사고에 적절하게 대처한다."
    },
    {
      "dept": "체육",
      "subject": "체육1",
      "domain": "전략형 스포츠",
      "code": "12체육1-02-01",
      "desc": "전략형 스포츠 문화의 개념과 특성을 탐색한다."
    },
    {
      "dept": "체육",
      "subject": "체육1",
      "domain": "전략형 스포츠",
      "code": "12체육1-02-02",
      "desc": "전략형 스포츠의 경기 기능을 과학적 원리에 따라 분석하고, 적극적으로 개선한다."
    },
    {
      "dept": "체육",
      "subject": "체육1",
      "domain": "전략형 스포츠",
      "code": "12체육1-02-03",
      "desc": "전략형 스포츠의 경기 방법 및 전략을 이해하고, 경기 상황에 맞게 응용한다."
    },
    {
      "dept": "체육",
      "subject": "체육1",
      "domain": "생태형 스포츠",
      "code": "12체육1-03-01",
      "desc": "생태형 스포츠 문화의 개념과 특성을 탐색하고, 스포츠 환경에 대한 생태 감수성을 실천한다."
    },
    {
      "dept": "체육",
      "subject": "체육1",
      "domain": "생태형 스포츠",
      "code": "12체육1-03-02",
      "desc": "생태형 스포츠의 경기 기능을 과학적 원리에 따라 분석하고, 적극적으로 개선한다."
    },
    {
      "dept": "체육",
      "subject": "체육1",
      "domain": "생태형 스포츠",
      "code": "12체육1-03-03",
      "desc": "생태형 스포츠의 경기 방법 및 전략을 이해하고, 경기 상황에 맞게 응용한다."
    },
    {
      "dept": "음악",
      "subject": "음악",
      "domain": "연주",
      "code": "12음01-01",
      "desc": "다양한 주법과 표현 기법을 심화시켜 노래나 악기로 개성 있게 연주한다."
    },
    {
      "dept": "음악",
      "subject": "음악",
      "domain": "연주",
      "code": "12음01-02",
      "desc": "음악 요소와 음악적 특징의 변화를 살려 노래나 악기로 발표하고 비평한다."
    },
    {
      "dept": "음악",
      "subject": "음악",
      "domain": "연주",
      "code": "12음01-03",
      "desc": "소리의 상호작용을 인식하고 다양한 매체를 적용하여 표현하며 연주로 소통한다."
    },
    {
      "dept": "음악",
      "subject": "음악",
      "domain": "연주",
      "code": "12음01-04",
      "desc": "다양한 상황과 맥락을 고려하여 연주를 생활 속에서 실천하며 서로 다른 연주 문화를 존중한다."
    },
    {
      "dept": "음악",
      "subject": "음악",
      "domain": "감상",
      "code": "12음02-01",
      "desc": "음악을 듣고 다양한 음악 요소와 원리를 인지하며 분석한다."
    },
    {
      "dept": "음악",
      "subject": "음악",
      "domain": "감상",
      "code": "12음02-02",
      "desc": "다양한 시대ㆍ사회ㆍ문화권의 음악을 듣고 음악적 특징과 구성의 변화를 해석한다."
    },
    {
      "dept": "음악",
      "subject": "음악",
      "domain": "감상",
      "code": "12음02-03",
      "desc": "다양한 시대ㆍ사회ㆍ문화권의 음악을 듣고 맥락, 기능, 기여의 관점에서 비평한다."
    },
    {
      "dept": "음악",
      "subject": "음악",
      "domain": "감상",
      "code": "12음02-04",
      "desc": "생활 속에서 음악을 들으며 감성, 정체성, 가치를 내면화하고 향유한다."
    },
    {
      "dept": "음악",
      "subject": "음악",
      "domain": "감상",
      "code": "12음02-05",
      "desc": "시대별 국악을 듣고 비평하며, 국악을 계승ㆍ발전시키려는 태도를 갖는다."
    },
    {
      "dept": "음악",
      "subject": "음악",
      "domain": "창작",
      "code": "12음03-01",
      "desc": "다양한 맥락과 연계되는 음악적 의도나 아이디어를 여러 매체나 방법에 적용하여 창작하고 성찰한다."
    },
    {
      "dept": "음악",
      "subject": "음악",
      "domain": "창작",
      "code": "12음03-02",
      "desc": "오선보, 정간보 등의 다양한 기보법을 활용하여 주제에 맞게 악곡을 변화시킨다."
    },
    {
      "dept": "음악",
      "subject": "음악",
      "domain": "창작",
      "code": "12음03-03",
      "desc": "음악 요소와 음악적 특징의 변화를 활용하여 다양한 형식의 음악을 만든다."
    },
    {
      "dept": "음악",
      "subject": "음악",
      "domain": "창작",
      "code": "12음03-04",
      "desc": "생활 속에서 여러 영역과 융합한 음악을 만들며, 저작권의 중요성 및 음악의 역할과 기여에 대하여 인식한다."
    },
    {
      "dept": "미술",
      "subject": "미술",
      "domain": "미적 체험",
      "code": "12미01-01",
      "desc": "자신과 세계를 지각하고 미적으로 인식하며, 대상과 현상의 미적 가치를 발견하고 분석할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술",
      "domain": "미적 체험",
      "code": "12미01-02",
      "desc": "시각 문화의 다양성과 의미 전달 방식을 이해하여 시각 문화를 비판적으로 수용하고 향유할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술",
      "domain": "미적 체험",
      "code": "12미01-03",
      "desc": "이미지를 활용한 소통방식을 탐구하여 미술이 삶 속에서 가지는 의미에 대해 공감할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술",
      "domain": "미적 체험",
      "code": "12미01-04",
      "desc": "삶과 연결된 미술을 이해하여 공동체와 생태환경으로 확장할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술",
      "domain": "표현",
      "code": "12미02-01",
      "desc": "다양한 발상으로 주제를 심화하여 작품을 계획할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술",
      "domain": "표현",
      "code": "12미02-02",
      "desc": "주제에 적합한 표현 매체와 방법을 실험하고 융합하는 과정에 집중할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술",
      "domain": "표현",
      "code": "12미02-03",
      "desc": "표현 과정을 성찰하고 새로운 표현 효과를 탐색하여 다음 작품에 반영할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술",
      "domain": "표현",
      "code": "12미02-04",
      "desc": "주제를 확장하기 위한 미술 활동에 관심을 가지고 참여할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술",
      "domain": "감상",
      "code": "12미03-01",
      "desc": "미술의 시대적, 지역적, 사회ㆍ문화적 변천 과정을 이해하고 작품을 감상하며 자신의 견해를 논리적으로 표현할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술",
      "domain": "감상",
      "code": "12미03-02",
      "desc": "비평 방법을 활용하여 미술과 시대, 사회, 환경과의 상호 관련성을 분석하고 가치를 판단할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술",
      "domain": "감상",
      "code": "12미03-03",
      "desc": "미술 작품 감상과 비평의 관점을 활용한 소통으로 미술 문화의 다원적 가치를 이해하고 존중할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술",
      "domain": "감상",
      "code": "12미03-04",
      "desc": "전시의 목적과 유형을 이해하여 전시를 기획하고 참여할 수 있다."
    },
    {
      "dept": "기술·가정",
      "subject": "생활과학 탐구",
      "domain": "인간행동과 생활과학",
      "code": "12생활01-01",
      "desc": "인간의 특성에 대한 긍정적 태도를 바탕으로 인간 발달에 대한 이론과 발달의 특성을 탐구한다."
    },
    {
      "dept": "기술·가정",
      "subject": "생활과학 탐구",
      "domain": "인간행동과 생활과학",
      "code": "12생활01-02",
      "desc": "아동기까지의 삶의 질이 전 생애에 끼치는 장기적이며 결정적인 영향을 이해하여 아동상담의 필요성과 사례를 탐구하여, 관련 분야로의 진로를 탐색한다."
    },
    {
      "dept": "기술·가정",
      "subject": "생활과학 탐구",
      "domain": "인간행동과 생활과학",
      "code": "12생활01-03",
      "desc": "사회변화에 따라 파생된 가족생활교육 및 가족생활 복지서비스의 필요성을 이해하고, 새로운 정책을 탐구하며, 관련된 분야로의 진로를 탐색한다."
    },
    {
      "dept": "기술·가정",
      "subject": "생활과학 탐구",
      "domain": "인간행동과 생활과학",
      "code": "12생활01-04",
      "desc": "소비문화를 선도하는 소비자가 되기 위해 현대 소비문화의 이해를 바탕으로 미래 소비 동향을 예측하여 소비 트렌드를 분석하고 제안한다."
    },
    {
      "dept": "기술·가정",
      "subject": "생활과학 탐구",
      "domain": "인간행동과 생활과학",
      "code": "12생활01-05",
      "desc": "소비자 심리를 이해하여 소비 행동을 예측해보며, 소비와 관련한 직업의 세계를 탐색하고 진로를 설계한다."
    },
    {
      "dept": "기술·가정",
      "subject": "생활과학 탐구",
      "domain": "생활환경과 생활과학",
      "code": "12생활02-01",
      "desc": "생활습관병의 원인을 분석하고, 올바른 관리법을 익혀 건강한 삶을 위한 실천 방안을 탐색하고 관련 분야로의 진로를 탐색한다."
    },
    {
      "dept": "기술·가정",
      "subject": "생활과학 탐구",
      "domain": "생활환경과 생활과학",
      "code": "12생활02-02",
      "desc": "식품 가공의 원리를 이해하고 올바른 정보 분별 능력을 길러 가공식품을 건강하고 안전하게 이용하는 방안을 탐색하며, 관련된 분야의 진로를 탐색한다."
    },
    {
      "dept": "기술·가정",
      "subject": "생활과학 탐구",
      "domain": "생활환경과 생활과학",
      "code": "12생활02-03",
      "desc": "올바른 식재료를 선택하고 조리 과정 중에 일어나는 성분 등의 변화를 이해하여 과학적 원리를 적용한 음식을 만든다."
    },
    {
      "dept": "기술·가정",
      "subject": "생활과학 탐구",
      "domain": "생활환경과 생활과학",
      "code": "12생활02-04",
      "desc": "패션디자인의 기본 개념과 유행하는 스타일을 파악하여 패션 산업의 동향을 탐색하며, 관련된 분야의 진로를 탐색한다."
    },
    {
      "dept": "기술·가정",
      "subject": "생활과학 탐구",
      "domain": "생활환경과 생활과학",
      "code": "12생활02-05",
      "desc": "패션디자인과 머천다이징에 대한 이해를 바탕으로 패션상품을 기획하고 디자인을 하며 하나의 브랜드를 기획한다."
    },
    {
      "dept": "기술·가정",
      "subject": "생활과학 탐구",
      "domain": "생활환경과 생활과학",
      "code": "12생활02-06",
      "desc": "정치ㆍ경제, 사회ㆍ문화의 변화에 따른 주거 트렌드를 탐구하고 인간다운 주거환경을 실현할 수 있는 주거복지 정책을 제안한다."
    },
    {
      "dept": "기술·가정",
      "subject": "생활과학 탐구",
      "domain": "생활환경과 생활과학",
      "code": "12생활02-07",
      "desc": "주거공간을 구성하고 있는 요소와 원리를 이해하여 라이프 스타일에 적합한 생활 공간을 기획하며, 관련된 분야의 진로를 탐색한다."
    },
    {
      "dept": "기술·가정",
      "subject": "생활과학 탐구",
      "domain": "생활과학과 진로",
      "code": "12생활03-01",
      "desc": "생활과학 분야와 관련된 사회적 변화와 산업 추세를 분석하여 생할과학 분야의 다양한 진로를 탐색하고 요구하는 능력을 길러 체계적으로 진로를 설계한다."
    },
    {
      "dept": "기술·가정",
      "subject": "생활과학 탐구",
      "domain": "생활과학과 진로",
      "code": "12생활03-02",
      "desc": "현재와 미래의 인간 삶의 기본이 되는 의식주 및 소비생활에 관련된 요구를 분석하여 체인지 메이커의 역할을 수행하며 창업의 아이디어를 제안한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "컴퓨팅 시스템",
      "code": "12정01-01",
      "desc": "유무선 네트워크의 특성을 이해하고, 컴퓨팅 시스템 간 공유, 협력, 소통을 위한 네트워크 환경을 구성한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "컴퓨팅 시스템",
      "code": "12정01-02",
      "desc": "사물인터넷의 구성과 동작 원리를 분석하고, 사물인터넷 기술로 인한 개인의 삶과 사회의 변화를 예측한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "컴퓨팅 시스템",
      "code": "12정01-03",
      "desc": "문제 해결에 적합한 피지컬 컴퓨팅 시스템 장치를 선택하여 사물인터넷 시스템을 설계한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "데이터",
      "code": "12정02-01",
      "desc": "디지털 데이터 압축의 개념과 필요성을 이해하고, 압축의 효율성을 분석하여 평가한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "데이터",
      "code": "12정02-02",
      "desc": "암호화의 개념을 이해하고, 암호화를 활용하여 데이터를 안전하게 관리하는 사례를 비교ㆍ분석한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "데이터",
      "code": "12정02-03",
      "desc": "빅데이터의 개념과 특징에 대한 이해를 바탕으로, 문제 해결에 적합한 데이터를 수집한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "데이터",
      "code": "12정02-04",
      "desc": "빅데이터 분석 도구를 활용하여 데이터를 시각화하고 그 의미와 가치를 해석한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "알고리즘과 프로그래밍",
      "code": "12정03-01",
      "desc": "복잡한 문제를 해결 가능한 작은 문제로 분해하고 모델링한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "알고리즘과 프로그래밍",
      "code": "12정03-02",
      "desc": "데이터를 정렬하는 다양한 알고리즘의 특징과 효율을 비교ㆍ분석한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "알고리즘과 프로그래밍",
      "code": "12정03-03",
      "desc": "데이터를 탐색하는 다양한 알고리즘의 특징과 효율을 비교ㆍ분석한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "알고리즘과 프로그래밍",
      "code": "12정03-04",
      "desc": "자료형의 종류와 특성을 알고, 적합한 자료형을 선택하여 프로그램을 작성한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "알고리즘과 프로그래밍",
      "code": "12정03-05",
      "desc": "표준입출력과 파일입출력을 활용한 프로그램을 작성한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "알고리즘과 프로그래밍",
      "code": "12정03-06",
      "desc": "다차원 데이터 구조를 활용한 프로그램을 작성한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "알고리즘과 프로그래밍",
      "code": "12정03-07",
      "desc": "다양한 제어 구조를 복합적으로 활용한 프로그램을 작성한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "알고리즘과 프로그래밍",
      "code": "12정03-08",
      "desc": "객체를 구현하는 클래스와 인스턴스를 활용하여 프로그램을 작성한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "알고리즘과 프로그래밍",
      "code": "12정03-09",
      "desc": "실생활 및 다양한 학문 분야의 문제 해결을 위한 프로그램을 협력적으로 설계ㆍ구현한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "알고리즘과 프로그래밍",
      "code": "12정03-10",
      "desc": "문제 해결을 위한 프로그램의 성능을 평가하고 공유한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "인공지능",
      "code": "12정04-01",
      "desc": "지능 에이전트의 개념과 특성을 이해하고, 인간과 인공지능의 관계를 분석한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "인공지능",
      "code": "12정04-02",
      "desc": "기계학습의 개념을 이해하고, 지도학습과 비지도학습의 차이를 비교ㆍ분석한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "인공지능",
      "code": "12정04-03",
      "desc": "기계학습을 활용하여 해결할 수 있는 문제와 그렇지 않은 문제를 구분하고, 사회문제 해결에 기계학습을 적용한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "디지털 문화",
      "code": "12정05-01",
      "desc": "디지털 기술이 사회에 미치는 영향력을 분석하고 발전 방향을 예측하여 진로를 설계한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "디지털 문화",
      "code": "12정05-02",
      "desc": "보호해야 할 정보와 공유해야 할 정보를 구분하고, 올바른 정보 보호 방법을 실천한다."
    },
    {
      "dept": "정보",
      "subject": "정보",
      "domain": "디지털 문화",
      "code": "12정05-03",
      "desc": "정보보안의 필요성을 이해하고, 보안 기술을 활용하여 디지털 윤리를 실천한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "듣기",
      "code": "12중어01-01",
      "desc": "발음을 듣고 성모, 운모, 성조를 변별한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "듣기",
      "code": "12중어01-02",
      "desc": "낱말이나 구, 간단한 문장을 듣고 의미를 파악한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "듣기",
      "code": "12중어01-03",
      "desc": "일상생활과 관련된 간단한 대화문이나 짧은 글을 듣고 의미를 파악한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "듣기",
      "code": "12중어01-04",
      "desc": "짧은 글이나 대화를 듣고 말의 의도를 추측하거나 그에 상응하는 반응을 보인다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "말하기",
      "code": "12중어02-01",
      "desc": "낱말이나 구, 간단한 문장을 발음에 유의하여 말한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "말하기",
      "code": "12중어02-02",
      "desc": "낱말이나 구, 간단한 문장을 활용하여 질문하거나 대답한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "말하기",
      "code": "12중어02-03",
      "desc": "학습한 의사소통 표현을 상황에 맞게 자신감을 가지고 말한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "말하기",
      "code": "12중어02-04",
      "desc": "다양한 매체를 활용하여 적극적으로 자신의 생각과 느낌을 말한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "읽기",
      "code": "12중어03-01",
      "desc": "한어병음이나 기초적인 한자를 식별하고 소리 내어 읽는다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "읽기",
      "code": "12중어03-02",
      "desc": "낱말이나 구, 간단한 문장을 발음에 유의하여 읽고 의미를 파악한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "읽기",
      "code": "12중어03-03",
      "desc": "간단한 대화문이나 글, 시각 자료를 읽고 주제나 의미를 파악한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "읽기",
      "code": "12중어03-04",
      "desc": "디지털 매체상의 간단한 글을 찾아 읽고 주제나 의미를 파악한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "쓰기",
      "code": "12중어04-01",
      "desc": "낱말이나 구, 간단한 문장을 한어병음이나 한자로 정확하게 쓴다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "쓰기",
      "code": "12중어04-02",
      "desc": "낱말의 용법과 기본 어순에 유의하여 짧은 문장을 작성한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "쓰기",
      "code": "12중어04-03",
      "desc": "다양한 유형의 텍스트에서 요구되는 간단한 정보를 기입한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "쓰기",
      "code": "12중어04-04",
      "desc": "상황이나 목적에 맞게 간단한 글을 작성한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "문화",
      "code": "12중어05-01",
      "desc": "중국 문화 내용을 이해하여 중국어 의사소통 상황에 활용한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "문화",
      "code": "12중어05-02",
      "desc": "중국 문화 내용을 조사하고 정보를 요약하거나 분석한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "문화",
      "code": "12중어05-03",
      "desc": "상호문화적 관점에서 한중 문화를 비교하고 문화적 다양성을 이해한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "문화",
      "code": "12중어05-04",
      "desc": "중국 문화를 직간접적으로 체험하고, 다양한 매체를 활용하여 정보를 공유한다."
    },
    {
      "dept": "제2외국어",
      "subject": "중국어",
      "domain": "문화",
      "code": "12중어05-05",
      "desc": "중국 문화에 대해 호기심을 갖고 수업이나 과제 활동에 적극적으로 참여한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "듣기",
      "code": "12일어01-01",
      "desc": "음성적 특징에 유의하여 듣고 문자와 낱말을 식별한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "듣기",
      "code": "12일어01-02",
      "desc": "낱말, 간단한 구나 문장을 듣고 의미와 내용을 이해한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "듣기",
      "code": "12일어01-03",
      "desc": "일상생활과 관련된 간단한 글이나 대화를 듣고 핵심어나 대의를 파악하거나 추론한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "듣기",
      "code": "12일어01-04",
      "desc": "간단한 글이나 대화를 경청하고 적절하게 반응한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "말하기",
      "code": "12일어02-01",
      "desc": "음성적 특징에 유의하여 낱말, 간단한 구나 문장을 말한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "말하기",
      "code": "12일어02-02",
      "desc": "간단한 구나 문장으로 자신의 생각이나 느낌을 말한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "말하기",
      "code": "12일어02-03",
      "desc": "간단한 의사소통 기본 표현을 활용하여 상황에 맞게 말한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "말하기",
      "code": "12일어02-04",
      "desc": "지위나 친밀도를 고려하고 언어문화적 차이를 존중하며 상황에 맞게 말한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "말하기",
      "code": "12일어02-05",
      "desc": "상대방의 말을 존중하며 대화에 적극적으로 참여한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "읽기",
      "code": "12일어03-01",
      "desc": "음성적 특징에 유의하여 낱말, 한자, 간단한 구나 문장을 소리 내어 읽는다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "읽기",
      "code": "12일어03-02",
      "desc": "낱말, 간단한 구나 문장을 읽고 의미를 이해한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "읽기",
      "code": "12일어03-03",
      "desc": "간단한 글이나 대화문을 읽고 대의나 세부 내용을 파악하거나 추론한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "읽기",
      "code": "12일어03-04",
      "desc": "간단한 디지털 텍스트를 읽고 주요 정보를 이해한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "쓰기",
      "code": "12일어04-01",
      "desc": "가나와 학습용 한자, 낱말을 바르게 쓴다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "쓰기",
      "code": "12일어04-02",
      "desc": "간단한 구나 문장을 표기법과 어법에 맞게 쓴다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "쓰기",
      "code": "12일어04-03",
      "desc": "간단한 대화문이나 글을 상황과 목적에 맞게 작성한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "쓰기",
      "code": "12일어04-04",
      "desc": "지위나 친밀도, 언어문화적 차이를 고려하여 간단한 글을 형식에 맞게 작성한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "문화",
      "code": "12일어05-01",
      "desc": "일본 문화 내용을 이해한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "문화",
      "code": "12일어05-02",
      "desc": "일본 문화 내용을 조사･정리하여 다양한 콘텐츠를 제작한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "문화",
      "code": "12일어05-03",
      "desc": "일본 문화 내용을 상호문화적 관점에서 온오프라인으로 의견을 공유한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "문화",
      "code": "12일어05-04",
      "desc": "언어문화･비언어 문화를 포함한 일본 문화 내용을 의사소통 상황에 활용한다."
    },
    {
      "dept": "제2외국어",
      "subject": "일본어",
      "domain": "문화",
      "code": "12일어05-05",
      "desc": "일본 문화에 대해 호기심을 가지고 수업이나 과제 활동에 적극적으로 참여한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 과학",
      "domain": "스포츠와 사회과학",
      "code": "12스과01-01",
      "desc": "스포츠와 사회과학의 관계를 이해하고, 스포츠 현상을 분석한 심리ㆍ사회학적 이론을 탐구하며, 스포츠 사회과학 분야 진로를 설계한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 과학",
      "domain": "스포츠와 사회과학",
      "code": "12스과01-02",
      "desc": "스포츠 경기 활동에 참여하며, 심리ㆍ사회학적 이론의 적용 가능성을 탐색하고 경기 상황에 적용한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 과학",
      "domain": "스포츠와 사회과학",
      "code": "12스과01-03",
      "desc": "스포츠와 심리ㆍ사회학적 이론을 융합하는 태도와 과학적 안목을 발휘한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 과학",
      "domain": "스포츠와 자연과학",
      "code": "12스과02-01",
      "desc": "스포츠와 자연과학의 관계를 이해하고, 스포츠 현상을 분석한 생리ㆍ역학적 이론을 탐구하며, 스포츠 자연과학 분야의 진로를 설계한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 과학",
      "domain": "스포츠와 자연과학",
      "code": "12스과02-02",
      "desc": "스포츠 경기 활동에 참여하여 생리ㆍ역학적 이론의 적용 가능성을 탐색하고 경기 상황에 적용한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 과학",
      "domain": "스포츠와 자연과학",
      "code": "12스과02-03",
      "desc": "스포츠와 생리ㆍ역학적 이론을 융합하는 태도와 과학적 안목을 발휘한다."
    },
    {
      "dept": "미술",
      "subject": "미술 감상과 비평",
      "domain": "미술 감상",
      "code": "12미감01-01",
      "desc": "미술의 역사, 정치, 경제, 사회적 변천 과정과 특징을 분석하여 작가와 작품의 미술사적 의의를 이해할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술 감상과 비평",
      "domain": "미술 감상",
      "code": "12미감01-02",
      "desc": "자신의 삶과 관련된 작가와 작품을 탐색하여 공감하고 진로와 연결할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술 감상과 비평",
      "domain": "미술 감상",
      "code": "12미감01-03",
      "desc": "온오프라인 전시 공간에서 작품을 감상하고 해석하며 서로의 의견을 포용할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술 감상과 비평",
      "domain": "미술 감상",
      "code": "12미감01-04",
      "desc": "작가와 작품의 특징을 맥락적으로 이해하는 과정에서 문화 다양성을 수용하고 공동체 의식을 함양할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술 감상과 비평",
      "domain": "미술 비평",
      "code": "12미감02-01",
      "desc": "미술 작품의 특징, 지식과 정보 등의 근거를 바탕으로 작품의 의미를 이해하고 설명할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술 감상과 비평",
      "domain": "미술 비평",
      "code": "12미감02-02",
      "desc": "다양한 미술 비평 방법을 이해하고 활용하여 작품을 해석하고 평가할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술 감상과 비평",
      "domain": "미술 비평",
      "code": "12미감02-03",
      "desc": "비평 관점에 따라 자신의 반응을 명료화하고 작품의 가치를 판단하며 미술 용어를 활용하여 논리적으로 표현할 수 있다."
    },
    {
      "dept": "미술",
      "subject": "미술 감상과 비평",
      "domain": "미술 비평",
      "code": "12미감02-04",
      "desc": "사회적 이슈를 비롯하여 타 분야와 연계한 비평 활동으로 형성된 비판적 사고를 사회와 삶으로 확장할 수 있다."
    },
    {
      "dept": "국어",
      "subject": "문학",
      "domain": "",
      "code": "12문학01-12",
      "desc": "주체적인 문학 활동을 생활화하여 지속적으로 문학을 즐기는 태도를 지닌다."
    },
    {
      "dept": "국어",
      "subject": "문학",
      "domain": "",
      "code": "12문학01-11",
      "desc": "문학을 통해 공동체가 처한 여러 문제들을 이해하고 문제 해결에 참여하는 태도를 지닌다."
    },
    {
      "dept": "국어",
      "subject": "문학",
      "domain": "",
      "code": "12문학01-10",
      "desc": "문학을 통하여 자아를 성찰하고, 타자를 이해하며 상호 소통한다."
    },
    {
      "dept": "국어",
      "subject": "문학",
      "domain": "",
      "code": "12문학01-09",
      "desc": "다양한 매체로 구현된 작품의 창의적 표현 방법과 심미적 가치를 문학적 관점에서 수용하고 소통한다."
    },
    {
      "dept": "국어",
      "subject": "문학",
      "domain": "",
      "code": "12문학01-08",
      "desc": "작품을 읽고 새로운 시각으로 재구성하거나 주체적인 관점에서 작품을 창작한다."
    },
    {
      "dept": "국어",
      "subject": "문학",
      "domain": "",
      "code": "12문학01-07",
      "desc": "작품을 공감적, 비판적, 창의적으로 감상하며, 다양한 방식으로 작품에 대해 비평한다."
    },
    {
      "dept": "국어",
      "subject": "문학",
      "domain": "",
      "code": "12문학01-06",
      "desc": "문학 작품에서는 내용과 형식이 긴밀하게 연관됨을 이해하며 작품을 수용한다."
    },
    {
      "dept": "국어",
      "subject": "문학",
      "domain": "",
      "code": "12문학01-05",
      "desc": "한국 작품과 외국 작품을 비교하며 읽고 한국 문학의 보편성과 특수성을 파악한다."
    },
    {
      "dept": "국어",
      "subject": "문학",
      "domain": "",
      "code": "12문학01-04",
      "desc": "한국 문학에 반영된 시대 상황을 이해하고 문학과 역사의 상호 영향 관계를 탐구한다."
    },
    {
      "dept": "국어",
      "subject": "문학",
      "domain": "",
      "code": "12문학01-03",
      "desc": "주요 작품을 중심으로 한국 문학의 범위와 갈래, 변화 양상을 탐구한다."
    },
    {
      "dept": "국어",
      "subject": "문학",
      "domain": "",
      "code": "12문학01-02",
      "desc": "문학의 여러 갈래들의 특성과 문학의 맥락에 대해 이해한다."
    },
    {
      "dept": "국어",
      "subject": "문학",
      "domain": "",
      "code": "12문학01-01",
      "desc": "문학이 인간과 세계에 대한 이해를 돕고, 삶의 의미를 깨닫게 하며, 정서적ㆍ미적으로 삶을 고양함을 이해한다."
    },
    {
      "dept": "국어",
      "subject": "독서 토론과 글쓰기",
      "domain": "",
      "code": "12독토01-07",
      "desc": "독서 토론과 글쓰기의 특성을 이해하고 독서, 독서 토론, 글쓰기에 능동적으로 참여한다."
    },
    {
      "dept": "국어",
      "subject": "독서 토론과 글쓰기",
      "domain": "",
      "code": "12독토01-06",
      "desc": "사회적인 현안이나 쟁점이 담긴 책을 읽고 독서 토론하고 글을 쓰며 공동체 문제를 해결하고 사회적 담론에 참여한다."
    },
    {
      "dept": "국어",
      "subject": "독서 토론과 글쓰기",
      "domain": "",
      "code": "12독토01-05",
      "desc": "다양한 분야의 정보가 담긴 책을 읽고 독서 토론하고 글을 쓰며 학습이나 삶에 필요한 지식을 확장하고 교양을 함양한다."
    },
    {
      "dept": "국어",
      "subject": "독서 토론과 글쓰기",
      "domain": "",
      "code": "12독토01-04",
      "desc": "인간의 삶에 대한 다양한 시각과 해석이 담긴 책을 읽고 독서 토론하고 글을 쓰며 자아를 탐색하고 타자와 세계를 이해한다."
    },
    {
      "dept": "국어",
      "subject": "독서 토론과 글쓰기",
      "domain": "",
      "code": "12독토01-03",
      "desc": "독서 토론의 내용을 바탕으로 쓰기 목적, 독자, 매체를 고려하여 글을 쓰고 공유한다."
    },
    {
      "dept": "국어",
      "subject": "독서 토론과 글쓰기",
      "domain": "",
      "code": "12독토01-02",
      "desc": "대화, 토의, 토론 등 적절한 방법을 활용하여, 서로 다른 생각과 관점을 존중하며 독서 토론을 한다."
    },
    {
      "dept": "국어",
      "subject": "독서 토론과 글쓰기",
      "domain": "",
      "code": "12독토01-01",
      "desc": "개인이나 공동체의 관심사를 고려하여 읽을 책을 선정한 후 질문을 생성하고 주체적으로 해석하며 책을 읽는다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "수열",
      "code": "12대수03-07",
      "desc": "수학적 귀납법의 원리를 이해하고, 이를 이용하여 명제를 증명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "수열",
      "code": "12대수03-06",
      "desc": "수열의 귀납적 정의를 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "수열",
      "code": "12대수03-05",
      "desc": "여러 가지 수열의 첫째항부터 제n항까지의 합을 구하는 방법을 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "수열",
      "code": "12대수03-04",
      "desc": "∑의 뜻과 성질을 이해하고, 이를 활용하여 문제를 해결할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "수열",
      "code": "12대수03-03",
      "desc": "등비수열의 뜻을 알고, 일반항, 첫째항부터 제n항까지의 합을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "수열",
      "code": "12대수03-02",
      "desc": "등차수열의 뜻을 알고, 일반항, 첫째항부터 제n항까지의 합을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "수열",
      "code": "12대수03-01",
      "desc": "수열의 뜻을 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "삼각함수",
      "code": "12대수02-03",
      "desc": "사인법칙과 코사인법칙을 이해하고, 실생활 문제를 해결할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "삼각함수",
      "code": "12대수02-02",
      "desc": "삼각함수의 개념을 이해하여 사인함수, 코사인함수, 탄젠트함수의 그래프를 그리고, 그 성질을 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "삼각함수",
      "code": "12대수02-01",
      "desc": "일반각과 호도법의 뜻을 알고, 그 관계를 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "지수함수와 로그함수",
      "code": "12대수01-08",
      "desc": "지수함수, 로그함수를 활용하여 문제를 해결할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "지수함수와 로그함수",
      "code": "12대수01-07",
      "desc": "지수함수와 로그함수의 그래프를 그릴 수 있고, 그 성질을 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "지수함수와 로그함수",
      "code": "12대수01-06",
      "desc": "지수함수와 로그함수의 뜻을 알고, 이를 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "지수함수와 로그함수",
      "code": "12대수01-05",
      "desc": "상용로그를 이해하고, 이를 실생활과 연결하여 문제를 해결할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "지수함수와 로그함수",
      "code": "12대수01-04",
      "desc": "로그의 뜻을 알고, 그 성질을 이용하여 계산할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "지수함수와 로그함수",
      "code": "12대수01-03",
      "desc": "지수법칙을 이해하고, 이를 이용하여 식을 간단히 나타낼 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "지수함수와 로그함수",
      "code": "12대수01-02",
      "desc": "지수가 유리수, 실수까지 확장될 수 있음을 이해하고, 이를 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "대수",
      "domain": "지수함수와 로그함수",
      "code": "12대수01-01",
      "desc": "거듭제곱과 거듭제곱근의 뜻을 알고, 그 성질을 이용하여 계산할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "인공지능 수학",
      "domain": "인공지능과 수학 탐구",
      "code": "12인수05-02",
      "desc": "인공지능과 관련된 수학 주제를 선정하여 탐구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "인공지능 수학",
      "domain": "인공지능과 수학 탐구",
      "code": "12인수05-01",
      "desc": "수학적 원리를 이용하여 인공지능이 실생활 문제를 합리적으로 해결하는 사례를 찾을 수 있다."
    },
    {
      "dept": "수학",
      "subject": "인공지능 수학",
      "domain": "예측과 최적화",
      "code": "12인수04-04",
      "desc": "경사하강법을 이해하고 최적화된 예측을 위한 인공지능의 학습 방법을 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "인공지능 수학",
      "domain": "예측과 최적화",
      "code": "12인수04-03",
      "desc": "손실함수를 이해하고 최적화된 추세선을 찾을 수 있다."
    },
    {
      "dept": "수학",
      "subject": "인공지능 수학",
      "domain": "예측과 최적화",
      "code": "12인수04-02",
      "desc": "공학 도구를 사용하여 데이터의 경향성을 추세선으로 나타내고 이를 예측에 이용할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "인공지능 수학",
      "domain": "예측과 최적화",
      "code": "12인수04-01",
      "desc": "데이터를 분석하여 사건이 일어날 확률을 구하고 이를 예측에 이용할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "인공지능 수학",
      "domain": "이미지 데이터 처리",
      "code": "12인수03-03",
      "desc": "인공지능이 이미지를 자동으로 분류하는 수학적 방법을 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "인공지능 수학",
      "domain": "이미지 데이터 처리",
      "code": "12인수03-02",
      "desc": "행렬의 연산을 이용하여 이미지 데이터를 다양하게 변환할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "인공지능 수학",
      "domain": "이미지 데이터 처리",
      "code": "12인수03-01",
      "desc": "행렬을 이용하여 이미지 데이터를 목적에 맞게 표현할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "인공지능 수학",
      "domain": "텍스트 데이터 처리",
      "code": "12인수02-03",
      "desc": "인공지능이 텍스트를 특성에 따라 분석하는 수학적 방법을 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "인공지능 수학",
      "domain": "텍스트 데이터 처리",
      "code": "12인수02-02",
      "desc": "빈도수 벡터를 이용하여 텍스트 데이터를 요약하고 유용한 정보를 추출할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "인공지능 수학",
      "domain": "텍스트 데이터 처리",
      "code": "12인수02-01",
      "desc": "집합과 벡터를 이용하여 텍스트 데이터를 목적에 맞게 표현할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "인공지능 수학",
      "domain": "인공지능과 빅데이터",
      "code": "12인수01-03",
      "desc": "빅데이터의 개념과 특성을 알고 인공지능에서 빅데이터를 활용한 사례를 찾을 수 있다."
    },
    {
      "dept": "수학",
      "subject": "인공지능 수학",
      "domain": "인공지능과 빅데이터",
      "code": "12인수01-02",
      "desc": "인공지능에서 수학을 활용한 역사적 사례를 탐구하고 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "인공지능 수학",
      "domain": "인공지능과 빅데이터",
      "code": "12인수01-01",
      "desc": "인공지능의 개념을 이해하고 학습 방식을 수학적으로 해석할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "이해",
      "code": "12영Ⅰ-01-01",
      "desc": "말이나 글의 세부 정보를 파악한다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "이해",
      "code": "12영Ⅰ-01-02",
      "desc": "말이나 글의 주제나 요지를 파악한다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "이해",
      "code": "12영Ⅰ-01-03",
      "desc": "화자나 필자의 심정이나 의도를 추론한다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "이해",
      "code": "12영Ⅰ-01-04",
      "desc": "말이나 글에서 일이나 사건의 논리적 관계를 파악한다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "이해",
      "code": "12영Ⅰ-01-05",
      "desc": "말이나 글의 맥락을 바탕으로 어구나 문장의 함축적 의미를 추론한다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "이해",
      "code": "12영Ⅰ-01-06",
      "desc": "말이나 글의 전개 방식이나 구조를 파악한다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "이해",
      "code": "12영Ⅰ-01-07",
      "desc": "적절한 전략을 활용하여 다양한 매체로 된 말이나 글의 의미를 파악한다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "이해",
      "code": "12영Ⅰ-01-08",
      "desc": "우리 문화 및 타 문화의 다양한 관점에 대해 포용하고 공감하는 태도를 가진다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "표현",
      "code": "12영Ⅰ-02-01",
      "desc": "사실적 정보를 말이나 글로 설명한다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "표현",
      "code": "12영Ⅰ-02-02",
      "desc": "경험이나 계획 또는 일이나 사건을 말이나 글로 설명한다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "표현",
      "code": "12영Ⅰ-02-03",
      "desc": "상대방을 배려하고 존중하는 태도로 자신의 의견이나 감정을 표현한다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "표현",
      "code": "12영Ⅰ-02-04",
      "desc": "듣거나 읽은 내용을 말이나 글로 요약한다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "표현",
      "code": "12영Ⅰ-02-05",
      "desc": "서신, 신청서, 지원서 등의 서식을 목적에 맞게 작성한다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "표현",
      "code": "12영Ⅰ-02-06",
      "desc": "글의 구조나 내용 및 표현을 점검하고 쓰기 윤리를 준수하여 고쳐 쓴다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "표현",
      "code": "12영Ⅰ-02-07",
      "desc": "다양한 매체와 적절한 전략을 활용하여 정보를 창의적으로 전달한다."
    },
    {
      "dept": "영어",
      "subject": "영어Ⅰ",
      "domain": "표현",
      "code": "12영Ⅰ-02-08",
      "desc": "협력적이고 능동적으로 말하기나 쓰기 과업을 수행한다."
    },
    {
      "dept": "영어",
      "subject": "영미 문학 읽기",
      "domain": "",
      "code": "12영문01-01",
      "desc": "다양한 장르와 주제의 문학 작품을 읽고 주요 내용을 요약한다."
    },
    {
      "dept": "영어",
      "subject": "영미 문학 읽기",
      "domain": "",
      "code": "12영문01-02",
      "desc": "문학 작품을 읽고 필자나 인물의 의도나 목적을 파악한다."
    },
    {
      "dept": "영어",
      "subject": "영미 문학 읽기",
      "domain": "",
      "code": "12영문01-03",
      "desc": "문학 작품을 읽고 자신의 느낌이나 감상을 공유하고 표현한다."
    },
    {
      "dept": "영어",
      "subject": "영미 문학 읽기",
      "domain": "",
      "code": "12영문01-04",
      "desc": "이야기나 희곡을 읽고 작품의 구조를 분석하여 구성 요소를 설명한다."
    },
    {
      "dept": "영어",
      "subject": "영미 문학 읽기",
      "domain": "",
      "code": "12영문01-05",
      "desc": "시를 읽고 운율, 이미지, 은유, 상징 등의 문학적 비유 표현과 의미를 파악하고, 창의적인 말이나 글의 형태로 표현한다."
    },
    {
      "dept": "영어",
      "subject": "영미 문학 읽기",
      "domain": "",
      "code": "12영문01-06",
      "desc": "다양한 매체를 활용하여 문학 작품의 내용을 다양한 관점으로 분석ㆍ비평한다."
    },
    {
      "dept": "영어",
      "subject": "영미 문학 읽기",
      "domain": "",
      "code": "12영문01-07",
      "desc": "문학 작품을 읽고 우리 문화와 타 문화의 생활 양식, 사고방식, 의사소통 방식의 차이와 다양성에 대해 비교ㆍ분석한다."
    },
    {
      "dept": "영어",
      "subject": "영미 문학 읽기",
      "domain": "",
      "code": "12영문01-08",
      "desc": "문학 작품을 읽고 표현이나 주제의 예술적 가치에 대한 심미적인 태도를 기른다."
    },
    {
      "dept": "사회",
      "subject": "세계시민과 지리",
      "domain": "세계시민, 세계화와 지역 이해",
      "code": "12세지01-01",
      "desc": "세계화의 의미를 지리적 스케일에 따라 이해하고, 세계화와 지역화의 관계 속에서 세계시민의 역할을 탐색한다."
    },
    {
      "dept": "사회",
      "subject": "세계시민과 지리",
      "domain": "세계시민, 세계화와 지역 이해",
      "code": "12세지01-02",
      "desc": "지역 통합과 분리 현상의 사례와 주요 원인을 탐구하고, 이를 바탕으로 지역 변화의 역동성을 파악한다."
    },
    {
      "dept": "사회",
      "subject": "세계시민과 지리",
      "domain": "세계시민, 세계화와 지역 이해",
      "code": "12세지01-03",
      "desc": "지리정보기술이 세계시민의 삶과 연계되는 다양한 모습을 이해하고, 지리적 문제 해결 및 의사 결정에 활용되는 사례를 조사한다."
    },
    {
      "dept": "사회",
      "subject": "세계시민과 지리",
      "domain": "모자이크 세계, 세계의 다양한 자연환경과 문화",
      "code": "12세지02-01",
      "desc": "세계의 다양한 기후에 대한 이해를 바탕으로 기후를 활용하거나 극복한 사례를 찾아 인간 생활과의 관계를 탐색한다."
    },
    {
      "dept": "사회",
      "subject": "세계시민과 지리",
      "domain": "모자이크 세계, 세계의 다양한 자연환경과 문화",
      "code": "12세지02-02",
      "desc": "세계 주요 지형과 인간 생활의 상관성을 파악하고, 지형의 개발과 보존을 둘러싼 갈등 사례를 통해 지속가능한 이용 방안을 토론한다."
    },
    {
      "dept": "사회",
      "subject": "세계시민과 지리",
      "domain": "모자이크 세계, 세계의 다양한 자연환경과 문화",
      "code": "12세지02-03",
      "desc": "세계 주요 종교의 특징 및 종교 경관의 의미를 이해하고, 각 종교가 인간 생활에 미치는 영향을 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "세계시민과 지리",
      "domain": "모자이크 세계, 세계의 다양한 자연환경과 문화",
      "code": "12세지02-04",
      "desc": "세계의 다양한 음식과 축제를 지리적으로 설명하고, 문화 다양성을 보존하기 위한 방법을 모색한다."
    },
    {
      "dept": "사회",
      "subject": "세계시민과 지리",
      "domain": "네트워크 세계, 세계의 인구와 경제 공간",
      "code": "12세지03-01",
      "desc": "세계 인구 분포 및 구조를 통해 세계 인구 문제를 이해하고, 국제적 이주가 인구 유출 지역과 유입 지역에 미치는 영향을 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "세계시민과 지리",
      "domain": "네트워크 세계, 세계의 인구와 경제 공간",
      "code": "12세지03-02",
      "desc": "주요 식량 자원의 생산과 소비 양상을 통해 세계 식량 문제가 발생하는 구조적 원인을 파악하고, 식량의 안정적인 생산과 공급을 위한 각국의 대응 전략을 비교ㆍ분석한다."
    },
    {
      "dept": "사회",
      "subject": "세계시민과 지리",
      "domain": "네트워크 세계, 세계의 인구와 경제 공간",
      "code": "12세지03-03",
      "desc": "초국적 기업을 중심으로 한 글로벌 경제 체제의 형성 과정을 탐색하고, 글로벌 경제에서의 공간적 불균등을 해소하기 위한 국제적 협력과 개인적 실천 방안에 대해 조사한다."
    },
    {
      "dept": "사회",
      "subject": "세계시민과 지리",
      "domain": "지속가능한 세계, 세계의 환경 문제와 평화",
      "code": "12세지04-01",
      "desc": "세계 주요 에너지 자원의 생산과 소비 현황을 조사하고, 다양한 친환경 에너지원의 특징에 대한 이해를 바탕으로 지속가능한 에너지 생산 방안을 제시한다."
    },
    {
      "dept": "사회",
      "subject": "세계시민과 지리",
      "domain": "지속가능한 세계, 세계의 환경 문제와 평화",
      "code": "12세지04-02",
      "desc": "세계 주요 환경 문제의 유형과 실태를 설명하고, 생태전환적 삶에 비추어 현재의 생활방식을 비판적으로 점검한다."
    },
    {
      "dept": "사회",
      "subject": "세계시민과 지리",
      "domain": "지속가능한 세계, 세계의 환경 문제와 평화",
      "code": "12세지04-03",
      "desc": "다양한 지정학적 분쟁을 국제 정세의 변화와 관련지어 조사하고, 세계 평화와 정의에 기여할 수 있는 방안을 찾아 실천한다."
    },
    {
      "dept": "사회",
      "subject": "사회와 문화",
      "domain": "사회현상의 이해와 탐구",
      "code": "12사문01-01",
      "desc": "사회현상의 탐구를 위해 사회현상의 특징에 대한 이해와 사회학적 상상력이 필요함을 인식하고, 사회현상에 대한 다양한 관점을 비교한다."
    },
    {
      "dept": "사회",
      "subject": "사회와 문화",
      "domain": "사회현상의 이해와 탐구",
      "code": "12사문01-02",
      "desc": "사회현상에 대한 양적 연구 방법과 질적 연구 방법의 특징 및 연구 절차를 비교하고, 각 연구 방법을 활용한 연구 사례를 분석한다."
    },
    {
      "dept": "사회",
      "subject": "사회와 문화",
      "domain": "사회현상의 이해와 탐구",
      "code": "12사문01-03",
      "desc": "사회현상에 대한 다양한 자료 수집 방법의 특징을 비교하고, 각 자료 수집 방법을 활용한 연구 사례를 분석한다."
    },
    {
      "dept": "사회",
      "subject": "사회와 문화",
      "domain": "사회현상의 이해와 탐구",
      "code": "12사문01-04",
      "desc": "사회현상의 탐구에서 발생하는 연구자의 가치 개입 및 연구 윤리 관련 쟁점을 토론하고, 연구 윤리를 준수하며 사회현상에 대한 탐구를 수행한다."
    },
    {
      "dept": "사회",
      "subject": "사회와 문화",
      "domain": "사회 구조와 사회 변동",
      "code": "12사문02-01",
      "desc": "사회 구조와 개인의 관계에 대한 이해를 바탕으로 개인의 사회화 과정, 사회화 기관 및 유형을 설명하고, 사회화에 대한 서로 다른 이론적 관점을 비교한다."
    },
    {
      "dept": "사회",
      "subject": "사회와 문화",
      "domain": "사회 구조와 사회 변동",
      "code": "12사문02-02",
      "desc": "사회 집단 및 사회 조직의 유형과 변화 양상에 대한 이해를 바탕으로 사회 집단 및 사회 조직이 개인의 사회생활과 사회적 관계에 미치는 영향을 설명한다."
    },
    {
      "dept": "사회",
      "subject": "사회와 문화",
      "domain": "사회 구조와 사회 변동",
      "code": "12사문02-03",
      "desc": "일탈 행동의 발생 요인이나 특성을 설명하는 다양한 일탈 이론을 비교하고, 일탈 행동에 대한 사회 통제의 유형과 사회 통제의 필요성 및 문제점을 분석한다."
    },
    {
      "dept": "사회",
      "subject": "사회와 문화",
      "domain": "사회 구조와 사회 변동",
      "code": "12사문02-04",
      "desc": "사회 변동이 다양한 요인의 복합적인 상호 작용의 산물이라는 점을 설명하고, 현대 사회의 변동 과정에서 나타나는 다양한 사회 운동의 유형과 특징을 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "사회와 문화",
      "domain": "일상 문화와 문화 변동",
      "code": "12사문03-01",
      "desc": "대중문화에 대한 다양한 관점을 비교하고, 일상적으로 접하는 사례를 중심으로 대중문화가 개인과 사회에 미치는 영향을 토의한다."
    },
    {
      "dept": "사회",
      "subject": "사회와 문화",
      "domain": "일상 문화와 문화 변동",
      "code": "12사문03-02",
      "desc": "미디어의 효과에 대한 이해를 바탕으로 미디어가 생산하는 메시지를 비판적으로 분석하고 대안적 메시지 생산에 능동적으로 참여한다."
    },
    {
      "dept": "사회",
      "subject": "사회와 문화",
      "domain": "일상 문화와 문화 변동",
      "code": "12사문03-03",
      "desc": "하위문화와 주류 문화의 관계에 대한 이해를 바탕으로 다문화 사회의 이주민 문화에 대한 서로 다른 관점을 비교하고, 이주민 문화가 갖는 의의에 기초하여 문화 다양성을 증진하기 위한 방안을 제시한다."
    },
    {
      "dept": "사회",
      "subject": "사회와 문화",
      "domain": "일상 문화와 문화 변동",
      "code": "12사문03-04",
      "desc": "문화 변동의 다양한 요인과 양상, 문화 변동 과정에서 발생하는 문제점을 이해하고, 문화의 세계화로 인해 나타나는 쟁점에 대해 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "사회와 문화",
      "domain": "사회 불평등과 사회 복지",
      "code": "12사문04-01",
      "desc": "사회 불평등 현상을 이해하는 서로 다른 관점을 비교하고, 사회 이동과 사회 계층 구조의 유형 및 특징을 분석한다."
    },
    {
      "dept": "사회",
      "subject": "사회와 문화",
      "domain": "사회 불평등과 사회 복지",
      "code": "12사문04-02",
      "desc": "현대 사회에서 나타나는 다양한 사회 불평등 양상을 분석하고, 차별받는 사람들의 입장에 대한 공감을 바탕으로 다양한 불평등 현상에 대한 해결 방안을 모색한다."
    },
    {
      "dept": "사회",
      "subject": "사회와 문화",
      "domain": "사회 불평등과 사회 복지",
      "code": "12사문04-03",
      "desc": "복지 국가의 발전 과정에 대한 이해를 바탕으로 사회 복지 제도의 유형과 특징을 비교하고, 현대 사회에서 나타나고 있는 사회 복지를 둘러싼 쟁점을 토론한다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "현대 생활과 윤리",
      "code": "12현윤01-01",
      "desc": "윤리학의 성격과 특징을 바탕으로 윤리적 존재로서의 인간 본성을 이해하고, 현대사회의 다양한 윤리 문제를 탐구 및 토론할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "현대 생활과 윤리",
      "code": "12현윤01-02",
      "desc": "동양 및 서양의 윤리사상, 사회사상의 접근들을 비교 분석하고, 이를 현대사회의 다양한 윤리 문제와 쟁점에 적용하여 윤리적 해결 방안을 도출할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "생명윤리와 생태윤리",
      "code": "12현윤02-01",
      "desc": "삶과 죽음을 동·서양 윤리의 입장에서 성찰하고, 현대사회에서 발생하는 생명윤리 문제를 다양한 윤리적 관점에서 설명할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "생명윤리와 생태윤리",
      "code": "12현윤02-02",
      "desc": "사랑과 성에 관한 다양한 입장과 성차별의 윤리적 문제를 이해하고, 현대사회의 결혼 및 가족 문제를 윤리적 관점에서 탐구할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "생명윤리와 생태윤리",
      "code": "12현윤02-03",
      "desc": "자연을 바라보는 동·서양의 관점을 비교ㆍ설명할 수 있으며 오늘날 환경 문제의 사례와 심각성을 조사하고, 이에 대한 윤리적 해결 방안을 제시할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "과학과 디지털 학습 환경 윤리",
      "code": "12현윤03-01",
      "desc": "과학기술 연구에 대한 다양한 관점을 조사하여 비교·설명할 수 있으며 이를 과학기술의 사회적 책임 문제에 적용하여 비판 또는 정당화할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "과학과 디지털 학습 환경 윤리",
      "code": "12현윤03-02",
      "desc": "정보통신 기술과 뉴미디어의 발달에 따른 윤리 문제들을 제시할 수 있으며 이에 대한 해결 방안을 정보윤리와 미디어 윤리의 관점에서 제시할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "과학과 디지털 학습 환경 윤리",
      "code": "12현윤03-03",
      "desc": "윤리적인 인공지능을 위하여 인간과 인공지능의 관계를 설명하고, 인공지능으로 인해 발생하는 윤리 문제의 해결 방안을 인공지능 윤리의 관점에서 제시할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "민주시민과 윤리",
      "code": "12현윤04-01",
      "desc": "직업의 의의와 다양한 직업군에 따른 직업윤리를 제시할 수 있으며 공동체 발전을 위한 청렴한 삶과 노동의 가치에 대한 사회적 존중의 필요성을 설명할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "민주시민과 윤리",
      "code": "12현윤04-02",
      "desc": "개인선과 공동선의 조화가 필요한 이유를 설명할 수 있으며, 시민의 정치참여 필요성과 시민 불복종의 조건 및 정당성을 제시할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "민주시민과 윤리",
      "code": "12현윤04-03",
      "desc": "공정한 분배를 이루기 위한 정책을 분배 정의 이론을 통해 비판 또는 정당화할 수 있으며, 사형 제도와 형벌을 교정적 정의의 관점에서 비판 또는 정당화할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "문화와 경제생활의 윤리",
      "code": "12현윤05-01",
      "desc": "미적 가치와 윤리적 가치를 예술과 도덕의 관계 차원에서 설명할 수 있으며 현대의 대중문화의 순기능과 역기능을 윤리적 관점에서 이해하고 성찰할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "문화와 경제생활의 윤리",
      "code": "12현윤05-02",
      "desc": "의식주 생활과 관련된 윤리 문제와 경제생활에서 발생하는 도덕적 선과 이윤 추구 사이의 갈등 및 소비문화의 문제점을 윤리적 관점에서 비판할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "문화와 경제생활의 윤리",
      "code": "12현윤05-03",
      "desc": "다문화 이론을 통해 문화의 다양성을 존중해야 할 필요성을 인식하고 종교 갈등, 이주민 차별 등과 같은 다문화 관련 문제의 해결 방안을 제시할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "평화와 공존의 윤리",
      "code": "12현윤06-01",
      "desc": "다양한 사회적 갈등의 양상을 제시하고 동·서양의 윤리 이론을 바탕으로 사회통합을 위한 방안을 제안할 수 있으며, 바람직한 소통과 담론을 실천할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "평화와 공존의 윤리",
      "code": "12현윤06-02",
      "desc": "한반도의 통일과 평화에 관한 쟁점을 객관적으로 이해하고, 보편적인 윤리적 가치를 바탕으로 남북한의 화해를 위한 개인적·국가적 노력을 구체적으로 제시할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "현대사회와 윤리",
      "domain": "평화와 공존의 윤리",
      "code": "12현윤06-03",
      "desc": "국제 사회의 윤리 문제를 국제 정의의 관점에서 비판적으로 설명하고, 국제 사회에 대한 책임과 기여를 윤리적 관점에서 정당화하고 실천 방안을 제시할 수 있다."
    },
    {
      "dept": "사회",
      "subject": "동아시아 역사 기행",
      "domain": "동아시아로 떠나는 역사 기행",
      "code": "12동역01-01",
      "desc": "역사 기행을 통한 탐구의 방법을 이해하고, 동아시아의 범위와 특징을 파악한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아 역사 기행",
      "domain": "동아시아로 떠나는 역사 기행",
      "code": "12동역01-02",
      "desc": "생태환경을 바탕으로 형성된 유목 세계, 농경 세계, 해양 세계의 삶을 이해한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아 역사 기행",
      "domain": "교류와 갈등의 현장에서 만난 역사",
      "code": "12동역02-01",
      "desc": "동아시아의 지역 간 교류를 보여주는 문화유산을 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아 역사 기행",
      "domain": "교류와 갈등의 현장에서 만난 역사",
      "code": "12동역02-02",
      "desc": "종교와 사상을 중심으로 동아시아 각 지역 간 교류 양상을 파악한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아 역사 기행",
      "domain": "교류와 갈등의 현장에서 만난 역사",
      "code": "12동역02-03",
      "desc": "몽골의 팽창 및 17세기 전후 동아시아 전쟁이 초래한 변화를 이해한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아 역사 기행",
      "domain": "교류와 갈등의 현장에서 만난 역사",
      "code": "12동역02-04",
      "desc": "이슬람과 유럽 세력의 참여를 통해 확대된 동아시아 교류의 모습을 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아 역사 기행",
      "domain": "침략과 저항의 현장에서 만난 역사",
      "code": "12동역03-01",
      "desc": "동아시아 지역에서 전개된 제국주의 열강의 침략 전쟁을 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아 역사 기행",
      "domain": "침략과 저항의 현장에서 만난 역사",
      "code": "12동역03-02",
      "desc": "아시아·태평양 전쟁과 이에 대한 저항과 연대의 움직임을 파악한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아 역사 기행",
      "domain": "침략과 저항의 현장에서 만난 역사",
      "code": "12동역03-03",
      "desc": "제국주의 열강의 침략과 전쟁이 지역 생활과 생태환경에 끼친 영향을 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아 역사 기행",
      "domain": "평화와 공존의 현장에서 만난 역사",
      "code": "12동역04-01",
      "desc": "냉전 시기 동아시아 지역에서 전개된 전쟁을 탐구하고, 각국의 정치·사회적 변화를 파악한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아 역사 기행",
      "domain": "평화와 공존의 현장에서 만난 역사",
      "code": "12동역04-02",
      "desc": "경제 및 대중문화 교류가 확대되는 모습을 이해하고, 다문화 사회의 현실을 파악하여 공존을 위한 노력을 모색한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아 역사 기행",
      "domain": "평화와 공존의 현장에서 만난 역사",
      "code": "12동역04-03",
      "desc": "동아시아의 역사 및 영토 갈등과 새롭게 대두되는 문제를 파악하고 해결하려는 자세를 갖는다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "힘과 에너지",
      "code": "12물리01-01",
      "desc": "물체에 작용하는 알짜힘과 돌림힘이 0일 때 평형을 이룸을 알고, 다양한 구조물의 안정성을 분석할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "힘과 에너지",
      "code": "12물리01-02",
      "desc": "뉴턴 운동 법칙으로 등가속도 운동을 설명하고, 교통안전 사고 예방에 적용할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "힘과 에너지",
      "code": "12물리01-03",
      "desc": "작용과 반작용 관계와 운동량 보존 법칙을 알고, 스포츠, 교통수단, 발사체 등에 적용할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "힘과 에너지",
      "code": "12물리01-04",
      "desc": "일과 운동 에너지의 관계를 이해하고, 위치 에너지와 역학적 에너지 보존 법칙을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "힘과 에너지",
      "code": "12물리01-05",
      "desc": "역학적 에너지가 열의 형태로 전환될 때 에너지 총량이 변하지 않음을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "힘과 에너지",
      "code": "12물리01-06",
      "desc": "열이 역학적 에너지로 전환되는 과정의 효율을 정성적으로 이해하고, 영구기관이 불가능함을 사례를 통해 논증할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "전기와 자기",
      "code": "12물리02-01",
      "desc": "전하를 띤 입자들이 전기장과 전위차를 형성하여 서로 전기적으로 상호작용함을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "전기와 자기",
      "code": "12물리02-02",
      "desc": "전기 회로에서 저항의 연결에 따라 소비 전력이 달라짐을 알고, 다양한 전기 기구에서 적용되는 사례를 찾을 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "전기와 자기",
      "code": "12물리02-03",
      "desc": "축전기에서 전기 에너지를 저장하는 원리가 각종 센서와 전기 신호 입력 장치 등 실생활 제품에서 활용됨을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "전기와 자기",
      "code": "12물리02-04",
      "desc": "자성체의 종류를 알고 일상생활과 산업 기술에서 자성체가 활용되는 예를 찾을 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "전기와 자기",
      "code": "12물리02-05",
      "desc": "전류의 자기 작용을 이용하여 에너지를 전환하는 장치의 원리를 알고, 스피커와 전동기 등을 설계할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "전기와 자기",
      "code": "12물리02-06",
      "desc": "전자기 유도 현상이 센서, 무선통신, 무선충전 등 에너지 전달 기술에 적용되어 현대 문명에 미친 영향을 인식할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "빛과 물질",
      "code": "12물리03-01",
      "desc": "빛의 중첩과 간섭을 통해 빛의 파동성을 알고, 이를 이용한 기술과 현상을 예를 들어 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "빛과 물질",
      "code": "12물리03-02",
      "desc": "빛의 굴절을 이용하여 볼록렌즈에서 상이 맺히는 과정을 설명하고, 반도체와 디스플레이 제작 공정에서 중요하게 활용됨을 인식할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "빛과 물질",
      "code": "12물리03-03",
      "desc": "빛과 물질의 이중성이 전자 현미경과 영상 정보 저장 등 다양한 분야에 활용됨을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "빛과 물질",
      "code": "12물리03-04",
      "desc": "원자 내의 전자는 양자화된 에너지 준위를 가지고 있음을 스펙트럼 관찰 증거를 바탕으로 논증할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "빛과 물질",
      "code": "12물리03-05",
      "desc": "고체의 에너지띠 구조로부터 도체와 부도체의 차이를 알고, 반도체 소자의 원리를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학",
      "domain": "빛과 물질",
      "code": "12물리03-06",
      "desc": "모든 관성계에서 빛의 속력이 동일하다는 원리로부터 시간 팽창, 길이 수축 현상이 나타남을 알고, 이러한 지식이 사회에 미친 영향을 조사할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "생명 시스템의 구성",
      "code": "12생과01-01",
      "desc": "생물 및 생명과학의 특성을 이해하고 생명과학의 성과를 협력적으로 소통할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "생명 시스템의 구성",
      "code": "12생과01-02",
      "desc": "세포에서부터 생태계까지 생명 시스템의 구성 단계의 특징을 바탕으로 체계적인 설명 자료를 만들 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "생명 시스템의 구성",
      "code": "12생과01-03",
      "desc": "물질대사 과정에서의 에너지 전환 과정을 바탕으로 다양한 생명 활동에서의 에너지 사용을 추론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "생명 시스템의 구성",
      "code": "12생과01-04",
      "desc": "소화, 순환, 호흡, 배설 과정이 기관계의 통합적 작용으로 나타남을 신체의 생리적 변화와 연관지어 추론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "생명 시스템의 구성",
      "code": "12생과01-05",
      "desc": "물질대사 관련 질병 조사를 위한 방법을 고안하여 수행하고 대사성 질환을 예방하기 위한 올바른 생활 습관에 대해 토의하며 협력적으로 소통할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "생명 시스템의 구성",
      "code": "12생과01-06",
      "desc": "생태계의 구조를 이해하고 물질의 순환과 에너지의 흐름을 추론하여 생태계 구성 요소들의 중요성을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "생명 시스템의 구성",
      "code": "12생과01-07",
      "desc": "개체군과 군집의 특성을 이해하고 이들의 상호작용의 예를 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "항상성과 몸의 조절",
      "code": "12생과02-01",
      "desc": "신경 세포의 구조와 기능을 이해하고, 신경 세포에서의 전도 과정을 모식도로 표현할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "항상성과 몸의 조절",
      "code": "12생과02-02",
      "desc": "시냅스를 통한 신경 신호의 전달 과정을 이해하고, 약물이 시냅스 전달에 영향을 미치는 사례를 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "항상성과 몸의 조절",
      "code": "12생과02-03",
      "desc": "사람 신경계의 구조와 기능을 이해하고 중추 신경계와 말초 신경계의 특징을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "항상성과 몸의 조절",
      "code": "12생과02-04",
      "desc": "내분비계와 신경계 작용 원리와 상호작용의 이해를 바탕으로 우리 몸의 항상성이 유지되는 과정을 추론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "항상성과 몸의 조절",
      "code": "12생과02-05",
      "desc": "병원체의 종류와 특징을 이해하고 우리 몸의 방어 작용을 선천적 면역과 후천적 면역으로 구분하여 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "항상성과 몸의 조절",
      "code": "12생과02-06",
      "desc": "항원 항체 반응의 특이성을 이해하고, 혈액의 응집 반응 원리를 이용하여 혈액형을 판정할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "항상성과 몸의 조절",
      "code": "12생과02-07",
      "desc": "백신의 종류와 작용 원리를 조사하고 질병의 예방 측면에서 백신의 필요성을 인식하여 협력적으로 소통할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "생명의 연속성과 다양성",
      "code": "12생과03-01",
      "desc": "염색체의 구조를 이해하고, DNA, 유전자의 관계를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "생명의 연속성과 다양성",
      "code": "12생과03-02",
      "desc": "생식세포 형성과정을 체세포분열 과정과 비교하고, 생식세포 형성의 중요성을 생명의 연속성 및 다양성과 관련지어 추론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "생명의 연속성과 다양성",
      "code": "12생과03-03",
      "desc": "생물 진화의 원리를 이해하고, 생물 진화 연구의 다양한 사례를 조사하여 협력적으로 소통할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "생명의 연속성과 다양성",
      "code": "12생과03-04",
      "desc": "생물의 분류 체계를 바탕으로 각 분류군의 차이를 이해하고 생물군을 분류 체계에 따라 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학",
      "domain": "생명의 연속성과 다양성",
      "code": "12생과03-05",
      "desc": "동물과 식물 분류군의 특징을 문 수준에서 이해하고, 생물의 유연관계를 계통수로 나타낼 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "과학과제 연구",
      "domain": "과학 연구의 문제 탐색 및 선정",
      "code": "12과연01-01",
      "desc": "토론과 조사를 통해 귀납적 연구 방법과 가설 연역적 연구 방법의 특징과 차이점을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "과학과제 연구",
      "domain": "과학 연구의 문제 탐색 및 선정",
      "code": "12과연01-02",
      "desc": "문제 인식, 가설 설정, 변인 통제, 자료 해석, 결론 도출, 일반화 등의 과학 탐구 요소의 의미를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "과학과제 연구",
      "domain": "과학 연구의 문제 탐색 및 선정",
      "code": "12과연01-03",
      "desc": "과학 연구의 윤리 규정의 중요성을 인식한다."
    },
    {
      "dept": "과학계열",
      "subject": "과학과제 연구",
      "domain": "과학 연구의 문제 탐색 및 선정",
      "code": "12과연01-04",
      "desc": "관심 있는 연구 주제를 탐색하고 관련 자료를 찾아 구체적이고 독창적인 연구 주제를 선정할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "과학과제 연구",
      "domain": "과학 연구의 설계 및 수행",
      "code": "12과연02-01",
      "desc": "자료 및 문헌 조사를 통해 연구 주제와 관련 자료를 모을 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "과학과제 연구",
      "domain": "과학 연구의 설계 및 수행",
      "code": "12과연02-02",
      "desc": "연구 목적에 대한 연구 문제 또는 연구 가설을 설정할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "과학과제 연구",
      "domain": "과학 연구의 설계 및 수행",
      "code": "12과연02-03",
      "desc": "연구 목적을 달성할 수 있는 연구 방법과 내용을 설계하고 필요한 재료와 기기를 확보할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "과학과제 연구",
      "domain": "과학 연구의 설계 및 수행",
      "code": "12과연02-04",
      "desc": "과학 연구를 수행하여 자료를 수집하고 표, 그래프 등으로 변환할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "과학과제 연구",
      "domain": "과학 연구의 결론 도출 및 공유",
      "code": "12과연03-01",
      "desc": "자료를 해석하여 연구 문제 또는 연구 가설에 대한 해답을 검증할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "과학과제 연구",
      "domain": "과학 연구의 결론 도출 및 공유",
      "code": "12과연03-02",
      "desc": "연구 결과 해석을 바탕으로 동료들과 토론하며 연구 결론을 도출할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "과학과제 연구",
      "domain": "과학 연구의 결론 도출 및 공유",
      "code": "12과연03-03",
      "desc": "연구 결과를 과학 연구 보고서 형식에 맞추어 보고서로 작성할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "과학과제 연구",
      "domain": "과학 연구의 결론 도출 및 공유",
      "code": "12과연03-04",
      "desc": "연구 결과를 구두 또는 포스터 형식으로 공개 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "과학과 문명의 탄생과 통합",
      "code": "12과사01-01",
      "desc": "인류 문명의 탄생 과정에서 인류의 지혜가 담긴 과학적 사례를 발견하고, 이를 통해 과학이 인류 문명의 형성 과정에 기여하였음을 이해할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "과학과 문명의 탄생과 통합",
      "code": "12과사01-02",
      "desc": "고대 그리스 철학자의 과학적 사고나 주장 등을 조사하고, 그리스 문명이 고대에서 현대에 이르기까지 인간의 삶에 미친 영향을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "과학과 문명의 탄생과 통합",
      "code": "12과사01-03",
      "desc": "중세 시대 유럽과 중동 지역을 중심으로 종교나 문화가 과학에 기여한 바를 이해하고, 고대 그리스의 과학과 중세 과학의 특징을 비교할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "과학과 문명의 탄생과 통합",
      "code": "12과사01-04",
      "desc": "르네상스와 과학혁명이 일어난 사회문화적 배경을 조사하고, 과학과 예술 사이의 융합적 사례를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "과학과 문명의 탄생과 통합",
      "code": "12과사01-05",
      "desc": "과학 지식의 형성 과정에서 과학자의 신념이나 세계관이 영향을 준 사례를 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "변화하는 과학과 세계",
      "code": "12과사02-01",
      "desc": "상대성 이론 등과 같은 현대 과학의 등장이 당시의 사회문화에 끼친 영향을 이해함으로써 과학의 사회적 가치를 느낄 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "변화하는 과학과 세계",
      "code": "12과사02-02",
      "desc": "현대 과학의 등장 과정에서 나타난 과학자들의 논쟁이나 토론 사례를 조사하고, 과학적 의사소통에서 지켜야 할 규범과 태도를 이해할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "변화하는 과학과 세계",
      "code": "12과사02-03",
      "desc": "현대 예술 작품이나 건축물에 과학적 원리가 적용된 사례를 조사하고, 과학과 문화의 관련성을 추론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "변화하는 과학과 세계",
      "code": "12과사02-04",
      "desc": "감염병이 사회에 영향을 미친 대표적인 사례를 찾고, 과학이 사회 문제 해결에 기여함을 인식할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "변화하는 과학과 세계",
      "code": "12과사02-05",
      "desc": "과학기술이 교통수단의 발달에 미친 영향을 인식하고, 교통수단의 발전이 가져올 미래 사회의 변화를 예측할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "변화하는 과학과 세계",
      "code": "12과사02-06",
      "desc": "산업혁명 이후 나타난 과학기술이 인류 문명에 미친 긍정적 효과와 부정적 효과에 대해 토론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "과학과 인류의 미래",
      "code": "12과사03-01",
      "desc": "과학기술의 발전을 통해 새롭게 나타난 문화적 변화를 찾아보고, 과학을 주제로 하는 예술 작품이나 콘텐츠를 제작하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "과학과 인류의 미래",
      "code": "12과사03-02",
      "desc": "일상생활이나 미디어에서 사용되는 과학 용어를 조사하고, 과학 용어가 우리 사회에 미치는 파급효과를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "과학과 인류의 미래",
      "code": "12과사03-03",
      "desc": "과학기술의 발전이 음악에 영향을 끼친 사례를 탐색하고 인공지능으로 음악을 창작하거나 로봇을 활용한 연주를 통해 과학의 심미적 가치를 느낄 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "과학과 인류의 미래",
      "code": "12과사03-04",
      "desc": "인간과 기계, 사물 등을 연결하는 과학기술의 발전 동향을 파악하고 미래 사회의 변화를 예측할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "과학과 인류의 미래",
      "code": "12과사03-05",
      "desc": "가상 현실이나 증강 현실을 활용한 우리 주변의 사례를 조사하고, 이러한 기술이 미래 사회에 미칠 수 있는 영향에 대해 토론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "과학의 역사와 문화",
      "domain": "과학과 인류의 미래",
      "code": "12과사03-06",
      "desc": "집단적 의사결정을 통해 과학기술과 관련된 사회적 문제를 해결한 사례를 조사하여 과학기술에 대한 시민의 이해와 균형 있는 가치 판단의 필요성을 인식할 수 있다."
    }
  ],
  "st3": [
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "화법과 작문의 본질",
      "code": "12화작01-01",
      "desc": "사회적 의사소통 행위로서 화법과 작문의 특성을 이해한다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "화법과 작문의 본질",
      "code": "12화작01-02",
      "desc": "화법과 작문 활동이 자아 성장과 공동체 발전에 기여함을 이해한다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "화법과 작문의 본질",
      "code": "12화작01-03",
      "desc": "화법과 작문 활동에서 맥락을 고려하는 일이 중요함을 이해한다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "화법의 원리",
      "code": "12화작02-01",
      "desc": "대화 방식에 영향을 미치는 자아를 인식하고 관계 형성에 적절한 방법으로 자기를 표현한다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "화법의 원리",
      "code": "12화작02-02",
      "desc": "갈등 상황에서 자신의 생각, 감정이나 바라는 바를 진솔하게 표현한다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "화법의 원리",
      "code": "12화작02-03",
      "desc": "상대측 입론과 반론의 논리적 타당성에 대해 반대 신문하며 토론한다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "화법의 원리",
      "code": "12화작02-04",
      "desc": "협상 절차에 따라 상황에 맞는 전략을 사용하여 문제를 해결한다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "화법의 원리",
      "code": "12화작02-05",
      "desc": "면접에서의 답변 전략을 이해하고 질문의 의도를 파악하여 효과적으로 답변한다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "화법의 원리",
      "code": "12화작02-06",
      "desc": "청자의 특성에 맞게 내용을 구성하여 발표한다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "화법의 원리",
      "code": "12화작02-07",
      "desc": "화자의 공신력을 이해하고 적절한 설득 전략을 사용하여 연설한다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "화법의 원리",
      "code": "12화작02-08",
      "desc": "부탁, 요청, 거절, 사과, 감사의 말을 상황에 맞게 효과적으로 한다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "화법의 원리",
      "code": "12화작02-09",
      "desc": "상황에 맞는 언어적·준언어적·비언어적 표현 전략을 사용하여 말한다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "작문의 원리",
      "code": "12화작03-01",
      "desc": "가치 있는 정보를 선별하고 조직하여 정보를 전달하는 글을 쓴다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "작문의 원리",
      "code": "12화작03-02",
      "desc": "작문 맥락을 고려하여 자기를 소개하는 글을 쓴다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "작문의 원리",
      "code": "12화작03-03",
      "desc": "탐구 과제를 조사하여 절차와 결과가 잘 드러나게 보고하는 글을 쓴다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "작문의 원리",
      "code": "12화작03-04",
      "desc": "타당한 논거를 수집하고 적절한 설득 전략을 활용하여 설득하는 글을 쓴다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "작문의 원리",
      "code": "12화작03-05",
      "desc": "시사적인 현안이나 쟁점에 대해 자신의 관점을 수립하여 비평하는 글을 쓴다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "작문의 원리",
      "code": "12화작03-06",
      "desc": "현안을 분석하여 쟁점을 파악하고 해결 방안을 담은 건의하는 글을 쓴다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "작문의 원리",
      "code": "12화작03-07",
      "desc": "작문 맥락을 고려하여 친교의 내용을 표현하는 글을 쓴다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "작문의 원리",
      "code": "12화작03-08",
      "desc": "대상에 대한 생각이나 느낌을 바탕으로 하여 정서를 진솔하게 표현하는 글을 쓴다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "작문의 원리",
      "code": "12화작03-09",
      "desc": "일상의 체험을 기록하는 습관을 바탕으로 자신의 삶을 성찰하는 글을 쓴다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "화법과 작문의 태도",
      "code": "12화작04-01",
      "desc": "화법과 작문의 사회적 책임을 인식하고 의사소통 윤리를 준수하는 태도를 지닌다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "화법과 작문의 태도",
      "code": "12화작04-02",
      "desc": "화법과 작문의 가치를 이해하고 진심을 담아 의사소통하는 태도를 지닌다."
    },
    {
      "dept": "국어",
      "subject": "화법과 작문",
      "domain": "화법과 작문의 태도",
      "code": "12화작04-03",
      "desc": "언어 공동체의 담화 및 작문 관습을 이해하고, 건전한 화법과 작문의 문화 발전에 기여하는 태도를 지닌다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "언어와 매체의 본질",
      "code": "12언매01-01",
      "desc": "인간의 삶과 관련하여 언어의 특성을 이해한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "언어와 매체의 본질",
      "code": "12언매01-02",
      "desc": "국어의 특성과 세계 속에서의 국어의 위상을 이해한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "언어와 매체의 본질",
      "code": "12언매01-03",
      "desc": "의사소통의 매개체로서 매체의 유형과 특성을 이해한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "언어와 매체의 본질",
      "code": "12언매01-04",
      "desc": "현대 사회의 소통 현상과 관련하여 매체 언어의 특성을 이해한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "국어의 탐구와 활용",
      "code": "12언매02-01",
      "desc": "실제 국어생활을 바탕으로 음운의 체계와 변동에 대해 탐구한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "국어의 탐구와 활용",
      "code": "12언매02-02",
      "desc": "실제 국어생활을 바탕으로 품사에 따른 개별 단어의 특성을 탐구한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "국어의 탐구와 활용",
      "code": "12언매02-03",
      "desc": "단어의 짜임과 새말의 형성 과정을 탐구하고 이를 국어생활에 활용한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "국어의 탐구와 활용",
      "code": "12언매02-04",
      "desc": "단어의 의미 관계를 탐구하고 적절한 어휘 사용에 활용한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "국어의 탐구와 활용",
      "code": "12언매02-05",
      "desc": "문장의 짜임에 대해 탐구하고 정확하면서도 상황에 맞는 문장을 사용한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "국어의 탐구와 활용",
      "code": "12언매02-06",
      "desc": "문법 요소들의 개념과 표현 효과를 탐구하고 실제 국어생활에 활용한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "국어의 탐구와 활용",
      "code": "12언매02-07",
      "desc": "담화의 개념과 특성을 탐구하고 적절하고 효과적인 국어생활을 한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "국어의 탐구와 활용",
      "code": "12언매02-08",
      "desc": "시대 변화에 따른 국어 자료의 차이에 대해 살피고 각각의 자료에 나타나는 언어적 특성을 이해한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "국어의 탐구와 활용",
      "code": "12언매02-09",
      "desc": "다양한 사회에서의 국어 자료의 차이를 이해하고 상황에 맞게 국어 자료를 생산한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "국어의 탐구와 활용",
      "code": "12언매02-10",
      "desc": "다양한 갈래에 따른 국어 자료의 특성을 이해하고 적절하게 국어 자료를 생산한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "국어의 탐구와 활용",
      "code": "12언매02-11",
      "desc": "다양한 국어 자료를 통해 국어 규범을 이해하고 정확성, 적절성, 창의성을 갖춘 국어생활을 한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "매체 언어의 탐구와 활용",
      "code": "12언매03-01",
      "desc": "매체의 특성에 따라 정보가 구성되고 유통되는 방식을 알고 이를 의사소통에 활용한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "매체 언어의 탐구와 활용",
      "code": "12언매03-02",
      "desc": "다양한 관점과 가치를 고려하여 매체 자료를 수용한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "매체 언어의 탐구와 활용",
      "code": "12언매03-03",
      "desc": "목적, 수용자, 매체의 특성을 고려하여 다양한 매체 자료를 생산한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "매체 언어의 탐구와 활용",
      "code": "12언매03-04",
      "desc": "매체 언어의 창의적 표현 방법과 심미적 가치를 이해하고 향유한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "매체 언어의 탐구와 활용",
      "code": "12언매03-05",
      "desc": "매체 언어가 인간관계와 사회생활에 미치는 영향을 탐구한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "매체 언어의 탐구와 활용",
      "code": "12언매03-06",
      "desc": "매체를 바탕으로 하여 형성되는 문화에 대해 비판적으로 이해하고 주체적으로 향유한다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "언어와 매체에 관한 태도",
      "code": "12언매04-01",
      "desc": "자신의 국어생활에 대해 성찰하고 문제점을 개선하려는 태도를 지닌다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "언어와 매체에 관한 태도",
      "code": "12언매04-02",
      "desc": "자신의 매체 언어생활에 대해 성찰하고 문제점을 개선하려는 태도를 지닌다."
    },
    {
      "dept": "국어",
      "subject": "언어와 매체",
      "domain": "언어와 매체에 관한 태도",
      "code": "12언매04-03",
      "desc": "현대 사회에서 언어와 매체 언어의 가치를 이해하고 언어문화와 매체 문화의 발전에 참여하는 태도를 지닌다."
    },
    {
      "dept": "국어",
      "subject": "심화 국어",
      "domain": "논리적 사고와 의사소통",
      "code": "12심국01-01",
      "desc": "학업에 필요한 정보를 수집하여 분석한다."
    },
    {
      "dept": "국어",
      "subject": "심화 국어",
      "domain": "논리적 사고와 의사소통",
      "code": "12심국01-02",
      "desc": "대상과 목적을 고려하여 정보를 체계적으로 조직한다."
    },
    {
      "dept": "국어",
      "subject": "심화 국어",
      "domain": "논리적 사고와 의사소통",
      "code": "12심국01-03",
      "desc": "정보를 정확하고 논리적으로 전달한다."
    },
    {
      "dept": "국어",
      "subject": "심화 국어",
      "domain": "비판적 사고와 문제 해결",
      "code": "12심국02-01",
      "desc": "타인의 의견을 비판적으로 이해한다."
    },
    {
      "dept": "국어",
      "subject": "심화 국어",
      "domain": "비판적 사고와 문제 해결",
      "code": "12심국02-02",
      "desc": "자신의 생각으로 논점을 구성한다."
    },
    {
      "dept": "국어",
      "subject": "심화 국어",
      "domain": "비판적 사고와 문제 해결",
      "code": "12심국02-03",
      "desc": "문제 해결에 필요한 방안을 탐색하여 합리적으로 의사 결정한다."
    },
    {
      "dept": "국어",
      "subject": "심화 국어",
      "domain": "창의적 사고와 문화 활동",
      "code": "12심국03-01",
      "desc": "언어 예술의 아름다움을 향유한다."
    },
    {
      "dept": "국어",
      "subject": "심화 국어",
      "domain": "창의적 사고와 문화 활동",
      "code": "12심국03-02",
      "desc": "자신의 생각과 느낌을 창의적이고 아름답게 표현한다."
    },
    {
      "dept": "국어",
      "subject": "심화 국어",
      "domain": "창의적 사고와 문화 활동",
      "code": "12심국03-03",
      "desc": "공동체의 언어문화 발전에 능동적으로 참여하는 태도를 지닌다."
    },
    {
      "dept": "국어",
      "subject": "심화 국어",
      "domain": "윤리적 사고와 학문 활동",
      "code": "12심국04-01",
      "desc": "쓰기 윤리의 중요성을 인식하고 책임감 있는 태도로 글을 쓴다."
    },
    {
      "dept": "국어",
      "subject": "심화 국어",
      "domain": "윤리적 사고와 학문 활동",
      "code": "12심국04-02",
      "desc": "협력적이고 비판적인 태도로 문제를 탐구한다."
    },
    {
      "dept": "국어",
      "subject": "심화 국어",
      "domain": "윤리적 사고와 학문 활동",
      "code": "12심국04-03",
      "desc": "매체 이용과 표현의 윤리를 준수하는 태도를 지닌다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-수열의 극한",
      "code": "12미적01-01",
      "desc": "수열의 수렴, 발산의 뜻을 알고, 이를 판별할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-수열의 극한",
      "code": "12미적01-02",
      "desc": "수열의 극한에 대한 기본 성질을 이해하고, 이를 이용하여 극한값을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-수열의 극한",
      "code": "12미적01-03",
      "desc": "등비수열의 극한값을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-수열의 극한",
      "code": "12미적01-04",
      "desc": "급수의 수렴, 발산의 뜻을 알고, 이를 판별할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-수열의 극한",
      "code": "12미적01-05",
      "desc": "등비급수의 뜻을 알고, 그 합을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-수열의 극한",
      "code": "12미적01-06",
      "desc": "등비급수를 활용하여 여러 가지 문제를 해결할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "미분법 - 여러 가지 함수의 미분",
      "code": "12미적02-01",
      "desc": "지수함수와 로그함수의 극한을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "미분법 - 여러 가지 함수의 미분",
      "code": "12미적02-02",
      "desc": "지수함수와 로그함수를 미분할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "미분법 - 여러 가지 함수의 미분",
      "code": "12미적02-03",
      "desc": "삼각함수의 덧셈정리를 이해한다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "미분법 - 여러 가지 함수의 미분",
      "code": "12미적02-04",
      "desc": "삼각함수의 극한을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-미분법",
      "code": "12미적02-05",
      "desc": "사인함수와 코사인함수를 미분할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-미분법",
      "code": "12미적02-06",
      "desc": "함수의 몫을 미분할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-미분법",
      "code": "12미적02-07",
      "desc": "합성함수를 미분할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-미분법",
      "code": "12미적02-08",
      "desc": "매개변수로 나타낸 함수를 미분할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-미분법",
      "code": "12미적02-09",
      "desc": "음함수와 역함수를 미분할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-미분법",
      "code": "12미적02-10",
      "desc": "이계도함수를 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-미분법",
      "code": "12미적02-11",
      "desc": "접선의 방정식을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-미분법",
      "code": "12미적02-12",
      "desc": "함수의 그래프의 개형을 그릴 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-미분법",
      "code": "12미적02-13",
      "desc": "방정식과 부등식에 대한 문제를 해결할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-미분법",
      "code": "12미적02-14",
      "desc": "속도와 가속도에 대한 문제를 해결할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-적분법",
      "code": "12미적03-01",
      "desc": "치환적분법을 이해하고, 이를 활용할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-적분법",
      "code": "12미적03-02",
      "desc": "부분적분법을 이해하고, 이를 활용할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-적분법",
      "code": "12미적03-03",
      "desc": "여러 가지 함수의 부정적분과 정적분을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-적분법",
      "code": "12미적03-04",
      "desc": "정적분과 급수의 합 사이의 관계를 이해한다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-적분법",
      "code": "12미적03-05",
      "desc": "곡선으로 둘러싸인 도형의 넓이를 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-적분법",
      "code": "12미적03-06",
      "desc": "입체도형의 부피를 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "미적분",
      "domain": "해석-적분법",
      "code": "12미적03-07",
      "desc": "속도와 거리에 대한 문제를 해결할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-이차곡선",
      "code": "12기하01-01",
      "desc": "포물선의 뜻을 알고, 포물선의 방정식을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-이차곡선",
      "code": "12기하01-02",
      "desc": "타원의 뜻을 알고, 타원의 방정식을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-이차곡선",
      "code": "12기하01-03",
      "desc": "쌍곡선의 뜻을 알고, 쌍곡선의 방정식을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-이차곡선",
      "code": "12기하01-04",
      "desc": "이차곡선과 직선의 위치 관계를 이해하고, 접선의 방정식을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-평면벡터",
      "code": "12기하02-01",
      "desc": "벡터의 뜻을 안다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-평면벡터",
      "code": "12기하02-02",
      "desc": "벡터의 덧셈, 뺄셈, 실수배를 할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-평면벡터",
      "code": "12기하02-03",
      "desc": "위치벡터의 뜻을 알고, 평면벡터와 좌표의 대응을 이해한다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-평면벡터",
      "code": "12기하02-04",
      "desc": "두 평면벡터의 내적의 뜻을 알고, 이를 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-평면벡터",
      "code": "12기하02-05",
      "desc": "좌표평면에서 벡터를 이용하여 직선과 원의 방정식을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-공간도형과 공간좌표",
      "code": "12기하03-01",
      "desc": "직선과 직선, 직선과 평면, 평면과 평면의 위치 관계에 대한 간단한 증명을 할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-공간도형과 공간좌표",
      "code": "12기하03-02",
      "desc": "삼수선의 정리를 이해하고, 이를 활용할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-공간도형과 공간좌표",
      "code": "12기하03-03",
      "desc": "정사영의 뜻을 알고, 이를 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-공간도형과 공간좌표",
      "code": "12기하03-04",
      "desc": "좌표공간에서 점의 좌표를 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-공간도형과 공간좌표",
      "code": "12기하03-05",
      "desc": "좌표공간에서 두 점 사이의 거리를 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-공간도형과 공간좌표",
      "code": "12기하03-06",
      "desc": "좌표공간에서 선분의 내분점과 외분점의 좌표를 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "기하",
      "domain": "기하-공간도형과 공간좌표",
      "code": "12기하03-07",
      "desc": "구의 방정식을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "대수-수와 생활경제",
      "code": "12경수01-01",
      "desc": "통계 자료를 활용하여 실업률, 물가지수 등과 같은 경제지표의 의미를 이해한다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "대수-수와 생활경제",
      "code": "12경수01-02",
      "desc": "경제지표의 증감을 퍼센트와 퍼센트포인트로 설명할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "대수-수와 생활경제",
      "code": "12경수01-03",
      "desc": "환율의 뜻을 알고, 환거래로부터 비례식을 활용하여 환율을 계산할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "대수-수와 생활경제",
      "code": "12경수01-04",
      "desc": "환율의 변동에 따른 손익을 계산할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "대수-수와 생활경제",
      "code": "12경수01-05",
      "desc": "세금의 종류에 따라 세금을 계산할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "대수-수열과 금융",
      "code": "12경수02-01",
      "desc": "단리와 복리를 이용하여 이자와 원리합계를 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "대수-수열과 금융",
      "code": "12경수02-02",
      "desc": "이자율과 할인율의 뜻을 안다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "대수-수열과 금융",
      "code": "12경수02-03",
      "desc": "미래에 받을 금액의 현재가치를 계산할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "대수-수열과 금융",
      "code": "12경수02-04",
      "desc": "연속복리의 의미를 이해한다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "대수-수열과 금융",
      "code": "12경수02-05",
      "desc": "연속복리를 이용하여 이자와 원리합계를 구하고, 미래에 받을 금액의 현재가치를 계산할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "대수-수열과 금융",
      "code": "12경수02-06",
      "desc": "연금의 뜻을 안다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "대수-수열과 금융",
      "code": "12경수02-07",
      "desc": "연금의 현재가치를 계산할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "해석-함수와 경제",
      "code": "12경수03-01",
      "desc": "생산, 비용과 같은 경제현상을 함수로 나타낼 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "해석-함수와 경제",
      "code": "12경수03-02",
      "desc": "함수와 그래프를 통하여 수요곡선과 공급곡선의 의미를 이해한다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "해석-함수와 경제",
      "code": "12경수03-03",
      "desc": "효용의 의미를 이해하고, 함수와 그래프를 통하여 효용을 나타낼 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "해석-함수와 경제",
      "code": "12경수03-04",
      "desc": "수요와 공급의 상호작용에 의해 균형가격이 결정되는 경제현상을 이해한다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "해석-함수와 경제",
      "code": "12경수03-05",
      "desc": "세금과 소득의 변화가 균형가격에 미치는 영향을 분석할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "해석-함수와 경제",
      "code": "12경수03-06",
      "desc": "효용함수를 이용한 의사 결정 문제를 해결할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "해석-함수와 경제",
      "code": "12경수03-07",
      "desc": "부등식의 영역의 의미를 이해하고, 이를 활용하여 경제 관련 함수의 최대, 최소 문제를 해결할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "해석-미분과 경제",
      "code": "12경수04-01",
      "desc": "미분의 의미를 이해한다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "해석-미분과 경제",
      "code": "12경수04-02",
      "desc": "미분을 이용하여 그래프의 개형을 그릴 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "해석-미분과 경제",
      "code": "12경수04-03",
      "desc": "한계생산량의 의미를 이해하고, 미분을 이용하여 최적생산량을 구할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "경제 수학",
      "domain": "해석-미분과 경제",
      "code": "12경수04-04",
      "desc": "탄력성의 의미를 이해한다."
    },
    {
      "dept": "수학",
      "subject": "수학과제 탐구",
      "domain": "과제 탐구의 이해",
      "code": "12수과01-01",
      "desc": "수학과제 탐구의 의미와 필요성을 이해한다."
    },
    {
      "dept": "수학",
      "subject": "수학과제 탐구",
      "domain": "과제 탐구의 이해",
      "code": "12수과01-02",
      "desc": "수학과제 탐구의 방법과 절차를 이해한다."
    },
    {
      "dept": "수학",
      "subject": "수학과제 탐구",
      "domain": "과제 탐구의 이해",
      "code": "12수과01-03",
      "desc": "올바른 연구 윤리를 이해한다."
    },
    {
      "dept": "수학",
      "subject": "수학과제 탐구",
      "domain": "과제 탐구 실행 및 평가",
      "code": "12수과02-01",
      "desc": "수학과 관련된 여러 가지 현상에서 탐구 주제를 선정하고 탐구 문제를 구체화할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "수학과제 탐구",
      "domain": "과제 탐구 실행 및 평가",
      "code": "12수과02-02",
      "desc": "선행 연구를 검토하고 적절한 탐구 방법을 찾아 탐구 계획을 수립할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "수학과제 탐구",
      "domain": "과제 탐구 실행 및 평가",
      "code": "12수과02-03",
      "desc": "탐구 계획에 따라 탐구를 수행할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "수학과제 탐구",
      "domain": "과제 탐구 실행 및 평가",
      "code": "12수과02-04",
      "desc": "탐구 결과를 정리하여 산출물을 만들고 발표할 수 있다."
    },
    {
      "dept": "수학",
      "subject": "수학과제 탐구",
      "domain": "과제 탐구 실행 및 평가",
      "code": "12수과02-05",
      "desc": "탐구 과정과 결과를 반성 및 평가할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어 독해와 작문",
      "domain": "읽기 영역",
      "code": "12영독03-01",
      "desc": "비교적 다양한 주제에 관한 글을 읽고 세부 정보를 파악할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어 독해와 작문",
      "domain": "읽기 영역",
      "code": "12영독03-02",
      "desc": "비교적 다양한 주제에 관한 글을 읽고 주제 및 요지를 파악할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어 독해와 작문",
      "domain": "읽기 영역",
      "code": "12영독03-03",
      "desc": "비교적 다양한 주제에 관한 글을 읽고 내용의 논리적 관계를 파악할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어 독해와 작문",
      "domain": "읽기 영역",
      "code": "12영독03-04",
      "desc": "비교적 다양한 주제에 관한 글을 읽고 필자의 의도나 글의 목적을 파악할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어 독해와 작문",
      "domain": "읽기 영역",
      "code": "12영독03-05",
      "desc": "비교적 다양한 주제에 관한 글을 읽고 필자의 심정이나 태도를 추론할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어 독해와 작문",
      "domain": "읽기 영역",
      "code": "12영독03-06",
      "desc": "비교적 다양한 주제에 관한 글을 읽고 함축적 의미를 추론할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어 독해와 작문",
      "domain": "쓰기 영역",
      "code": "12영독04-01",
      "desc": "일반적 주제에 관하여 듣거나 읽고 세부 정보를 기록할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어 독해와 작문",
      "domain": "쓰기 영역",
      "code": "12영독04-02",
      "desc": "일반적 주제에 관하여 듣거나 읽고 간단하게 요약할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어 독해와 작문",
      "domain": "쓰기 영역",
      "code": "12영독04-03",
      "desc": "일반적 주제에 관해 자신의 의견이나 감정을 쓸 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어 독해와 작문",
      "domain": "쓰기 영역",
      "code": "12영독04-04",
      "desc": "학업과 관련된 서식, 이메일, 메모 등을 작성할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어 독해와 작문",
      "domain": "쓰기 영역",
      "code": "12영독04-05",
      "desc": "미래의 계획이나 진로 등에 관하여 글을 쓸 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어 독해와 작문",
      "domain": "쓰기 영역",
      "code": "12영독04-06",
      "desc": "일반적 주제에 관한 그림, 도표 등을 설명하는 글을 쓸 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "듣기 영역",
      "code": "12영화01-01",
      "desc": "영어권 문화에 관한 말이나 대화를 듣고 생활양식, 풍습, 사고방식 등을 파악할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "듣기 영역",
      "code": "12영화01-02",
      "desc": "영어권 문화에 관한 말이나 대화를 듣고 주제 및 요지를 파악할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "듣기 영역",
      "code": "12영화01-03",
      "desc": "영어권 문화에 관한 말이나 대화를 듣고 화자의 의도나 말의 목적을 파악할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "듣기 영역",
      "code": "12영화01-04",
      "desc": "영어권 문화에 관한 말이나 대화를 듣고 화자의 심정이나 태도를 파악할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "말하기 영역",
      "code": "12영화02-01",
      "desc": "영어권 문화에 관하여 듣거나 읽고 생활양식, 풍습, 사고방식 등을 말할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "말하기 영역",
      "code": "12영화02-02",
      "desc": "영어권 문화에 관하여 듣거나 읽고 타 문화에 대한 자신의 의견이나 감정을 말할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "말하기 영역",
      "code": "12영화02-03",
      "desc": "영어권 문화와 우리 문화를 비교·대조하여 서로의 의견을 주고받을 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "말하기 영역",
      "code": "12영화02-04",
      "desc": "영어권 문화에서 사용되는 언어적·비언어적 의사소통 방식을 활용하여 묻고 답할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "읽기 영역",
      "code": "12영화03-01",
      "desc": "영어권 문화에 관한 글을 읽고 생활양식, 풍습, 사고방식 등을 파악할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "읽기 영역",
      "code": "12영화03-02",
      "desc": "영어권 문화에 관한 글을 읽고 주제 및 요지를 파악할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "읽기 영역",
      "code": "12영화03-03",
      "desc": "영어권 문화에 관한 글을 읽고 필자의 의도나 글의 목적을 파악할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "읽기 영역",
      "code": "12영화03-04",
      "desc": "영어권 문화에 관한 글을 읽고 필자의 심정이나 태도를 파악할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "쓰기 영역",
      "code": "12영화04-01",
      "desc": "영어권 문화에 관하여 듣거나 읽고 생활양식, 풍습, 사고방식 등을 기록할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "쓰기 영역",
      "code": "12영화04-02",
      "desc": "영어권 문화에 관하여 듣거나 읽고 간단하게 요약할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "쓰기 영역",
      "code": "12영화04-03",
      "desc": "영어권 문화에 관해 자신의 의견이나 감정을 쓸 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "쓰기 영역",
      "code": "12영화04-04",
      "desc": "영어권 문화에 관한 자신의 경험을 쓸 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "쓰기 영역",
      "code": "12영화04-05",
      "desc": "영어권 문화에 관한 간단한 보고서를 작성할 수 있다."
    },
    {
      "dept": "영어",
      "subject": "영어권 문화",
      "domain": "쓰기 영역",
      "code": "12영화04-06",
      "desc": "영어권 문화에 관해 비교·대조하는 글을 쓸 수 있다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "듣기 영역",
      "code": "12심영Ⅰ01-01",
      "desc": "친숙한 일반적인 주제의 뉴스, 강연, 연설, 토론을 듣고 세부 정보를 파악한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "듣기 영역",
      "code": "12심영Ⅰ01-02",
      "desc": "다양한 일반적 주제에 관한 말이나 대화를 듣고 정보를 비교·대조한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "듣기 영역",
      "code": "12심영Ⅰ01-03",
      "desc": "다양한 일반적 주제에 관한 말이나 대화를 듣고 사실과 의견을 구별한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "듣기 영역",
      "code": "12심영Ⅰ01-04",
      "desc": "친숙한 일반적인 주제의 뉴스, 강연, 연설, 토론을 듣고 주요 내용을 파악한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "듣기 영역",
      "code": "12심영Ⅰ01-05",
      "desc": "다양한 일반적 주제에 관한 말이나 대화를 듣고 주제나 요지를 파악한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "듣기 영역",
      "code": "12심영Ⅰ01-06",
      "desc": "다양한 일반적 주제에 관한 말이나 대화를 듣고 전후 내용을 추론한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "듣기 영역",
      "code": "12심영Ⅰ01-07",
      "desc": "다양한 일반적 주제에 관한 말이나 대화를 듣고 화자의 심정이나 태도를 파악한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "듣기 영역",
      "code": "12심영Ⅰ01-08",
      "desc": "다양한 일반적 주제에 관한 말이나 대화를 듣고 화자의 의도 및 목적을 파악한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "듣기 영역",
      "code": "12심영Ⅰ01-09",
      "desc": "다양한 일반적 주제에 관한 말이나 대화를 듣고 언급되지 않은 내용을 추론한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "말하기 영역",
      "code": "12심영Ⅰ02-01",
      "desc": "일반적 주제에 관한 글을 읽고 상황과 목적에 알맞게 말한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "말하기 영역",
      "code": "12심영Ⅰ02-02",
      "desc": "일반적 주제에 관한 글을 읽고, 근거를 토대로 생각이나 의견을 말한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "말하기 영역",
      "code": "12심영Ⅰ02-03",
      "desc": "일반적 주제에 관한 글을 읽고 자신의 말로 바꾸어 말한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "말하기 영역",
      "code": "12심영Ⅰ02-04",
      "desc": "일반적 주제에 관한 글을 읽고 요약하여 말한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "말하기 영역",
      "code": "12심영Ⅰ02-05",
      "desc": "일반적 주제에 관한 준비된 보고나 발표를 한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "말하기 영역",
      "code": "12심영Ⅰ02-06",
      "desc": "친숙한 일반적인 주제에 관한 토론을 듣고 주요 쟁점에 대하여 말한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "말하기 영역",
      "code": "12심영Ⅰ02-07",
      "desc": "외국인에게 우리 문화를 적절하게 설명한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "말하기 영역",
      "code": "12심영Ⅰ02-08",
      "desc": "다양한 상황에서 적절하게 대화한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "말하기 영역",
      "code": "12심영Ⅰ02-09",
      "desc": "일반적 주제에 관한 토론에 참여하여 합리적 근거로 자신의 주장을 말한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "읽기 영역",
      "code": "12심영Ⅰ03-01",
      "desc": "다양한 일반적 주제에 관한 글을 속독하여 세부 정보를 찾는다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "읽기 영역",
      "code": "12심영Ⅰ03-02",
      "desc": "다양한 주제에 관한 그림, 도표 등을 읽고 필요한 정보를 찾는다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "읽기 영역",
      "code": "12심영Ⅰ03-03",
      "desc": "다양한 일반적 주제에 관한 글을 읽고 글쓴이의 견해와 사실을 구분한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "읽기 영역",
      "code": "12심영Ⅰ03-04",
      "desc": "다양한 일반적 주제에 관한 글을 훑어 읽고 줄거리, 요지를 파악한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "읽기 영역",
      "code": "12심영Ⅰ03-05",
      "desc": "다양한 일반적 주제에 관한 글을 읽고 주요 내용을 요약한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "읽기 영역",
      "code": "12심영Ⅰ03-06",
      "desc": "쉬운 문학 작품을 읽고 줄거리를 파악한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "읽기 영역",
      "code": "12심영Ⅰ03-07",
      "desc": "다양한 일반적 주제에 관한 글을 읽고 글의 논리적 구조를 파악한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "읽기 영역",
      "code": "12심영Ⅰ03-08",
      "desc": "다양한 일반적 주제에 관한 글을 읽고 문맥을 바탕으로 익숙하지 않은 표현의 의미를 추측한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "읽기 영역",
      "code": "12심영Ⅰ03-09",
      "desc": "다양한 일반적 주제에 관한 글을 읽고 함축적 의미를 파악한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "읽기 영역",
      "code": "12심영Ⅰ03-10",
      "desc": "다양한 일반적 주제에 관한 글을 읽고 글쓴이의 의도를 파악한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "쓰기 영역",
      "code": "12심영Ⅰ04-01",
      "desc": "친숙한 일반적 주제에 관한 강의나 강연을 듣고 필요한 정보를 기록한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "쓰기 영역",
      "code": "12심영Ⅰ04-02",
      "desc": "다양한 장르의 글을 읽고 요약하여 쓴다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "쓰기 영역",
      "code": "12심영Ⅰ04-03",
      "desc": "실용 편지, 이력서, 지원서, 짧은 보고서 등을 작성한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "심화영어 I",
      "domain": "쓰기 영역",
      "code": "12심영Ⅰ04-04",
      "desc": "일반적 주제에 관해 에세이를 쓴다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "세계화와 지역 이해",
      "code": "12세지01-01",
      "desc": "세계화와 지역화가 한 장소나 지역의 정체성의 변화에 영향을 주는 사례를 조사하고, 세계화와 지역화가 공간적 상호작용에 미치는 영향을 파악한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "세계화와 지역 이해",
      "code": "12세지01-02",
      "desc": "동·서양의 옛 세계지도에 나타난 세계관 및 지리 정보의 차이를 조사하고, 오늘날의 세계지도에 표현된 주요 지리 정보들을 옛 세계지도와 비교하여 분석한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "세계화와 지역 이해",
      "code": "12세지01-03",
      "desc": "세계의 권역들을 구분하는 데에 활용되는 주요 지표들을 조사하고, 세계의 권역들을 나눈 기존의 여러 가지 사례들을 비교 분석하여 각각의 특징과 장·단점을 평가한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "세계의 자연환경과 인간 생활",
      "code": "12세지02-01",
      "desc": "기후 요인과 기후 요소에 대한 기본 이해를 바탕으로 열대 기후의 주요 특징과 요인을 분석한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "세계의 자연환경과 인간 생활",
      "code": "12세지02-02",
      "desc": "온대 동안 기후와 온대 서안 기후의 특징 및 요인을 서로 비교하고, 이러한 기후 환경에 적응한 인간 생활의 모습을 파악한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "세계의 자연환경과 인간 생활",
      "code": "12세지02-03",
      "desc": "건조 기후와 냉·한대 기후의 주요 특징을 이해하고, 이러한 기후 환경에서 형성된 주요 지형들을 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "세계의 자연환경과 인간 생활",
      "code": "12세지02-04",
      "desc": "지형형성작용에 대한 기본 이해를 바탕으로 세계의 주요 대지형의 분포 특징과 형성 원인을 분석한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "세계의 자연환경과 인간 생활",
      "code": "12세지02-05",
      "desc": "세계적으로 환경 보존이나 관광의 대상지로 주목받고 있는 주요 사례를 중심으로 카르스트 지형, 화산 지형, 해안 지형 등 여러 가지 특수한 지형들의 형성 과정을 이해한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "세계의 인문환경과 인문 경관",
      "code": "12세지03-01",
      "desc": "세계의 주요 종교별 특징과 주된 전파 경로를 분석하고, 주요 종교의 성지 및 종교 경관이 지닌 상징적 의미들을 비교하고 해석한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "세계의 인문환경과 인문 경관",
      "code": "12세지03-02",
      "desc": "세계의 일반적 인구 변천 단계와 그 지역적 차이를 파악하고, 국제적 인구 이주의 주요 사례 및 유형을 도출한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "세계의 인문환경과 인문 경관",
      "code": "12세지03-03",
      "desc": "세계도시의 선정 기준과 주요 특징을 이해하고, 세계도시체계론과 관련지어 세계도시들 사이의 상호작용과 위계 관계를 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "세계의 인문환경과 인문 경관",
      "code": "12세지03-04",
      "desc": "세계 주요 식량 자원의 특성과 분포 특징을 조사하고, 식량 생산 및 그 수요의 지역적 차이에 따른 국제적 이동 양상을 분석한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "세계의 인문환경과 인문 경관",
      "code": "12세지03-05",
      "desc": "세계 주요 에너지 자원의 특성과 분포 특징을 조사하고, 에너지 생산 및 그 수요의 지역적 차이에 따른 국제적 이동 양상을 분석한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "몬순 아시아와 오세아니아",
      "code": "12세지04-01",
      "desc": "몬순 아시아에서 나타나는 전통적 생활 모습을 지역의 자연환경과 관련지어 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "몬순 아시아와 오세아니아",
      "code": "12세지04-02",
      "desc": "몬순 아시아와 오세아니아의 주요 국가의 산업 구조를 지역의 대표적 자원 분포 및 이동과 관련지어 비교 분석한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "몬순 아시아와 오세아니아",
      "code": "12세지04-03",
      "desc": "몬순 아시아와 오세아니아의 주요 국가들에서 보이는 민족(인종)이나 종교적 차이를 조사하고, 이로 인한 최근의 지역 갈등과 해결 과제를 파악한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "건조 아시아와 북부 아프리카",
      "code": "12세지05-01",
      "desc": "건조 아시아와 북아프리카에 나타나는 전통적 생활 모습을 지역의 자연환경과 관련지어 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "건조 아시아와 북부 아프리카",
      "code": "12세지05-02",
      "desc": "건조 아시아와 북아프리카의 주요 국가의 산업 구조를 화석 에너지 자원의 분포와 관련지어 비교 분석한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "건조 아시아와 북부 아프리카",
      "code": "12세지05-03",
      "desc": "건조 아시아와 북아프리카의 주요 사막화 지역과 요인을 조사하고, 사막화의 진행으로 인한 여러 가지 지역 문제를 파악한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "유럽과 북부 아메리카",
      "code": "12세지06-01",
      "desc": "유럽과 북부 아메리카의 주요 공업 지역과 그 형성 배경을 조사하고, 최근의 변화 과정을 비교 분석한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "유럽과 북부 아메리카",
      "code": "12세지06-02",
      "desc": "유럽과 북부 아메리카의 세계적 대도시들을 조사하여 현대 도시의 내부 구조의 특징을 추론한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "유럽과 북부 아메리카",
      "code": "12세지06-03",
      "desc": "유럽과 북부 아메리카에서 나타나는 정치적 혹은 경제적 지역 통합의 사례를 조사하고, 지역의 통합에 반대하는 분리 운동의 사례와 주요 요인을 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "사하라 이남 아프리카와 중·남부 아메리카",
      "code": "12세지07-01",
      "desc": "중·남부 아메리카의 주요 국가들에서 나타나는 도시 구조의 특징과 도시 문제를 지역의 급속한 도시화나 민족(인종)의 다양성과 관련지어 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "사하라 이남 아프리카와 중·남부 아메리카",
      "code": "12세지07-02",
      "desc": "사하라 이남 아프리카의 주요 국가들이 겪고 있는 분쟁 및 저개발의 실태를 파악하고, 그 주요 요인을 식민지 경험이나 민족(인종) 및 종교 차이와 관련지어 추론한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "사하라 이남 아프리카와 중·남부 아메리카",
      "code": "12세지07-03",
      "desc": "사하라 이남 아프리카와 중·남부 아메리카에서 나타나는 자원 개발의 주요 사례들을 조사하고 환경 보존이나 자원의 정의로운 분배라는 입장에서 평가한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "공존과 평화의 세계",
      "code": "12세지08-01",
      "desc": "경제의 세계화가 파생하는 효과들이 무엇인지 파악하고, 경제의 세계화에 대응하여 여러 국가들이 공존을 위해 결성한 주요 경제 블록의 형성 배경 및 특징을 비교 분석한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "공존과 평화의 세계",
      "code": "12세지08-02",
      "desc": "지구적 환경 문제에 대처하기 위한 국제적 노력이나 생태 발자국, 가뭄 지수 등의 지표들을 조사하고, 우리가 일상에서 실천할 수 있는 방안들을 제안한다."
    },
    {
      "dept": "사회",
      "subject": "세계지리",
      "domain": "공존과 평화의 세계",
      "code": "12세지08-03",
      "desc": "세계의 평화와 정의를 위한 지구촌의 주요 노력들을 조사하고, 이에 동참하기 위한 세계시민으로서의 바람직한 가치와 태도에 대해 토론한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "동아시아 역사의 시작",
      "code": "12동사01-01",
      "desc": "동아시아 세계의 범위를 파악하고 각국 간의 관계와 교류의 역사를 이해해야 할 필요성을 인식한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "동아시아 역사의 시작",
      "code": "12동사01-02",
      "desc": "동아시아의 다양한 자연환경을 배경으로 나타난 삶의 모습을 농경과 목축을 중심으로 파악한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "동아시아 역사의 시작",
      "code": "12동사01-03",
      "desc": "구석기·신석기 시대의 유물을 중심으로 동아시아에서 다양한 문화가 발전하였음을 이해한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "동아시아 역사의 시작",
      "code": "12동사01-04",
      "desc": "동아시아 지역에서 성립했던 국가들의 발전 과정을 파악한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "동아시아 세계의 성립과 변화",
      "code": "12동사02-01",
      "desc": "인구 이동이 여러 국가와 정치 집단의 형성, 분열, 통합에 영향을 미쳤음을 설명한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "동아시아 세계의 성립과 변화",
      "code": "12동사02-02",
      "desc": "조공·책봉을 포함한 동아시아의 다양한 외교 형식이 끼친 영향과 의미를 상호적 관점에서 해석한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "동아시아 세계의 성립과 변화",
      "code": "12동사02-03",
      "desc": "율령 체제의 특징을 파악하고, 각 지역에서 유교·불교·성리학이 수용되는 과정과 영향을 비교한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "동아시아의 사회 변동과 문화 교류",
      "code": "12동사03-01",
      "desc": "17세기 전후 동아시아 전쟁의 배경, 전개 과정 및 그 결과로 나타난 각국의 변화를 파악한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "동아시아의 사회 변동과 문화 교류",
      "code": "12동사03-02",
      "desc": "동아시아 지역의 교역망 발달과 서양과의 교역 확대로 인한 은 유통의 활성화 과정을 이해한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "동아시아의 사회 변동과 문화 교류",
      "code": "12동사03-03",
      "desc": "인구 증가로 인해 도시와 상업이 발달하고 서민 문화가 융성하였음을 사례를 들어 설명한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "동아시아의 근대화 운동과 반제국주의 민족 운동",
      "code": "12동사04-01",
      "desc": "개항 이후 나타난 국제 관계의 변동을 살펴보고, 동아시아에서 일어난 근대화 운동을 비교한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "동아시아의 근대화 운동과 반제국주의 민족 운동",
      "code": "12동사04-02",
      "desc": "제국주의 침략의 실상과 일본 군국주의로 인한 전쟁의 확대 과정을 살펴보고, 그에 대항한 각국의 민족 운동을 비교하여 설명한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "동아시아의 근대화 운동과 반제국주의 민족 운동",
      "code": "12동사04-03",
      "desc": "동아시아 각국에서 서양 문물의 수용으로 나타난 사회·문화·사상적 변화 사례를 비교한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "오늘날의 동아시아",
      "code": "12동사05-01",
      "desc": "제2차 세계 대전의 전후 처리 과정을 알아보고, 동아시아에서 냉전의 심화·해체 과정과 그 영향을 분석한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "오늘날의 동아시아",
      "code": "12동사05-02",
      "desc": "동아시아 각국에서 나타난 정치·경제·사회적 발전 모습을 비교하여 파악한다."
    },
    {
      "dept": "사회",
      "subject": "동아시아사",
      "domain": "오늘날의 동아시아",
      "code": "12동사05-03",
      "desc": "오늘날 동아시아 국가 간의 갈등과 분쟁 사례를 살펴보고 그 해결을 위해 노력하는 자세를 갖는다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "사회？문화 현상의 탐구",
      "code": "12사문01-01",
      "desc": "사회·문화 현상이 갖는 특성을 분석하고 다양한 관점을 적용하여 사회·문화 현상을 설명한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "사회？문화 현상의 탐구",
      "code": "12사문01-02",
      "desc": "사회·문화 현상을 탐구하기 위한 양적 연구 방법과 질적 연구 방법의 특징 및 차이점을 비교한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "사회？문화 현상의 탐구",
      "code": "12사문01-03",
      "desc": "사회·문화 현상의 탐구 과정에서 활용되는 다양한 자료 수집 방법의 유형과 특징을 비교한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "사회？문화 현상의 탐구",
      "code": "12사문01-04",
      "desc": "바람직한 연구 태도와 윤리를 바탕으로 하여 사회·문화 현상에 대한 탐구 절차를 실제 사례에 적용한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "개인과 사회 구조",
      "code": "12사문02-01",
      "desc": "개인과 사회의 관계를 바라보는 여러 관점을 비교하고 인간의 사회화 과정을 설명한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "개인과 사회 구조",
      "code": "12사문02-02",
      "desc": "사회적 지위와 역할의 의미를 설명하고 역할 갈등의 원인 및 해결 방안을 탐색한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "개인과 사회 구조",
      "code": "12사문02-03",
      "desc": "사회 집단 및 사회 조직의 유형과 사례를 조사하고 그 특징을 비교한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "개인과 사회 구조",
      "code": "12사문02-04",
      "desc": "개인과 사회 구조의 관계 속에서 발생하는 일탈 행동을 다양한 관점에서 분석한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "문화와 일상생활",
      "code": "12사문03-01",
      "desc": "문화에 대한 이해를 바탕으로 문화를 바라보는 여러 관점을 설명하고 문화 다양성 존중 및 조화를 추구하는 태도를 가진다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "문화와 일상생활",
      "code": "12사문03-02",
      "desc": "하위문화의 의미를 주류 문화와의 관계 속에서 설명하고 다양한 하위문화의 특징과 기능을 분석한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "문화와 일상생활",
      "code": "12사문03-03",
      "desc": "대중문화의 특징을 대중매체와의 관계 속에서 분석하고 대중문화를 비판적으로 수용하는 태도를 가진다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "문화와 일상생활",
      "code": "12사문03-04",
      "desc": "문화 변동의 요인과 양상을 탐구하고 문화 변동 과정에서 발생하는 문제에 대한 대처 방안을 모색한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "사회 계층과 불평등",
      "code": "12사문04-01",
      "desc": "기능론과 갈등론을 활용하여 사회 불평등 현상을 설명하고 각 이론의 특징을 비교한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "사회 계층과 불평등",
      "code": "12사문04-02",
      "desc": "사회 이동과 사회 계층 구조의 의미를 설명하고 그 유형과 특징을 분석한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "사회 계층과 불평등",
      "code": "12사문04-03",
      "desc": "다양한 사회 불평등 양상을 조사하고 그와 관련한 차별을 개선하기 위한 방안을 모색한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "사회 계층과 불평등",
      "code": "12사문04-04",
      "desc": "사회 복지의 의미를 설명하고 복지 제도의 유형과 역할 및 한계를 분석한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "현대의 사회 변동",
      "code": "12사문05-01",
      "desc": "사회 변동을 설명하는 다양한 이론을 비교하고 사회 운동이 사회 변동에 미치는 영향을 분석한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "현대의 사회 변동",
      "code": "12사문05-02",
      "desc": "세계화 및 정보화로 인한 변화 양상을 설명하고 관련 문제에 대처하는 방안을 모색한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "현대의 사회 변동",
      "code": "12사문05-03",
      "desc": "저출산·고령화와 다문화적 변화로 인해 대두되는 과제를 제시하고 이에 대한 대응 방안을 모색한다."
    },
    {
      "dept": "사회",
      "subject": "사회문화",
      "domain": "현대의 사회 변동",
      "code": "12사문05-04",
      "desc": "전 지구적 수준의 문제와 그 해결 방안을 탐색하고 세계시민으로서 지속가능한 사회를 위해 노력하는 태도를 가진다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "인간과 윤리사상",
      "code": "12윤사01-01",
      "desc": "인간에 대한 다양한 관점을 비교하고, 우리의 삶에서 윤리사상과 사회사상이 필요한 이유를 탐구할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "인간과 윤리사상",
      "code": "12윤사01-02",
      "desc": "우리의 도덕적 삶에서 한국 및 동·서양의 윤리사상과 사회사상이 하는 역할에 대한 실제적인 사례들을 탐구하고, 윤리사상과 사회사상의 관계를 토론할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "동양과 한국윤리사상",
      "code": "12윤사02-01",
      "desc": "동양과 한국의 연원적 윤리사상들을 탐구하고, 이를 인간의 행복 및 사회적 질서와 관련시켜 토론할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "동양과 한국윤리사상",
      "code": "12윤사02-02",
      "desc": "선진유교의 전개 과정을 탐구하여 도덕의 성립 근거에 대한 상대되는 입장의 특징과 한계를 토론할 수 있고, 성리학과 양명학을 비교하여 도덕법칙의 탐구방법에 상대되는 입장의 특징과 한계를 토론할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "동양과 한국윤리사상",
      "code": "12윤사02-03",
      "desc": "이황과 이이의 심성론·수양론을 비교하여 조선성리학의 특징을 설명할 수 있고, 정약용의 심성론·수양론을 탐구하여 조선성리학의 한계와 실학사상의 의의를 설명할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "동양과 한국윤리사상",
      "code": "12윤사02-04",
      "desc": "초기불교에 대한 이해에 근거하여 대승불교의 중관사상과 유식사상의 관계를 설명할 수 있고, 교종과 선종의 깨달음의 방법에 대한 상대되는 입장의 특징과 한계를 토론할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "동양과 한국윤리사상",
      "code": "12윤사02-05",
      "desc": "한국불교의 주요 사상들을 이해하고, 이를 통해 한국불교의 윤리적 특징과 현대적 의의를 설명할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "동양과 한국윤리사상",
      "code": "12윤사02-06",
      "desc": "노자와 장자 사상을 탐구하여 도가적 세계관의 특징을 이해할 수 있고, 도교의 성립 및 한국 고유사상과의 융합을 조사하여 우리 전통 문화에 미친 영향에 대해 토론할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "동양과 한국윤리사상",
      "code": "12윤사02-07",
      "desc": "근대 격변기의 상황에 대처해 나타난 한국 전통윤리사상들의 다양한 대응 노력을 탐구하여 그 의의와 한계를 설명할 수 있고, 동양의 이상적 인간상이 현대사회에서 갖는 의의에 대해 토론할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "서양윤리사상",
      "code": "12윤사03-01",
      "desc": "서양윤리사상의 연원으로서 고대 그리스 사상과 헤브라이즘을 살펴보고, 소피스트의 윤리사상과 소크라테스의 윤리사상을 비교하여 윤리적 상대주의와 윤리적 보편주의의 특징을 설명할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "서양윤리사상",
      "code": "12윤사03-02",
      "desc": "영혼의 정의를 강조하는 플라톤의 윤리사상과 이론 및 실천에서 탁월성을 강조하는 아리스토텔레스의 윤리사상을 비교하여 덕과 행복의 관계를 설명할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "서양윤리사상",
      "code": "12윤사03-03",
      "desc": "행복에 이를 수 있는 방법으로서 쾌락의 추구와 금욕의 삶을 강조하는 윤리적 입장을 비교하여 각각의 특징과 한계를 토론할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "서양윤리사상",
      "code": "12윤사03-04",
      "desc": "그리스도교 윤리사상의 특징을 탐구하고, 고대 그리스 사상이 그리스도교 사상과 결합하여 발전한 자연법 윤리사상에 대해 설명할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "서양윤리사상",
      "code": "12윤사03-05",
      "desc": "도덕적 판단과 행동에 관한 이성과 감정의 역할을 규명하고, 도덕적인 삶을 위한 양자 사이의 바람직한 관계에 대해 토론할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "서양윤리사상",
      "code": "12윤사03-06",
      "desc": "의무론과 칸트의 정언명령, 결과론과 공리주의의 특징을 비교하여 각각의 윤리사상이 갖는 장점과 문제점을 파악할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "서양윤리사상",
      "code": "12윤사03-07",
      "desc": "현대의 실존주의, 실용주의가 주장하는 윤리적 입장들을 이해하고, 우리의 도덕적 삶에 기여하는 바를 설명할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "사회사상",
      "code": "12윤사04-01",
      "desc": "동·서양의 이상사회론들을 비교하여 현대 사회에 주는 시사점을 추론할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "사회사상",
      "code": "12윤사04-02",
      "desc": "국가의 개념과 존재 근거에 대한 주요 사상가들의 주장을 탐구하여 다양한 국가관의 특징을 이해하고, 국가의 역할과 정당성에 대한 비판적이고 체계적인 관점을 제시할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "사회사상",
      "code": "12윤사04-03",
      "desc": "개인과 공동체의 관계, 개인의 권리와 의무, 자유의 의미와 정치 참여에 대한 자유주의와 공화주의의 입장을 비교하여, 개인선과 공동선의 조화를 위한 대안을 모색할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "사회사상",
      "code": "12윤사04-04",
      "desc": "민주주의의 사상적 기원과 근대 자유민주주의를 탐구하고, 참여민주주의와 심의민주주의 등 현대 민주주의 사상들이 제시하는 가치 규범을 이해하여, 바람직한 민주시민의 자세에 대해 토론할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "사회사상",
      "code": "12윤사04-05",
      "desc": "자본주의의 규범적 특징과 기여 및 이에 대한 비판들을 조사하고, 이를 통해 우리 사회가 인간의 존엄과 품격을 보장하는 자본주의 사회로 발전해 갈 수 있는 방향에 대해 토론할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "윤리와 사상",
      "domain": "사회사상",
      "code": "12윤사04-06",
      "desc": "동·서양의 평화사상들을 탐구하여 세계시민주의와 세계시민윤리의 원칙 및 지향을 이해하고, 이를 통해 세계시민이 가져야 할 태도에 대해 성찰할 수 있다."
    },
    {
      "dept": "도덕",
      "subject": "고전과 윤리",
      "domain": "자신과의 관계",
      "code": "12고윤01-01",
      "desc": "도덕적 주체로 살아가기 위해서 ‘뜻 세움’이 중요함을 알고 자신이 세운 뜻을 실현하기 위한 구체적인 계획을 수립하여 이를 실천하기 위한 방법을 제시할 수 있다. (『격몽요결』 - 뜻 세움과 나의 삶)"
    },
    {
      "dept": "도덕",
      "subject": "고전과 윤리",
      "domain": "자신과의 관계",
      "code": "12고윤01-02",
      "desc": "마음공부의 의미와 중요성을 알고, 돈오(頓悟)와 점수(漸修)의 의미를 이해하여 자신의 마음공부법을 제안할 수 있다. (『수심결』 - 진정한 나 찾기와 마음공부)"
    },
    {
      "dept": "도덕",
      "subject": "고전과 윤리",
      "domain": "자신과의 관계",
      "code": "12고윤01-03",
      "desc": "정언명령의 의미를 이해하여 정언명령에 따르는 도덕적 행동에 대해 탐구하고 구체적인 사례를 찾아 제시할 수 있다. (『윤리형이상학 정초』 - 도덕법칙과 인간의 존엄성)"
    },
    {
      "dept": "도덕",
      "subject": "고전과 윤리",
      "domain": "타인과의 관계",
      "code": "12고윤02-01",
      "desc": "궁극적 목적으로서 행복의 의미를 탐구하고, 이를 위해 도덕적 습관과 의지를 가지고 도덕적 덕을 길러야 함을 알고 자신의 삶에서 요구되는 도덕적 습관과 자세를 제시할 수 있다. (『니코마코스 윤리학』 - 삶의 목적으로서의 행복과 덕)"
    },
    {
      "dept": "도덕",
      "subject": "고전과 윤리",
      "domain": "타인과의 관계",
      "code": "12고윤02-02",
      "desc": "인(仁)에 담긴 뜻을 이해하고 현대 사회에서 인을 실천하기 위한 방안을 탐구 하여 제시할 수 있다. (『논어』 - 인간다움으로서의 인(仁)의 마음과 실천)"
    },
    {
      "dept": "도덕",
      "subject": "고전과 윤리",
      "domain": "타인과의 관계",
      "code": "12고윤02-03",
      "desc": "관계적 존재로서 인간의 존재를 탐구하고 삶 속에서 서로 베풂의 관계를 형 성하기 위한 자세를 제시할 수 있다. (『금강경』 - 관계 속에서 존재하는 나와 베푸는 삶)"
    },
    {
      "dept": "도덕",
      "subject": "고전과 윤리",
      "domain": "사회·공동체와의 관계",
      "code": "12고윤03-01",
      "desc": "정의로운 국가와 올바른 개인의 관계를 탐구하고 이를 통해 현대 사회에서 바람직한 국가를 위한 올바른 개인의 중요성을 말할 수 있다. (『국가』 - 조화로운 영혼과 정의로운 국가)"
    },
    {
      "dept": "도덕",
      "subject": "고전과 윤리",
      "domain": "사회·공동체와의 관계",
      "code": "12고윤03-02",
      "desc": "공직자의 자세로서 청렴의 필요성을 탐구하고, 현대 사회에서 올바른 공직자의 ‘국민을 사랑하는 마음’, 즉 애민의 구체적인 실천 방법을 제시할 수 있다. (『목민심서』 - 공직자의 자세로서 청렴과 애민(愛民))"
    },
    {
      "dept": "도덕",
      "subject": "고전과 윤리",
      "domain": "사회·공동체와의 관계",
      "code": "12고윤03-03",
      "desc": "결과적 정의와 절차적 정의에 대해 비판적으로 탐구하고, 롤즈가 주장한 정의의 원칙에 대하여 논리적 근거와 함께 자신의 견해를 제시할 수 있다. (『정의론』 - 정의로운 사회를 위한 정의의 원칙)"
    },
    {
      "dept": "도덕",
      "subject": "고전과 윤리",
      "domain": "자연·초월과의 관계",
      "code": "12고윤04-01",
      "desc": "최대 다수의 최대 행복(쾌락)을 도덕의 기준으로 삼는 공리주의를 칸트의 견해와 비교하여 그것의 장점과 단점을 비판적으로 논의하고, 도덕적 고려의 대상을 인간뿐만 아니라 동물까지 확대해야 하는 이유를 제시할 수 있다. (『공리주의』, 『동물해방』 - 최대 다수의 최대 행복과 도덕적 고려 범위의 확대)"
    },
    {
      "dept": "도덕",
      "subject": "고전과 윤리",
      "domain": "자연·초월과의 관계",
      "code": "12고윤04-02",
      "desc": "현대 사회에서 무위자연(無爲自然)의 도(道)의 필요성을 탐구하고, 편견과 선입견에서 벗어나 사회 문제 해결을 위한 자세와 방법을 제시할 수 있다. (『노자』, 『장자』 - 자연의 이치에서 배우는 삶의 지혜, 편견과 선입견에서 벗어난 진정한 자유)"
    },
    {
      "dept": "도덕",
      "subject": "고전과 윤리",
      "domain": "자연·초월과의 관계",
      "code": "12고윤04-03",
      "desc": "종교적 신념이나 교리에 내재된 윤리적 의미를 탐구하고, 다양한 종교들이 지향하는 가치에 대한 비판적 논의와 소통의 과정을 통하여 관용의 필요성을 설명할 수 있다. (『신약』·『꾸란』 - 인간의 삶에서 종교의 의미와 종교에 대한 자세)"
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "역학적 상호작용",
      "code": "12물리Ⅱ01-01",
      "desc": "평면 상에서 여러 가지 힘이 합성될 때 힘의 벡터를 이용하여 알짜힘을 구할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "역학적 상호 작용",
      "code": "12물리Ⅱ01-02",
      "desc": "무게중심에 대한 물체의 평형 조건을 정량적으로 계산하여 간단한 구조물의 안정성을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "역학적 상호 작용",
      "code": "12물리Ⅱ01-03",
      "desc": "평면상의 등가속도 운동에서 물체의 속도와 위치를 정량적으로 예측할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "역학적 상호 작용",
      "code": "12물리Ⅱ01-04",
      "desc": "뉴턴 운동 법칙을 이용하여 물체의 포물선 운동을 정량적으로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "역학적 상호 작용",
      "code": "12물리Ⅱ01-05",
      "desc": "구심력을 이용하여 등속 원운동을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "역학적 상호 작용",
      "code": "12물리Ⅱ01-06",
      "desc": "행성의 운동에 대한 케플러 법칙이 뉴턴의 중력 법칙을 만족함을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "역학적 상호 작용",
      "code": "12물리Ⅱ01-07",
      "desc": "가속 좌표계 개념을 이용하여 등가 원리를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "역학적 상호작용",
      "code": "12물리Ⅱ01-08",
      "desc": "중력 렌즈 효과와 블랙홀을 항성의 질량과 관련지어 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "역학적 상호 작용",
      "code": "12물리Ⅱ01-09",
      "desc": "등가속도 운동에서 일-운동 에너지 관계를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "역학적 상호 작용",
      "code": "12물리Ⅱ01-10",
      "desc": "포물선 운동과 단진자 운동에서 역학적 에너지가 보존됨을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "역학적 상호 작용",
      "code": "12물리Ⅱ01-11",
      "desc": "열의 일당량 개념을 사용하여 열과 일 사이의 전환을 정량적으로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "전자기장",
      "code": "12물리Ⅱ02-01",
      "desc": "정지한 전하 주위의 전기장을 정량적으로 구하고, 전기력선으로 표현할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "전자기장",
      "code": "12물리Ⅱ02-02",
      "desc": "정전기 유도와 유전 분극을 이해하고, 이 현상이 적용되는 예를 찾아 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "전자기장",
      "code": "12물리Ⅱ02-03",
      "desc": "직류 회로에서 저항의 연결에 따른 전류와 전위차 및 저항에서 소모되는 전기 에너지를 구할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "전자기장",
      "code": "12물리Ⅱ02-04",
      "desc": "트랜지스터의 증폭 원리를 이해하고, 저항을 이용하여 필요한 바이어스 전압을 정할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "전자기장",
      "code": "12물리Ⅱ02-05",
      "desc": "평행판 축전기를 이용하여 에너지를 저장하는 원리를 전위차와 전하량으로 설명하고, 그 사용 예를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "전자기장",
      "code": "12물리Ⅱ02-06",
      "desc": "전류가 흐르는 도선 주위에 발생하는 자기장을 자기력선으로 표현할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "전자기장",
      "code": "12물리Ⅱ02-07",
      "desc": "자기선속이 시간에 따라 변화할 때 유도 기전력이 회로에 유도되는 현상에서 기전력의 크기를 구할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "전자기장",
      "code": "12물리Ⅱ02-08",
      "desc": "상호유도를 이해하고, 활용되는 예를 찾아 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "파동과 물질의 성질",
      "code": "12물리Ⅱ03-01",
      "desc": "전자기파의 간섭과 회절을 이해하고 이와 관련된 다양한 예를 조사하여 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "파동과 물질의 성질",
      "code": "12물리Ⅱ03-02",
      "desc": "파원의 속도에 따라 파장이 달라짐을 이해하고, 활용되는 예를 찾아 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "파동과 물질의 성질",
      "code": "12물리Ⅱ03-03",
      "desc": "교류 회로에서 전자기파의 발생 및 안테나를 통한 수신 과정을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "파동과 물질의 성질",
      "code": "12물리Ⅱ03-04",
      "desc": "볼록 렌즈에서 상이 맺히는 과정을 도식을 이용하여 설명하고, 초점과 상의 관계를 정량적으로 구할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "파동과 물질의 성질",
      "code": "12물리Ⅱ03-05",
      "desc": "이중 슬릿의 간섭 실험을 이용하여 빛의 파장을 구할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "파동과 물질의 성질",
      "code": "12물리Ⅱ03-06",
      "desc": "광전 효과 실험을 근거로 빛의 입자성을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "파동과 물질의 성질",
      "code": "12물리Ⅱ03-07",
      "desc": "입자의 파동성을 물질파 이론과 전자 회절 실험을 근거로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "물리학 II",
      "domain": "파동과 물질의 성질",
      "code": "12물리Ⅱ03-08",
      "desc": "수소 원자 내에서 전자의 궤도를 고전 역학으로 설명할 수 없음을 불확정성 원리를 사용하여 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "물질의 세 가지 상태와 용액",
      "code": "12화학Ⅱ01-01",
      "desc": "기체의 온도, 압력, 부피, 몰수 사이의 관계를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "물질의 세 가지 상태와 용액",
      "code": "12화학Ⅱ01-02",
      "desc": "이상 기체 방정식을 활용하여 기체의 분자량을 구할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "물질의 세 가지 상태와 용액",
      "code": "12화학Ⅱ01-03",
      "desc": "혼합 기체에서 몰 분율을 이용하여 분압의 의미를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "물질의 세 가지 상태와 용액",
      "code": "12화학Ⅱ01-04",
      "desc": "분자 간 상호 작용을 이해하고, 분자 간 상호 작용의 크기와 끓는점의 관계를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "물질의 세 가지 상태와 용액",
      "code": "12화학Ⅱ01-05",
      "desc": "물의 밀도, 열용량, 표면 장력 등의 성질을 수소 결합으로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "물질의 세 가지 상태와 용액",
      "code": "12화학Ⅱ01-06",
      "desc": "액체의 증기압과 끓는점의 관계를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "물질의 세 가지 상태와 용액",
      "code": "12화학Ⅱ01-07",
      "desc": "고체를 화학 결합의 종류에 따라 분류하고, 간단한 결정 구조를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "물질의 세 가지 상태와 용액",
      "code": "12화학Ⅱ01-08",
      "desc": "퍼센트 농도, ppm, 농도, 몰랄 농도의 의미를 이해하고, 여러 가지 농도의 용액을 만들 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "물질의 세 가지 상태와 용액",
      "code": "12화학Ⅱ01-09",
      "desc": "묽은 용액의 증기압 내림, 끓는점 오름, 어는점 내림을 이해하고, 일상생활의 예를 들 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "물질의 세 가지 상태와 용액",
      "code": "12화학Ⅱ01-10",
      "desc": "삼투 현상을 관찰하고, 삼투압을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "반응 엔탈피와 화학 평형",
      "code": "12화학Ⅱ02-01",
      "desc": "열화학 반응식을 엔탈피를 이용하여 표현할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "반응 엔탈피와 화학 평형",
      "code": "12화학Ⅱ02-02",
      "desc": "엔탈피와 결합 에너지의 관계를 이해하고, 헤스 법칙을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "반응 엔탈피와 화학 평형",
      "code": "12화학Ⅱ02-03",
      "desc": "가역 반응에서 동적 평형을 이해하고, 평형 상수를 이용해서 반응의 진행 방향을 예측할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "반응 엔탈피와 화학 평형",
      "code": "12화학Ⅱ02-04",
      "desc": "농도, 압력, 온도 변화에 따른 화학 평형의 이동을 관찰하고 르샤틀리에 원리로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "반응 엔탈피와 화학 평형",
      "code": "12화학Ⅱ02-05",
      "desc": "상평형 그림을 이용하여 물질의 상태 변화를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "반응 엔탈피와 화학 평형",
      "code": "12화학Ⅱ02-06",
      "desc": "이온화 상수를 이용하여 산과 염기의 세기를 이해하고, 염의 가수 분해를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "반응 엔탈피와 화학 평형",
      "code": "12화학Ⅱ02-07",
      "desc": "완충 용액이 생체 내 화학 반응에서 중요함을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "반응 속도와 촉매",
      "code": "12화학Ⅱ03-01",
      "desc": "화학 반응의 속도가 다양하다는 것을 알고, 화학 반응 속도를 계산할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "반응 속도와 촉매",
      "code": "12화학Ⅱ03-02",
      "desc": "자료 해석을 통하여 반응 속도식을 구할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "반응 속도와 촉매",
      "code": "12화학Ⅱ03-03",
      "desc": "1차 반응의 반감기를 구할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "반응 속도와 촉매",
      "code": "12화학Ⅱ03-04",
      "desc": "화학 반응에서 활성화 에너지의 의미를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "반응 속도와 촉매",
      "code": "12화학Ⅱ03-05",
      "desc": "농도에 따라 반응 속도가 달라짐을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "반응 속도와 촉매",
      "code": "12화학Ⅱ03-06",
      "desc": "온도에 따라 반응 속도가 달라짐을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "반응 속도와 촉매",
      "code": "12화학Ⅱ03-07",
      "desc": "촉매가 반응 속도를 변화시킬 수 있음을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "반응 속도와 촉매",
      "code": "12화학Ⅱ03-08",
      "desc": "촉매가 생명 현상이나 산업 현장에서 중요한 역할을 하는 예를 찾을 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "전기 화학과 이용",
      "code": "12화학Ⅱ04-01",
      "desc": "화학 전지의 작동 원리를 산화·환원 반응으로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "전기 화학과 이용",
      "code": "12화학Ⅱ04-02",
      "desc": "전기 분해의 원리를 산화·환원 반응으로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "화학Ⅱ",
      "domain": "전기 화학과 이용",
      "code": "12화학Ⅱ04-03",
      "desc": "수소 연료 전지가 활용되는 예를 조사하여 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "생명과학의 역사",
      "code": "12생과Ⅱ01-01",
      "desc": "생명과학의 역사와 발달 과정을 알고, 주요 발견을 시기에 따라 나열하고 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "생명과학의 역사",
      "code": "12생과Ⅱ01-02",
      "desc": "생명과학 발달에 기여한 주요 발견들에 사용된 연구 방법들을 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "세포의 특성",
      "code": "12생과Ⅱ02-01",
      "desc": "동물과 식물의 유기적 구성을 비교할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "세포의 특성",
      "code": "12생과Ⅱ02-02",
      "desc": "탄수화물, 지질, 단백질, 핵산의 기본 구조와 기능을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "세포의 특성",
      "code": "12생과Ⅱ02-03",
      "desc": "원핵세포와 진핵세포의 차이점을 비교할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "세포의 특성",
      "code": "12생과Ⅱ02-04",
      "desc": "세포 소기관들이 기능적으로 유기적인 관계를 이루고 있음을 이해하고, 이들 간의 관계성을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "세포의 특성",
      "code": "12생과Ⅱ02-05",
      "desc": "세포막을 통한 물질 출입 현상을 이해하고, 확산, 삼투, 능동 수송을 실험이나 모형을 통해 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "세포의 특성",
      "code": "12생과Ⅱ02-06",
      "desc": "효소의 작용을 활성화 에너지와 기질의 특이성을 중심으로 이해하고, 온도와 pH가 효소 작용에 영향을 미칠 수 있음을 실험을 통해 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "세포 호흡과 광합성",
      "code": "12생과Ⅱ03-01",
      "desc": "미토콘드리아와 엽록체의 구조와 기능을 이해하고, 두 세포 소기관을 비교하여 공통점과 차이점을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "세포 호흡과 광합성",
      "code": "12생과Ⅱ03-02",
      "desc": "세포 호흡 과정과 광합성의 탄소 고정 반응을 단계별로 구분하여 이해하고, 산화적 인산화 과정을 화학 삼투로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "세포 호흡과 광합성",
      "code": "12생과Ⅱ03-03",
      "desc": "산소 호흡과 발효의 차이를 이해하고 실생활 속에서 발효를 이용한 사례를 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "세포 호흡과 광합성",
      "code": "12생과Ⅱ03-04",
      "desc": "광계를 통한 명반응 과정을 모형을 이용해 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "세포 호흡과 광합성",
      "code": "12생과Ⅱ03-05",
      "desc": "세포 호흡과 광합성의 전자 전달계를 비교하여 공통점과 차이점을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "유전자의 발현과 조절",
      "code": "12생과Ⅱ04-01",
      "desc": "원핵세포와 진핵세포의 유전체 구성과 유전자 구조를 이해하고 차이를 비교할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "유전자의 발현과 조절",
      "code": "12생과Ⅱ04-02",
      "desc": "반보존적 DNA 복제 과정을 이해하고, 모형을 이용하여 DNA 복제 과정을 모의실험 할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "유전자의 발현과 조절",
      "code": "12생과Ⅱ04-03",
      "desc": "전사와 번역 과정을 거쳐 유전자가 발현됨을 이해하고, 모형을 이용하여 유전자 발현 과정을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "유전자의 발현과 조절",
      "code": "12생과Ⅱ04-04",
      "desc": "유전 암호를 이해하고, 유전 암호 표를 사용하여 유전 정보를 해독할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "유전자의 발현과 조절",
      "code": "12생과Ⅱ04-05",
      "desc": "원핵생물과 진핵생물의 전사 조절 과정을 비교하여 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "유전자의 발현과 조절",
      "code": "12생과Ⅱ04-06",
      "desc": "진핵생물의 발생과 세포 분화에서 유전자 발현 조절 과정을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "생물의 진화와 다양성",
      "code": "12생과Ⅱ05-01",
      "desc": "원시 세포의 탄생 과정을 알고, 막 형성의 중요성을 논증할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "생물의 진화와 다양성",
      "code": "12생과Ⅱ05-02",
      "desc": "원핵생물에서 진핵생물로, 단세포에서 다세포로 생물이 진화하는 과정을 모형으로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "생물의 진화와 다양성",
      "code": "12생과Ⅱ05-03",
      "desc": "3역 6계의 분류 체계를 이해하고 각 분류군의 차이를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "생물의 진화와 다양성",
      "code": "12생과Ⅱ05-04",
      "desc": "동물과 식물 분류군의 특징을 문 수준에서 이해하고, 이들 간의 유연관계를 계통수를 이용하여 표현할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "생물의 진화와 다양성",
      "code": "12생과Ⅱ05-05",
      "desc": "진화의 증거 사례를 조사하여 변이와 자연선택에 의한 진화의 원리를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "생물의 진화와 다양성",
      "code": "12생과Ⅱ05-06",
      "desc": "지리적 격리에 의한 종 분화 과정을 이해하고, 종 분화의 사례를 조사하고 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "생명공학 기술과 인간생활",
      "code": "12생과Ⅱ06-01",
      "desc": "DNA 재조합 기술의 원리를 이해하고, 활용 사례를 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "생명공학 기술과 인간생활",
      "code": "12생과Ⅱ06-02",
      "desc": "핵치환, 조직 배양, 세포 융합의 원리를 이해하고, 활용 사례를 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "생명공학 기술과 인간생활",
      "code": "12생과Ⅱ06-03",
      "desc": "단일클론항체, 유전자 치료, 줄기세포를 난치병 치료에 적용한 사례를 이해하고, 이러한 치료법의 전망에 대해 토의할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "생명공학 기술과 인간생활",
      "code": "12생과Ⅱ06-04",
      "desc": "LMO가 인간의 생활과 생태계에 미치는 긍정적인 영향과 부정적인 영향을 조사하고 토론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생명과학Ⅱ",
      "domain": "생명공학 기술과 인간생활",
      "code": "12생과Ⅱ06-05",
      "desc": "생명공학의 발달 과정에서 나타나는 생태학적, 윤리적, 법적, 사회적 문제점을 이해하고, 미래 사회에 미칠 영향을 예측하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "지구의 형성과 역장",
      "code": "12지과Ⅱ01-01",
      "desc": "원시 태양계 성운에서 지구가 형성되는 물리적 과정을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "지구의 형성과 역장",
      "code": "12지과Ⅱ01-02",
      "desc": "지구 내부 에너지의 생성 과정을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "지구의 형성과 역장",
      "code": "12지과Ⅱ01-03",
      "desc": "지진파를 이용하여 지구의 내부 구조를 알아내는 과정과 지각의 두께 차이를 지각평형설로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "지구의 형성과 역장",
      "code": "12지과Ⅱ01-04",
      "desc": "표준 중력의 의미를 이해하고 중력 이상의 다양한 요인들을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "지구의 형성과 역장",
      "code": "12지과Ⅱ01-05",
      "desc": "지구 자기장의 발생 과정과 특성 및 자기장의 변화를 이해한다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "지구 구성 물질과 자원",
      "code": "12지과Ⅱ02-01",
      "desc": "규산염 광물의 구조를 통해 광물의 물리적 특성을 설명하고 광물을 구분할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "지구 구성 물질과 자원",
      "code": "12지과Ⅱ02-02",
      "desc": "편광 현미경을 이용하여 주요 광물을 식별하고 광물의 조직과 생성의 선후 관계 등을 해석하여 암석의 형성 환경을 유추할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "지구 구성 물질과 자원",
      "code": "12지과Ⅱ02-03",
      "desc": "화성, 변성, 퇴적 작용을 통해 광상이 형성되는 과정을 예를 들어 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "지구 구성 물질과 자원",
      "code": "12지과Ⅱ02-04",
      "desc": "광물과 암석이 우리 생활의 여러 분야에 다양하게 이용되는 예를 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "지구 구성 물질과 자원",
      "code": "12지과Ⅱ02-05",
      "desc": "해양에서 얻을 수 있는 에너지와 물질 자원의 종류와 분포를 알고, 이를 활용하는 사례와 자원 개발의 중요성을 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "한반도의 지질",
      "code": "12지과Ⅱ03-01",
      "desc": "지질도에 사용되는 기본 기호를 통해 암석의 종류와 지질 구조를 파악할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "한반도의 지질",
      "code": "12지과Ⅱ03-02",
      "desc": "한반도의 지질 자료를 통해 한반도의 지사를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "한반도의 지질",
      "code": "12지과Ⅱ03-03",
      "desc": "한반도 지질의 구조적인 특징 자료 분석을 통해 한반도 주변의 판구조 환경에 대해 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "한반도의 지질",
      "code": "12지과Ⅱ03-04",
      "desc": "한반도의 기반을 이루는 선캄브리아 변성암 복합체를 통해 광역 변성 작용을, 중생대 화성 활동과 주변 퇴적암의 관계를 통해 접촉 변성 작용을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "해수의 운동과 순환",
      "code": "12지과Ⅱ04-01",
      "desc": "정역학 평형을 이용하여 수압의 연직 분포 및 해수를 움직이는 힘을 정량적으로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "해수의 운동과 순환",
      "code": "12지과Ⅱ04-02",
      "desc": "에크만 수송과 연계하여 지형류의 발생 원리를 이해하고, 서안 경계류와 동안 경계류의 특징을 비교하여 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "해수의 운동과 순환",
      "code": "12지과Ⅱ04-03",
      "desc": "해파의 발생 과정을 이해하고, 천해파와 심해파의 차이점을 비교하여 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "해수의 운동과 순환",
      "code": "12지과Ⅱ04-04",
      "desc": "해일이 발생하는 여러 가지 원인을 이해하고, 피해 사례와 대처 방안을 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "해수의 운동과 순환",
      "code": "12지과Ⅱ04-05",
      "desc": "조석의 발생 과정을 이해하고, 자료 해석을 통해 각 지역에서의 조석 양상을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "대기의 운동과 순환",
      "code": "12지과Ⅱ05-01",
      "desc": "단열 변화의 과정을 이해하고, 건조 단열 변화와 습윤 단열 변화의 차이점을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "대기의 운동과 순환",
      "code": "12지과Ⅱ05-02",
      "desc": "대기의 상태와 안정도의 관계를 이해하고, 안개 및 구름의 발생 원리와 유형을 추론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "대기의 운동과 순환",
      "code": "12지과Ⅱ05-03",
      "desc": "정역학 평형을 이용하여 대기압의 연직 분포 및 대기를 움직이는 힘을 정량적으로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "대기의 운동과 순환",
      "code": "12지과Ⅱ05-04",
      "desc": "지균풍, 경도풍, 지상풍의 발생 원리를 비교하여 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "대기의 운동과 순환",
      "code": "12지과Ⅱ05-05",
      "desc": "편서풍 파동의 발생 과정을 이해하고, 이와 관련지어 지상 고·저기압의 발생 과정을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "대기의 운동과 순환",
      "code": "12지과Ⅱ05-06",
      "desc": "대기의 운동을 시·공간적 규모에 따라 구분하고, 지구적 순환의 관점에서 대기 대순환을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "행성의 운동",
      "code": "12지과Ⅱ06-01",
      "desc": "천체의 위치 변화를 지평 좌표와 적도 좌표를 이용하여 나타낼 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "행성의 운동",
      "code": "12지과Ⅱ06-02",
      "desc": "내행성과 외행성의 겉보기 운동을 비교하고 지구중심설과 태양중심설로 행성의 겉보기 운동을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "행성의 운동",
      "code": "12지과Ⅱ06-03",
      "desc": "지구중심설과 태양중심설 중 금성의 위상과 크기 변화 관측 사실에 부합하는 태양계 모형을 찾을 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "행성의 운동",
      "code": "12지과Ⅱ06-04",
      "desc": "회합 주기를 이용하여 공전 주기를 구하는 원리를 이해하고, 겉보기 운동 자료로부터 행성의 궤도 반경을 구할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "행성의 운동",
      "code": "12지과Ⅱ06-05",
      "desc": "케플러의 세 가지 법칙을 이용하여 행성의 운동을 이해하고 쌍성계 등의 다른 천체에 적용할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "우리은하와 우주의 구조",
      "code": "12지과Ⅱ07-01",
      "desc": "성단의 색등급도(C-M도)를 이용한 주계열 맞추기 및 세페이드 변광성의 주기-광도 관계를 이용하여 천체의 거리를 구할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "우리은하와 우주의 구조",
      "code": "12지과Ⅱ07-02",
      "desc": "우리은하의 구성원인 산개 성단과 구상 성단의 특징을 알고 이들의 공간 분포를 통해 우리은하의 구조를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "우리은하와 우주의 구조",
      "code": "12지과Ⅱ07-03",
      "desc": "성간 티끌에 의한 별빛의 소광 및 적외선 관측 등을 통해 성간 티끌과 성간 기체가 존재함을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "우리은하와 우주의 구조",
      "code": "12지과Ⅱ07-04",
      "desc": "21cm 수소선 관측 결과로부터 은하의 나선팔 구조를 알아낸 과정을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "우리은하와 우주의 구조",
      "code": "12지과Ⅱ07-05",
      "desc": "우리은하의 속도 곡선을 이용하여 우리은하의 질량과 빛을 내지 않는 물질이 존재함을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "우리은하와 우주의 구조",
      "code": "12지과Ⅱ07-06",
      "desc": "은하들이 은하군, 은하단, 초은하단으로 집단을 이루고 있으며 우리은하가 국부은하군의 중심 은하임을 안다."
    },
    {
      "dept": "과학",
      "subject": "지구과학Ⅱ",
      "domain": "우리은하와 우주의 구조",
      "code": "12지과Ⅱ07-07",
      "desc": "은하 장성과 보이드 등 대규모 구조를 통해 우주의 전반적인 모습을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "건강한 생활",
      "code": "12생활01-01",
      "desc": "질병, 의약품, 위생, 예방 접종, 진단, 치료 등과 관련된 과학 원리를 조사하고 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "건강한 생활",
      "code": "12생활01-02",
      "desc": "인류 문명사에 있어서 과학이 인류 건강 및 수명 연장에 영향을 준 대표적인 몇몇 사례를 조사하고 토론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "건강한 생활",
      "code": "12생활01-03",
      "desc": "과학적이고 합리적으로 건강한 신체를 유지하여 관리하기 위한 가족의 식품 및 신체 활동을 조사하고 분석할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "건강한 생활",
      "code": "12생활01-04",
      "desc": "약물 오남용의 폐해에 대해 경각심을 높이고, 약물의 올바른 이해와 사용을 권장하는 캠페인을 기획하고 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "건강한 생활",
      "code": "12생활01-05",
      "desc": "식품 재료, 첨가제, 보존 방법, 영양소 등에 포함된 과학적 원리를 조사하고 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "건강한 생활",
      "code": "12생활01-06",
      "desc": "과학이 인류 식생활에 미친 긍정적 영향과 부정적 영향에 대해 조사하고 토론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "건강한 생활",
      "code": "12생활01-07",
      "desc": "식품소비자로서 주변 식료품의 구성 성분을 조사하여, 권장 식료품 목록을 작성할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "건강한 생활",
      "code": "12생활01-08",
      "desc": "방사능 물질, 수은, 중금속 등 환경 오염원에 노출된 먹거리에 대한 위험성을 조사하고 토론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "아름다운 생활",
      "code": "12생활02-01",
      "desc": "샴푸와 세안제, 화장품, 염색, 파마 등에 포함된 과학적 원리를 조사하고 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "아름다운 생활",
      "code": "12생활02-02",
      "desc": "아름다움은 건강한 신체와 정신에 기반한다는 것을 이해하고, 미용의 올바른 가치를 담은 광고, 동영상 등의 홍보물을 제작할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "아름다운 생활",
      "code": "12생활02-03",
      "desc": "자신에게 맞는 미용 제품을 선택하기 위해서 고려해야 할 사항들을 조사하고 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "아름다운 생활",
      "code": "12생활02-04",
      "desc": "화장품 개발의 윤리와 동물 보호 등과 관련된 내용을 조사하고 토론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "아름다운 생활",
      "code": "12생활02-05",
      "desc": "의복의 소재, 기능 등에 관련된 과학적 원리 및 개념을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "아름다운 생활",
      "code": "12생활02-06",
      "desc": "과학이 의복의 발달에 미친 영향을 조사하고 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "아름다운 생활",
      "code": "12생활02-07",
      "desc": "일상생활 속에서 특정 상황을 설정하고 목적과 기능에 적합한 의복을 설계할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "아름다운 생활",
      "code": "12생활02-08",
      "desc": "등산복, 운동복, 방화복, 방수복, 방탄복 등 안전과 관련된 의복의 소재 및 기능 등을 조사하고 비교함으로써 안전 의복들의 장점과 개선점에 대해 토론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "편리한 생활",
      "code": "12생활03-01",
      "desc": "초고층 건물, 경기장, 음악 공연장, 지붕, 다리 구조 등의 다양한 건축물을 조사하고 각 건축물에 관련된 과학적 원리를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "편리한 생활",
      "code": "12생활03-02",
      "desc": "인간의 외부 환경, 주거의 개념, 건물의 기능, 편안함, 쓰레기, 안전 등 건축물을 설계할 때 고려해야 하는 사항들을 조사하고 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "편리한 생활",
      "code": "12생활03-03",
      "desc": "화재, 지진, 붕괴 등의 안전사고에 대한 대처법을 조사하고 정리할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "편리한 생활",
      "code": "12생활03-04",
      "desc": "환경과 생태적 측면에서의 건축물 설립의 장점과 제한점을 실제 사례들을 조사하고 비교함으로써 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "편리한 생활",
      "code": "12생활03-05",
      "desc": "자동차, 기차, 선박, 비행기, 신호등, GPS 등에 관련된 과학적 원리를 조사하고 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "편리한 생활",
      "code": "12생활03-06",
      "desc": "과학이 교통수단의 발달에 미친 영향을 조사하고 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "편리한 생활",
      "code": "12생활03-07",
      "desc": "건강한 신체 유지, 환경 보존과 에너지 절약을 위한 건강한 걷기 활동을 위해 인포 그래픽을 작성하고 토의할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "편리한 생활",
      "code": "12생활03-08",
      "desc": "교통사고의 유형 및 비율을 조사하고, 교통사고를 줄일 수 있는 방안 및 전략을 만들어 토론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "문화생활",
      "code": "12생활04-01",
      "desc": "스포츠, 음악, 미술, 사진, 문학 등에 관련된 과학적 원리 및 개념을 조사하고 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "문화생활",
      "code": "12생활04-02",
      "desc": "인류 문명사의 관련된 몇몇 사례를 통하여 과학의 발달이 스포츠, 음악, 미술, 사진, 문학 등에 끼친 영향을 조사하고 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "문화생활",
      "code": "12생활04-03",
      "desc": "과학과 관련된 다큐멘터리, 전시회 등 문화생활을 체험하고, 그 안에 포함된 과학 논쟁거리를 찾아 토론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "문화생활",
      "code": "12생활04-04",
      "desc": "안전,음악 또는 미술 작품의 표절, 문화재 보존 및 복원 기술, 보안 유지, 자료·정보 유출 및 도난 방지 등을 위하여 고려해야 할 내용들과 관련된 사례들을 조사하고 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "문화생활",
      "code": "12생활04-05",
      "desc": "공연, 영화, 미디어 아트 등 종합 예술과 관련된 과학적 원리 및 개념을 조사하고 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "문화생활",
      "code": "12생활04-06",
      "desc": "과학적원리 및 활용이 공연, 영화 등의 종합 예술의 발달에 영향을 끼친 몇몇 대표적인 사례를 조사하고 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "문화생활",
      "code": "12생활04-07",
      "desc": "카메라 발명으로 인한 인상파 화가 등장, 미디어 아티스트, SF 소설 등 과학과 관련된 작품 등의 조사를 통하여 과학이 사고의 지평, 직업 영역의 지평을 창출 또는 확대한 사례를 조사하고, 그 과정에서 과학과 창의성이 어떤 역할을 하였는지 토의할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "생활과 과학",
      "domain": "문화생활",
      "code": "12생활04-08",
      "desc": "문화생활이 인간의 정신 건강과 육체 건강에 미치는 영향을 조사 분석하고 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "우주의 기원과 진화",
      "code": "12융과01-01",
      "desc": "허블 법칙을 통하여 우주의 팽창을 설명하고 우주의 나이를 구할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "우주의 기원과 진화",
      "code": "12융과01-02",
      "desc": "빅뱅 우주에서 기본 입자와 양성자 및 중성자, 헬륨 원자핵이 순차적으로 만들어짐을 모형으로 표현할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "우주의 기원과 진화",
      "code": "12융과01-03",
      "desc": "수소, 헬륨 원자가 나타내는 선스펙트럼으로부터 우주에 수소와 헬륨이 풍부하다는 것을 알 수 있으며 원자가 형성되면서 나온 빛이 우주배경복사로 검출된다는 것을 알고 이를 빅뱅의 증거로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "우주의 기원과 진화",
      "code": "12융과01-04",
      "desc": "별이 탄생하고 적색거성, 초신성으로 진화하면서 탄소와 산소 등 무거운 원소가 만들어지는 과정을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "우주의 기원과 진화",
      "code": "12융과01-05",
      "desc": "은하의 크기, 구조, 별의 개수 등이 다양하고, 은하와 은하 사이의 공간 등이 우주의 전체 구조를 이루고 있음을 우주 거대 구조를 관측한 결과를 활용하여 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "우주의 기원과 진화",
      "code": "12융과01-06",
      "desc": "성간 공간에서 수소, 탄소, 질소, 산소 원자들로부터 수소와 질소 분자, 그리고 일산화탄소, 물, 암모니아 등과 같은 간단한 화합물이 만들어지는 과정을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "태양계와 지구",
      "code": "12융과02-01",
      "desc": "태양계의 형성 과정은 행성의 공전궤도와 방향, 지구형 행성과 목성형 행성 등 태양계의 여러 특징과 관련된다는 것을 알고, 태양에서 핵융합 반응이 일어나는 과정을 태양의 특성과 관련지어 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "태양계와 지구",
      "code": "12융과02-02",
      "desc": "케플러의 법칙은 행성의 운동에 관한 법칙으로 뉴턴의 운동법칙을 이용하여 케플러 법칙을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "태양계와 지구",
      "code": "12융과02-03",
      "desc": "지구와 달의 공전과 자전에 의해 식현상이 나타남을 모형으로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "태양계와 지구",
      "code": "12융과02-04",
      "desc": "행성의 탈출 속도를 구하고, 목성, 금성, 화성 등의 대기 성분 차이를 탈출 속도 및 기체 분자의 특성과 관련지어 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "태양계와 지구",
      "code": "12융과02-05",
      "desc": "지구의 진화 과정을 통하여 지권, 수권, 기권 등과 같은 지구계 각 권이 형성되었으며, 태양으로부터의 거리가 지구를 특별한 행성으로 만들었다는 것을 추론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "태양계와 지구",
      "code": "12융과02-06",
      "desc": "지구의 원소 분포와 주변 화합물의 특성을 주기율과 관련지어 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "태양계와 지구",
      "code": "12융과02-07",
      "desc": "지구의 자기장과 이온층의 형성 원인을 지구의 내부 물질과 지구의 자전과 관련지어 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "생명의 진화",
      "code": "12융과03-01",
      "desc": "원시 바다에서 화학적 진화를 통해 간단한 화합물로부터 단백질과 같은 복잡한 탄소 화합물이 만들어지고 생명이 탄생하였음을 밀러의 실험 결과와 관련지어 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "생명의 진화",
      "code": "12융과03-02",
      "desc": "광합성 박테리아가 출현하여 태양에너지를 이용해 물을 분해하고 이 때 나온 수소를 사용하여 이산화 탄소를 탄수화물로 환원시키면서 산소가 발생하고, 이 반응이 지구와 생명의 역사에 변혁을 가져온 과정을 과학적 근거를 들어 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "생명의 진화",
      "code": "12융과03-03",
      "desc": "지질 시대에 따른 생물 화석의 변화를 통해 생물 종의 진화 과정을 추론할 수 있으며, 생물 화석이 포함된 지층과 암석의 특징을 바탕으로 과거 생물의 생활환경을 유추할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "생명의 진화",
      "code": "12융과03-04",
      "desc": "원핵생물, 진핵생물, 단세포생물, 다세포생물의 차이를 근거로 하여 다양한 생물 종의 진화를 설명하는 진화론의 핵심을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "생명의 진화",
      "code": "12융과03-05",
      "desc": "지구의 모든 생명체가 염색체, 유전자, DNA의 개념을 바탕으로 동일한 유전 암호를 사용하는 것에 근거하여 생명의 연속성을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "생명의 진화",
      "code": "12융과03-06",
      "desc": "대립 유전자 쌍이 생식 세포 분열과 수정을 거쳐 복제, 분배, 조합을 이룸으로써 유전 현상이 나타남을 사례를 들어 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "생명의 진화",
      "code": "12융과03-07",
      "desc": "유전과 진화의 과정을 유전자의 전달과 변화로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "정보통신과 신소재",
      "code": "12융과04-01",
      "desc": "빛, 힘, 소리, 온도 변화, 압력 변화, 탄성파, 전자기파 등 자연계의 물리적 정보 발생 과정을 통해, 아날로그 정보와 디지털 정보의 의미와 차이를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "정보통신과 신소재",
      "code": "12융과04-02",
      "desc": "정보를 인식하는 여러 가지 센서의 기본 작동 원리를 이해하고, 휴대전화, 광통신 등 첨단 정보 전달기기에서 정보가 다른 형태로 변환되어 전달되는 과정을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "정보통신과 신소재",
      "code": "12융과04-03",
      "desc": "하드디스크 등 여러 가지 디지털 정보 저장 장치의 원리와 구조를 이해하고, 이 원리가 적용된 자기 기록 카드 등에 대해 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "정보통신과 신소재",
      "code": "12융과04-04",
      "desc": "눈에서 색을 인식하는 세포의 특성과 빛의 3원색 사이의 관계를 바탕으로, LCD 등 영상 표현 장치와 디지털 카메라 등 영상 저장 장치의 원리와 구조를 과학적으로 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "정보통신과 신소재",
      "code": "12융과04-05",
      "desc": "고체에 대한 에너지 띠구조를 바탕으로 도체, 부도체, 반도체의 차이가 나타난다는 것을 이해하고, 이는 초전도체와 액정 등 새로운 소재의 물리적 원리로 활용될 수 있음을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "정보통신과 신소재",
      "code": "12융과04-06",
      "desc": "반도체의 도핑과 반도체 소자의 전기적 특성을 이해하고, 이러한 특성이 다이오드와 트랜지스터, 고집적 메모리 등의 구조에 활용되는 사례를 제시할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "정보통신과 신소재",
      "code": "12융과04-07",
      "desc": "고분자 물질의 구조와 이에 따른 특성을 이해하고, 고분자 물질의 특성을 활용한 합성섬유, 합성수지, 나노 물질 등 다양한 첨단 소재를 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "정보통신과 신소재",
      "code": "12융과04-08",
      "desc": "중요한 광물 자원의 생성 과정과 유형, 분포와 탐사 방법을 설명할 수 있고, 광물 자원이 활용되는 사례를 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "인류의 건강과 과학기술",
      "code": "12융과05-01",
      "desc": "질소 고정의 의미와 비료의 생산, 농작물과 가축 개량을 위한 육종과 유전공학 기술, 식품의 안전성과 품질 개선 기술 등 식량 자원의 양과 질의 향상에 적용된 과학적 원리를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "인류의 건강과 과학기술",
      "code": "12융과05-02",
      "desc": "식량 자원의 지속적인 개발 및 확보와 관련하여 생태계와 생물다양성의 가치 및 종자은행의 중요성을 이해하고, 물의 소독, 살균, 세제의 사용이 인간 수명의 증가와 건강의 증진에 기여하였음을 조사하여 발표할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "인류의 건강과 과학기술",
      "code": "12융과05-03",
      "desc": "건강한 생활의 유지를 위해 세포의 물질 대사, 생장, 조직 형성 및 에너지 공급을 위한 영양소의 고른 섭취가 필요함을 이해하고, 일과 운동을 통하여 에너지가 소비되는 과정을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "인류의 건강과 과학기술",
      "code": "12융과05-04",
      "desc": "병원체로 작용하는 박테리아와 바이러스의 특징을 이해하고, 이들의 확산을 방지하기 위해 개발된 백신과 면역 과정에 대해 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "인류의 건강과 과학기술",
      "code": "12융과05-05",
      "desc": "의료에 사용되는 청진기, 혈압계, 내시경과 MRI를 비롯한 첨단 영상 진단 장치에는 물리적 원리가 적용되었으며, 혈액 검사 등에는 화학적 원리가 적용되었다는 것을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "인류의 건강과 과학기술",
      "code": "12융과05-06",
      "desc": "생태계와 생물다양성의 가치를 천연 의약품과 관련지어 설명하고, 아스피린 등의 합성 의약품의 중요성에 대해 토의할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "인류의 건강과 과학기술",
      "code": "12융과05-07",
      "desc": "암의 발생은 유전적·환경적 요인과 관련됨을 알고, DNA 염기 서열과 단백질의 상세 구조에 대한 지식을 바탕으로 개발된 신약이 암의 진단과 치료에 활용되는 사례를 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "에너지와 환경",
      "code": "12융과06-01",
      "desc": "에너지가 다양한 형태로 존재하고, 자연이나 일상생활에서 에너지가 다른 형태로 전환되는 과정에서 에너지가 보존됨을 예를 들어 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "에너지와 환경",
      "code": "12융과06-02",
      "desc": "지구의 가장 중요한 에너지원은 태양 에너지와 화석 연료이고, 에너지를 빛, 열, 소리, 전기 등으로 전환시키는 기술을 바탕으로 인류 문명이 발전해 온 과정을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "에너지와 환경",
      "code": "12융과06-03",
      "desc": "에너지 전환 과정의 효율 관점에서 영구기관은 불가능하다는 것을 과학적으로 논증할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "에너지와 환경",
      "code": "12융과06-04",
      "desc": "대기와 해양의 순환은 지구의 에너지 순환 과정이며, 엘니뇨나 라니냐와 같은 해양 순환의 변화가 기후에 심각하게 영향을 준다는 것을 추론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "에너지와 환경",
      "code": "12융과06-05",
      "desc": "화석 연료의 사용은 산화와 환원 과정이며, 화석 연료의 과다 사용이 지구 온난화와 기후 변화를 일으킨다는 것을 논증할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "에너지와 환경",
      "code": "12융과06-06",
      "desc": "식물의 광합성은 이산화 탄소의 환원 과정으로 탄소의 순환과 관련되며, 광합성에서 빛 에너지의 역할을 빛의 특성과 관련지어 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "에너지와 환경",
      "code": "12융과06-07",
      "desc": "화석연료와 방사성 에너지 자원의 생성 과정을 이해하고, 에너지 자원의 고갈로 발생한 문제를 해결하는 방안에 대해 토론할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "에너지와 환경",
      "code": "12융과06-08",
      "desc": "태양, 풍력, 조력, 파력, 지열, 바이오 등과 같은 재생 에너지와 핵융합이나 수소 등과 같은 신에너지 자원을 이해하고, 지속가능한 발전의 관점에서 신재생 에너지를 활용하는 방안을 설명할 수 있다."
    },
    {
      "dept": "과학",
      "subject": "융합과학",
      "domain": "에너지와 환경",
      "code": "12융과06-09",
      "desc": "태양 전지, 연료전지, 하이브리드 기술은 환경적 관점에서 필요하다는 것을 논증할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-01",
      "desc": "보어 모형을 이용하여 수소의 선 스펙트럼을 해석하고 수소 원자의 에너지 준위를 계산할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-02",
      "desc": "물질파와 불확정성의 원리를 이용해 현대적 원자 모형의 특징을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-03",
      "desc": "오비탈의 종류별 파동 함수, 확률 밀도 함수, 확률 분포 함수를 그리고 마디와 에너지 준위를 관계를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-04",
      "desc": "기체 방전관 실험을 통해 다전자 원자의 선 스펙트럼을 관찰하고 수소 원자와의 차이를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-05",
      "desc": "다전자 원자에서 각 오비탈의 유효 핵전하량이 차이가 나는 이유를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-06",
      "desc": "배타 원리와 훈트 규칙을 적용하여 다전자 원자의 바닥 상태 전자 배치를 오비탈 기호로 나타낼 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-07",
      "desc": "현대적 주기율표의 구조를 오비탈 전자배치와 연관 지어 설명할 수 있고, 주기율표의 원소들을 금속, 비금속, 준금속으로 분류할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-08",
      "desc": "주기율표에서 원자가 전자의 수, 유효 핵전하량, 원자 반지름, 이온화 에너지, 전자 친화도, 전기 음성도 등의 주기성을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-09",
      "desc": "18족 기체의 전자 배치를 이용하여 옥텟규칙을 설명하고, 원자가 결합 이론으로 화학 결합을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-10",
      "desc": "화학 결합이 전자의 공유나 이동에 의해 일어나는 원리를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-11",
      "desc": "결합의 쌍극자 모멘트를 이용하여 결합의 종류를 구별할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-12",
      "desc": "원자가 전자를 이용하여 2, 3주기 원소를 중심 원자로 가지는 분자 또는 이온의 루이스 구조식을 그리고, 형식 전하와 공명 관계를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-13",
      "desc": "공유 결합 형성 과정에서 원자 사이의 거리에 따른 엔탈피 변화를 설명하고, 결합 길이와 결합 엔탈피를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-14",
      "desc": "2주기 원소의 수소 화합물의 분자 모양을 sp, sp², sp³ 혼성 오비탈로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-15",
      "desc": "이온결합의 형성원리와 격자에너지를 본-하버(Born-Haber) 회로를 이용하여 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-16",
      "desc": "전이 금속의 d 오비탈을 이용한 배위 결합의 형성 원리와 착화합물의 구조를 루이스 구조식으로 나타내며, 결정장 이론을 이용하여 색을 나타내는 원리를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-17",
      "desc": "원자 오비탈의 상호 작용에 의한 분자 오비탈의 결합 오비탈과 반결합 오비탈의 형성 원리와 에너지 준위를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-18",
      "desc": "분자 오비탈을 형성하는 원자 오비탈의 종류에 따라 시그마 오비탈과 파이 오비탈이 형성되는 원리를 설명하고, 에너지 준위를 비교할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-19",
      "desc": "2주기 홑원소 물질의 분자 오비탈을 그릴 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-20",
      "desc": "띠 이론을 이용하여 금속 결합의 특징을 설명하고, 도체, 반도체, 부도체를 구분할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-21",
      "desc": "여러 가지 탄화수소의 루이스 구조를 그리고 중심 원자의 혼성 오비탈과 각 결합의 분자 오비탈 이름을 말할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-22",
      "desc": "탄소 화합물이 다양한 이유를 설명할 수 있고, 구조식을 그려 특징을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-23",
      "desc": "탄소수가 6개까지의 포화 탄화수소의 구조식을 그리고 구조 이성질체를 구별할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-24",
      "desc": "포화 탄화수소가 반응성이 낮고 치환 반응을 주로 하는 이유를 결합의 극성, 결합 엔탈피, 분자 오비탈의 성격 등으로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-25",
      "desc": "에틸렌과 아세틸렌의 구조식을 그리고 기하 이성질체를 구별하며, 불포화 탄화수소가 첨가 반응을 주로 하는 원리를 분자 오비탈의 성격과 결합 엔탈피로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-26",
      "desc": "탄화수소 유도체의 작용기에서 전기 음성도차에 의한 결합의 극성과 전자 분포를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-27",
      "desc": "탄화수소 유도체의 작용기에 따른 화학 반응성을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 구조",
      "code": "12고화01-28",
      "desc": "간단한 컨쥬게이션 분자와 벤젠과 같은 방향족의 구조식을 그리고, 분자 오비탈로 방향족의 안정성을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-01",
      "desc": "질량을 중심으로 측정의 도구에 따른 측정된 값의 유효숫자를 구분하고 셀 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-02",
      "desc": "유효숫자를 과학적 표기법으로 나타낼 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-03",
      "desc": "유효숫자를 이용한 계산 결과를 유효숫자 처리 규칙에 맞게 나타낼 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-04",
      "desc": "국제 표준 단위를 열거하고, 복합 단위와 관용 단위를 표준단위로 나타낼 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-05",
      "desc": "과학적 표기법과 단위로 물리량을 명확히 나타낼 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-06",
      "desc": "아보가드로수와 몰의 의미를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-07",
      "desc": "원자의 구성 입자로 원자 번호와 질량수를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-08",
      "desc": "같은 원자 번호를 가지는 동위 원소들의 예를 들 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-09",
      "desc": "원자의 몰 질량과 원자량의 관계를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-10",
      "desc": "동위 원소의 존재비를 고려한 평균 원자량을 계산할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-11",
      "desc": "평균 원자량으로 분자나 이온 화합물의 화학식량을 구할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-12",
      "desc": "원소 분석을 통하여 화합물의 실험식을 구할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-13",
      "desc": "실험식과 분자식의 관계를 이용하여 분자량을 구할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-14",
      "desc": "물질의 변화를 화학 반응식으로 나타내고, 반응물과 생성물의 양적 관계를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-15",
      "desc": "기체 분자 운동의 특징과 온도에 따른 기체 분자의 속력 분포 변화를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-16",
      "desc": "기체의 온도, 압력, 부피 사이의 관계를 기체 분자 운동론으로 설명하고, 이상 기체 방정식으로 양적 관계 문제를 해결할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-17",
      "desc": "기체 상수를 다양한 단위로 나타내고 그 의미를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-18",
      "desc": "실제 기체와 이상 기체의 차이를 설명하고, 이상 기체 방정식의 한계를 실제 기체의 반데르발스 방정식이 어떻게 보완하는지 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-19",
      "desc": "혼합 기체에서 성분 기체의 분압을 몰 분율을 사용하여 구할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-20",
      "desc": "여러 가지 분자 간 상호 작용의 원리를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-21",
      "desc": "액체의 증발 현상을 설명하고, 증기압의 의미를 동적 평형으로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-22",
      "desc": "여러 가지 액체의 증기압을 측정하고, 온도와 물질의 종류에 따른 증기압의 변화를 분자 간 상호작용으로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-23",
      "desc": "증발과 끓음의 차이를 설명하고 끓는점을 정의할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-24",
      "desc": "액체의 끓는점으로 분자 간 상호작용의 크기를 비교할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-25",
      "desc": "액체의 표면 장력과 모세관 현상을 분자 간 상호작용으로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-26",
      "desc": "물의 다양한 성질을 물 분자 구조와 수소 결합으로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-27",
      "desc": "물의 성질과 관련된 자연 현상 및 생명 현상을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-28",
      "desc": "고체의 종류와 특징을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-29",
      "desc": "금속 결정 모형을 만들고 결정 구조의 특징을 단위세포의 개념으로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-30",
      "desc": "다양한 이온 결정의 특징을 설명할 수 있고, 이온 결정 모형을 이용하여 이온 결정의 화학식을 구할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-31",
      "desc": "화학에서 액체의 부피를 측정하는 도구들의 특징과 용도를 설명할 수 있고, 요구되는 측정의 정밀도에 따라 알맞은 측정 도구를 선택하여 올바르게 사용할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-32",
      "desc": "용액의 농도를 퍼센트 농도, 몰 농도, 몰랄 농도로 나타낼 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-33",
      "desc": "다양한 농도의 용액을 제조할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-34",
      "desc": "주어진 용액의 농도를 다양한 단위로 변환할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-35",
      "desc": "진한 용액을 원하는 묽은 농도의 용액으로 희석할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-36",
      "desc": "용해 현상을 동적 평형으로 설명하고 용해도를 정의할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-37",
      "desc": "용해도를 좌우하는 요인을 분자 간 상호작용, 온도 등으로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 성질",
      "code": "12고화02-38",
      "desc": "묽은 용액에서 증기 압력 내림을 끓는점 오름 실험을 통해 확인할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-01",
      "desc": "화학 반응을 통해 열이 출입하는 것을 실험을 통해 확인하고, 반응열을 열량계로 측정할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-02",
      "desc": "화학 반응계의 종류를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-03",
      "desc": "계의 내부 에너지의 구성 요소를 설명하고, 내부 에너지의 크기를 비교할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-04",
      "desc": "자연에서 일어나는 발열 반응과 흡열 반응의 예를 들고, 에너지의 전환과 이동을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-05",
      "desc": "계의 부피 변화에 의한 일을 계산할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-06",
      "desc": "계의 내부 에너지 변화를 열과 일로 나타내고, 에너지 보존 법칙을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-07",
      "desc": "화학 반응에서 표준 상태를 정의할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-08",
      "desc": "엔탈피 개념을 이해하고, 엔탈피 변화와 열과의 관계를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-09",
      "desc": "화학 반응에서 반응 엔탈피의 중요성을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-10",
      "desc": "생성 엔탈피를 이용하여 헤스 법칙으로 미지 반응의 엔탈피를 계산할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-11",
      "desc": "자발적 반응의 예를 들 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-12",
      "desc": "자유 팽창이 일어나는 이유를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-13",
      "desc": "고립계에서 일어나는 자발적 변화의 방향을 엔트로피 증가의 법칙으로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-14",
      "desc": "엔트로피의 의미를 미시적 상태수로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-15",
      "desc": "엔트로피의 변화를 가역적 열의 출입으로 계산할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-16",
      "desc": "열의 이동과 미시적 상태수의 변화를 연결하여 엔트로피 증감을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-17",
      "desc": "절대 엔트로피 값을 이용하여 계의 엔트로피 변화를 계산할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-18",
      "desc": "주위 엔트로피 변화를 구하기 위해 반응 엔탈피를 이용하는 이유를 설명하고 엔트로피 변화를 계산할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-19",
      "desc": "엔트로피 증가의 법칙으로 깁스 자유 에너지 변화량을 구하는 식을 유도할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-20",
      "desc": "깁스 자유 에너지 변화량과 우주 엔트로피 변화량의 관계를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-21",
      "desc": "일정 압력, 일정 온도에서 자발적 변화는 계의 깁스 자유 에너지가 감소하는 방향으로 일어남을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-22",
      "desc": "계의 깁스 자유 에너지가 작을수록 계의 안정성이 증가하는 이유를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "물질의 변화와 에너지",
      "code": "12고화03-23",
      "desc": "온도에 따라 자발적 변화의 방향이 달라질 수 있음을 설명하고, 이를 통해 온도에 따른 물질의 상태 변화 방향을 예측할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-01",
      "desc": "가역 반응과 비가역 반응을 구분할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-02",
      "desc": "가역 반응의 동적 평형 상태를 설명할 수 있고, 화학 평형 상태에서 계의 깁스 자유 에너지가 최소가 되는 이유를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-03",
      "desc": "질량 작용의 법칙으로 화학 평형 상수를 구할 수 있고, 주어진 조건에서 반응 지수와 평형 상수를 비교하여 반응의 진행 방향을 예측할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-04",
      "desc": "비평형 상태의 반응 지수로 계의 깁스 자유 에너지를 나타내고, 반응의 진행 방향을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-05",
      "desc": "표준 깁스 자유 에너지 변화량으로 평형 상수를 구하고, 평형 상수와 수득률의 관계를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-06",
      "desc": "온도와 평형 상수의 관계를 깁스 자유 에너지로 나타낼 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-07",
      "desc": "농도, 압력, 온도가 변함에 따라 화학 평형이 이동하는 것을 관찰하고, 이를 르샤틀리에 원리로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-08",
      "desc": "고체, 액체, 기체 사이의 동적 평형에서 증기압의 역할을 설명하고, 온도와 압력에 따른 물질의 상평형 그림을 그릴 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-09",
      "desc": "용해 평형에서 용해도와 용해도곱이 평형 상수와 어떤 관계를 가지는지 설명하고, 온도와 압력에 따른 용해도의 증감을 예측할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-10",
      "desc": "산과 염기에 대한 아레니우스, 브뢴스테드-로리, 루이스 정의를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-11",
      "desc": "여러 가지 산과 염기의 이온화 반응식을 쓰고 이온화 평형 상수 식을 쓸 수 있으며, 이온화 평형 상수의 의미를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-12",
      "desc": "여러 가지 산·염기 반응에서 짝산과 짝염기 관계를 설명할 수 있으며 서로의 상대적 세기를 비교하고 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-13",
      "desc": "물의 자동 이온화 평형 상수 식을 이용하여 표준 상태에서 pH를 구할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-14",
      "desc": "산·염기의 이온화 평형과 물의 자동 이온화 평형의 경쟁 관계로 수용액에서 산과 염기의 세기를 설명하고 비교할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-15",
      "desc": "핸더슨-하셀바흐 식을 유도하고, 그것을 이용하여 산의 수용액 pH를 계산할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-16",
      "desc": "완충 용액의 원리를 설명하고 pH를 계산할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-17",
      "desc": "염의 가수 분해 결과를 산·염기 평형으로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "화학 평형",
      "code": "12고화04-18",
      "desc": "중화 반응의 양적 관계를 설명하고, 중화 적정을 수행하여 미지 산의 농도를 구할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "전기 화학",
      "code": "12고화05-01",
      "desc": "전자의 이동으로 산화와 환원 반응을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "전기 화학",
      "code": "12고화05-02",
      "desc": "전기 음성도 차이를 이용하여 분자를 이루는 원자들의 산화수를 계산하고, 산화수의 변화를 이용하여 산화와 환원 반응을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "전기 화학",
      "code": "12고화05-03",
      "desc": "산화·환원 반응식의 계수를 맞출 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "전기 화학",
      "code": "12고화05-04",
      "desc": "산화·환원 반응식에서 산화제와 환원제를 구별할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "전기 화학",
      "code": "12고화05-05",
      "desc": "강한 산화제와 강한 환원제의 특징을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "전기 화학",
      "code": "12고화05-06",
      "desc": "볼타 전지와 다니엘 전지를 제작하고, 각 전지에서 일어나는 산화·환원 반응을 반쪽 반응식과 전체 반응식으로 나타낼 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "전기 화학",
      "code": "12고화05-07",
      "desc": "화학 전지의 원리를 산화 환원 반응의 자발성으로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "전기 화학",
      "code": "12고화05-08",
      "desc": "수소 전극을 기준으로 구한 표준 환원 전위로 여러 가지 물질의 산화 환원 반응의 반응성을 상대적으로 비교할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "전기 화학",
      "code": "12고화05-09",
      "desc": "화학 전지의 전위차를 각 전극의 표준 환원 전위로 구할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "전기 화학",
      "code": "12고화05-10",
      "desc": "표준 전지 전위차와 깁스 자유 에너지의 관계로 화학 전지의 원리를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "전기 화학",
      "code": "12고화05-11",
      "desc": "여러 가지 실용 전지와 수소 연료 전지의 원리와 특징을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "전기 화학",
      "code": "12고화05-12",
      "desc": "전기 분해의 원리를 깁스 자유 에너지로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "전기 화학",
      "code": "12고화05-13",
      "desc": "전기 분해의 원리를 산화 환원 반응으로 설명하고, 전기량과 생성물의 양 관계를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "반응 속도",
      "code": "12고화06-01",
      "desc": "실생활에서 빠른 반응과 느린 반응의 예를 들 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "반응 속도",
      "code": "12고화06-02",
      "desc": "반응의 빠르기를 좌우하는 물질의 특성을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "반응 속도",
      "code": "12고화06-03",
      "desc": "화학 반응의 속도가 물질의 농도에 의존함을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "반응 속도",
      "code": "12고화06-04",
      "desc": "화학 반응의 초기 농도와 초기 속도를 측정하는 실험을 통하여 반응 속도식을 구할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "반응 속도",
      "code": "12고화06-05",
      "desc": "0, 1, 2차 반응의 반응 속도식을 적분법으로 풀어 농도와 시간과의 관계를 나타낼 수 있고, 반감기를 구할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "반응 속도",
      "code": "12고화06-06",
      "desc": "전체 화학 반응식과 반응 메커니즘의 차이를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "반응 속도",
      "code": "12고화06-07",
      "desc": "반응 메커니즘에서 결합의 변화를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "반응 속도",
      "code": "12고화06-08",
      "desc": "반응 메커니즘과 반응 속도식으로 반응 속도 결정 단계를 구별할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "반응 속도",
      "code": "12고화06-09",
      "desc": "촉매를 사용하여 반응 속도가 달라지는 것을 실험을 통해 확인하고, 그 이유가 반응 메커니즘이 달라지기 때문임을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "반응 속도",
      "code": "12고화06-10",
      "desc": "온도에 따른 반응 속도 변화 실험을 수행하고, 반응 속도와 온도의 관계를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "반응 속도",
      "code": "12고화06-11",
      "desc": "화학 반응이 일어나기 위해 활성화 에너지가 필요한 이유를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "반응 속도",
      "code": "12고화06-12",
      "desc": "활성화 에너지와 반응 속도의 관계를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "반응 속도",
      "code": "12고화06-13",
      "desc": "유효충돌의 의미를 기체 분자의 속력 분포와 연관 지어 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 화학",
      "domain": "반응 속도",
      "code": "12고화06-14",
      "desc": "반응 메커니즘이 달라지면 활성화 에너지의 크기가 달라지는 이유를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "세포와 에너지",
      "code": "12고생01-01",
      "desc": "세포를 구성하는 유기화합물의 종류를 탄수화물, 지질, 단백질, 핵산으로 구분하고 각 물질의 특성을 실험을 통해 확인하고 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "세포와 에너지",
      "code": "12고생01-02",
      "desc": "탄수화물, 지질, 단백질, 핵산의 기능을 각 물질의 분자 구조를 바탕으로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "세포와 에너지",
      "code": "12고생01-03",
      "desc": "엽록소 형광 발생 실험을 통해 엽록체의 틸라코이드막에서 빛에너지가 흡수되는 과정을 이해하고 빛에너지가 ATP의 화학 에너지로 전환되는 전자전달 과정을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "세포의 에너지",
      "code": "12고생01-04",
      "desc": "빈 회로에서 중간 산물의 생성과 변화 과정을 이해하고, 이를 밝혀낸 과정을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "세포의 에너지",
      "code": "12고생01-05",
      "desc": "순환적 광인산화와 비순환적 광인산화의 차이를 이해하고 이를 결정하는 요인을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "세포의 에너지",
      "code": "12고생01-06",
      "desc": "광호흡의 의미를 알고, 환경에 대한 적응의 측면에서 C3, C4, CAM 식물의 차이를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "세포의 에너지",
      "code": "12고생01-07",
      "desc": "전자현미경 사진에서 미토콘드리아의 미세구조를 확인하고, 발효 실험을 통해 세포 호흡의 해당과정에서 일어나는 기질수준 인산화의 의미를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "세포의 에너지",
      "code": "12고생01-08",
      "desc": "해당과정과 TCA회로의 각 경로에서 생성되는 중간 산물의 화학적 특성을 알고, 그들의 생성과 변화를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "세포의 에너지",
      "code": "12고생01-09",
      "desc": "전자 전달계와 화학삼투에 의한 산화적 인산화 과정을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "세포의 에너지",
      "code": "12고생01-10",
      "desc": "ATP 합성효소의 ATP 합성 원리에 대한 탐구 과정을 통해 ATP 합성의 원리를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "세포의 에너지",
      "code": "12고생01-11",
      "desc": "포도당 이외의 유기화합물의 분해 및 합성 과정을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "세포의 에너지",
      "code": "12고생01-12",
      "desc": "근육 수축처럼 ATP 에너지가 세포의 생명 활동에 이용되는 다양한 사례를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "세포의 에너지",
      "code": "12고생01-13",
      "desc": "산소호흡, 무산소호흡, 발효의 차이를 구분하고 사례를 들어 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생물의 조절과 방어",
      "code": "12고생02-01",
      "desc": "신경세포의 막 전위 변화를 세포막에서의 이온 이동을 중심으로 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생물의 조절과 방어",
      "code": "12고생02-02",
      "desc": "활동 전위의 전도와 시냅스에서의 흥분 전달 과정을 이해하고, 흥분성 시냅스와 억제성 시냅스에 대해 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생물의 조절과 방어",
      "code": "12고생02-03",
      "desc": "중추 신경계에서 이루어지는 자극 전달을 조절하는 약물 및 학습과 기억의 원리를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생물의 조절과 방어",
      "code": "12고생02-04",
      "desc": "신경과 호르몬을 비롯한 다세포 생물의 신호 전달 방식을 알고 이들의 차이점을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생물의 조절과 방어",
      "code": "12고생02-05",
      "desc": "호르몬의 작용메커니즘을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생물의 조절과 방어",
      "code": "12고생02-06",
      "desc": "수용성 호르몬과 지용성 호르몬을 구별하고 이들의 신호 전달 방식의 차이점을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생물의 조절과 방어",
      "code": "12고생02-07",
      "desc": "옥신 농도에 따른 줄기 신장 실험을 통해 식물 호르몬의 종류와 기능 및 피토크롬과 광주기성에 대해 이해하고 식물의 화학적 조절 메커니즘을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생물의 조절과 방어",
      "code": "12고생02-08",
      "desc": "식물 종자 발아에 관여하는 피토크롬의 역할을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생물의 조절과 방어",
      "code": "12고생02-09",
      "desc": "질병의 의미를 이해하고 전염성 질병과 병원체의 종류를 관련지어 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생물의 조절과 방어",
      "code": "12고생02-10",
      "desc": "비특이적 방어와 특이적 방어를 구별하고, 림프구의 종류와 기능을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생물의 조절과 방어",
      "code": "12고생02-11",
      "desc": "체액성 면역과 세포성 면역을 구분하고, 이들의 유기적 관계를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생물의 조절과 방어",
      "code": "12고생02-12",
      "desc": "면역 관련 질병의 다양한 사례와 발병 메커니즘을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생물의 조절과 방어",
      "code": "12고생02-13",
      "desc": "단일 항체를 활용하여 암을 극복할 수 있는 원리를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생물의 조절과 방어",
      "code": "12고생02-14",
      "desc": "식물은 세균이나 해충의 피해를 막기 위해 어떤 방어 수단을 가지고 있는지 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-01",
      "desc": "세포 분열의 필요성을 알고, 세포 주기 각 단계의 특징 및 세포 주기 조절 메커니즘을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-02",
      "desc": "세포분열 시 염색체가 분리되는 과정을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-03",
      "desc": "원핵세포와 진핵세포의 염색체 구성 물질 및 미세 구조적 차이를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-04",
      "desc": "핵산이 유전물질이라는 실험적 증거들을 학습하고, DNA와 염색체, 유전자의 관계를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-05",
      "desc": "유전체의 개념을 알고, 종에 따라 유전체의 크기, 밀도 등의 특성이 다름을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-06",
      "desc": "다세포 진핵생물이 갖는 비암호화 DNA의 종류와 다유전자군의 특성을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-07",
      "desc": "DNA의 반보존적 복제를 확인하는 실험 과정을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-08",
      "desc": "선도가닥과 지연가닥에서의 DNA 복제 과정 차이를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-09",
      "desc": "DNA 복제 과정 중 발생한 오류를 교정하는 DNA 중합효소의 기능을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-10",
      "desc": "유전자와 단백질의 관계를 알고, 유전자 전사 및 단백질 합성의 과정을 상세하게 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-11",
      "desc": "원핵생물과 진핵생물의 유전자 발현 과정의 차이점을 알고 진핵생물에서 유전자 발현이 조절되는 원리를 전사, 전사 후, 번역, 번역 후의 조절 등으로 나누어 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-12",
      "desc": "돌연변이, 바이러스 등에 의해 유전 정보가 달라지는 메커니즘 및 유전자 질환에 대해 구체적인 예를 들어 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-13",
      "desc": "DNA 중복, 재배열, 돌연변이 등에 의하여 유전체가 진화하는 과정을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-14",
      "desc": "서로 다른 종간의 유전체 비교를 통해 계통학적 근연 관계를 추론할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-15",
      "desc": "발생의 과정을 유전자의 발현과 관련하여 이해하고, 물리적, 화학적, 생물학적 요인에 의한 유전자의 연속적, 차등적 발현과 발생의 조절에 대해 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-16",
      "desc": "동물의 기본 구조가 형성되는 형태 형성의 과정을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-17",
      "desc": "특정 신호에 의한 유도 작용 및 세포분화의 일반적 원리를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "유전자의 구조와 발현",
      "code": "12고생03-18",
      "desc": "발생에 관여하는 유전자들이 진화에 중요한 역할을 한다는 것을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생명공학의 기술과 응용",
      "code": "12고생04-01",
      "desc": "세포와 조직을 배양하는 과정에서 염색체나 유전자를 인위적으로 조작할 수 있는 세포 공학 기술을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생명공학의 기술과 응용",
      "code": "12고생04-02",
      "desc": "유전자 재조합 기술과 이에 사용되는 제한 효소의 기능과 종류를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생명공학의 기술과 응용",
      "code": "12고생04-03",
      "desc": "식물 조직 배양, 동물의 핵 이식에 관한 연구 사례를 학습하고, 동·식물의 복제 원리를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생명공학의 기술과 응용",
      "code": "12고생04-04",
      "desc": "전체 유전체 해독을 위한 접근 방법을 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생명공학의 기술과 응용",
      "code": "12고생04-05",
      "desc": "유전체 분석 자료의 관리 과정을 알고, 이를 활용한 프로테오믹스, 시스템생물학 등의 최신 학문에서 하는 일이 무엇인지를 설명할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생명공학의 기술과 응용",
      "code": "12고생04-06",
      "desc": "유전자 치료 방법의 예를 들고, 유전자 치료 및 인간 게놈 프로젝트의 의미와 문제, 미래에 대한 자신의 견해를 근거를 들어 주장할 수 있다."
    },
    {
      "dept": "과학계열",
      "subject": "고급 생명과학",
      "domain": "생명공학의 기술과 응용",
      "code": "12고생04-07",
      "desc": "생명공학의 발달로 초래될 수 있는 윤리적, 사회적 문제점을 제시하고 이에 대한 자신의 견해를 근거를 들어 주장할 수 있다."
    },
    {
      "dept": "외국어 계열",
      "subject": "일본문화",
      "domain": "",
      "code": "12일문-01-01",
      "desc": "일본인의 언어·비언어 문화 등을 이해하여 상황에 맞게 표현한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "일본문화",
      "domain": "",
      "code": "12일문-01-02",
      "desc": "일본의 개관, 일상생활 문화, 전통문화, 대중문화, 예술문화 등에 대해 이해한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "일본문화",
      "domain": "",
      "code": "12일문-01-03",
      "desc": "일본의 개관, 일상생활 문화, 전통문화, 대중문화, 예술문화 등에 관한 글을 읽고 주제를 찾거나 내용을 요약한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "일본문화",
      "domain": "",
      "code": "12일문-01-04",
      "desc": "일본의 개관, 일상생활 문화, 전통문화, 대중문화, 예술문화 등에 대해 조사하여 정리한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "일본문화",
      "domain": "",
      "code": "12일문-01-05",
      "desc": "일본의 개관, 일상생활 문화, 전통문화, 대중문화, 예술문화 등에 대해 조사하여 발표·토론한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "일본문화",
      "domain": "",
      "code": "12일문-01-06",
      "desc": "상호 문화적 관점에서 한국 문화와 일본 문화의 공통점과 차이점을 이해하고 표현한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "중국 문화",
      "domain": "",
      "code": "12중문-01-01",
      "desc": "중국인의 일상생활 문화를 다양한 활동을 통하여 체험한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "중국 문화",
      "domain": "",
      "code": "12중문-01-02",
      "desc": "중국 개관, 일상생활, 예술, 전통, 사회, 언어 문화 등에 대해 조사하여 발표한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "중국 문화",
      "domain": "",
      "code": "12중문-01-03",
      "desc": "중국과 우리나라 문화의 공통점과 차이점을 이해하고 설명한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "중국 문화",
      "domain": "",
      "code": "12중문-01-04",
      "desc": "다양성을 존중하는 입장에서 중국 문화를 올바르게 이해한다."
    },
    {
      "dept": "외국어 계열",
      "subject": "중국 문화",
      "domain": "",
      "code": "12중문-01-05",
      "desc": "중국의 언어 문화, 문화적 특징 등에 대한 이해를 바탕으로 의사소통 상황에서 이를 반영하여 표현한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 생활",
      "domain": "스포츠 가치",
      "code": "12스생01-01",
      "desc": "현대 사회에서 제도화된 스포츠의 의미를 이해하고 스포츠의 역할과 특성을 탐색한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 생활",
      "domain": "스포츠 가치",
      "code": "12스생01-02",
      "desc": "스포츠가 문화에 미치는 영향과 문화가 스포츠에 미치는 영향을 비교·분석하여 문화로서의 스포츠를 이해한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 생활",
      "domain": "스포츠 가치",
      "code": "12스생01-03",
      "desc": "스포츠의 관행, 규범, 제도 등 스포츠 경기와 관련된 문화를 분석하여 스포츠 경기에서 요구되는 경기 문화를 판단한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 생활",
      "domain": "스포츠 가치",
      "code": "12스생01-04",
      "desc": "스포츠 참여 과정에서 스포츠맨십과 페어플레이 정신을 발휘하고 윤리적 태도를 함양한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 생활",
      "domain": "스포츠 수행",
      "code": "12스생02-01",
      "desc": "스포츠 활동에 대한 도전 계획을 수립하고 스포츠 도전 상황에서 목적한 성취를 위해 인내하고 지속적으로 수련할 수 있는 실천 의지를 함양한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 생활",
      "domain": "스포츠 수행",
      "code": "12스생02-02",
      "desc": "스포츠 활동에 참여하면서 스포츠 경쟁의 의미를 이해하고 스포츠를 통해 서로를 존중하고 배려하는 태도로 상호 작용을 함으로써 긍정적 대인 관계를 형성한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 생활",
      "domain": "스포츠 수행",
      "code": "12스생02-03",
      "desc": "스포츠 표현의 동작과 원리를 바탕으로 스포츠 표현 작품을 발표하고 감상·비평을 실천한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 생활",
      "domain": "스포츠 수행",
      "code": "12스생02-04",
      "desc": "스포츠 참여의 목적과 가치를 이해하고 여가 선용을 위한 스포츠 참여 계획을 수립하여 지속적으로 참여한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 생활",
      "domain": "스포츠 안전",
      "code": "12스생03-01",
      "desc": "스포츠 상황에서 발생할 수 있는 다양한 안전사고의 유형과 특성을 탐색한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 생활",
      "domain": "스포츠 안전",
      "code": "12스생03-02",
      "desc": "스포츠 상황에서 발생할 수 있는 안전사고를 예방하고, 안전사고가 발생했을 때 적절한 대처 요령 및 처치 방법을 적용한다."
    },
    {
      "dept": "체육",
      "subject": "스포츠 생활",
      "domain": "스포츠 안전",
      "code": "12스생03-03",
      "desc": "스포츠 안전에 영향을 미치는 기후, 시설, 장비 등의 환경적 요소를 조사하고 분석하여 스포츠 활동에 적용한다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "논술과 비판적 사고",
      "code": "12논술01-01",
      "desc": "논술이 합리적 설득 및 지식(정보)의 수용과 전달을 위한 학문적 의사소통의 주된 양식임을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "논술과 비판적 사고",
      "code": "12논술01-02",
      "desc": "비판적 사고가 다양한 텍스트의 분석, 평가 및 새로운 텍스트의 산출에 필수적인 정신적 소양임을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "논술과 비판적 사고",
      "code": "12논술01-03",
      "desc": "논술 과정을 통해 비판적 사고력이 더욱 향상됨을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "논술과 비판적 사고",
      "code": "12논술01-04",
      "desc": "논술은 통합적 지식 습득의 수단임을 인식한다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "논술과 비판적 사고",
      "code": "12논술01-05",
      "desc": "논술은 자기 주도적 학습 양식임을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "분석적 글쓰기",
      "code": "12논술02-01",
      "desc": "분석적 글쓰기의 개념을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "분석적 글쓰기",
      "code": "12논술02-02",
      "desc": "분석적 글쓰기의 두 유형으로서 단순 요약과 논증적 요약의 차이를 이해한다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "분석적 글쓰기",
      "code": "12논술02-03",
      "desc": "단순 요약 방법을 익힌다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "분석적 글쓰기",
      "code": "12논술02-04",
      "desc": "텍스트의 핵심 내용을 자신의 표현으로 재구성하는 방법을 익힌다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "분석적 글쓰기",
      "code": "12논술02-05",
      "desc": "글쓴이가 다루는 문제나 물음을 파악하여 의문문의 형태로 제시하는 방법을 익힌다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "분석적 글쓰기",
      "code": "12논술02-06",
      "desc": "글쓴이가 가장 중요하게 말하려는 바(견해)를 한 문장으로 표현하는 방법을 익힌다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "분석적 글쓰기",
      "code": "12논술02-07",
      "desc": "글쓴이가 자신의 견해를 뒷받침하기 위해 제시한 근거들을 찾아 논리적 순서로 재배열하는 방법을 익힌다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "분석적 글쓰기",
      "code": "12논술02-08",
      "desc": "분석한 내용을 활용하여 논증적 요약문을 완성하는 방법을 익힌다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "분석적 글쓰기",
      "code": "12논술02-09",
      "desc": "간결하고 명료하며 알기 쉽게 표현하는 방법을 익힌다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "비판적 글쓰기",
      "code": "12논술03-01",
      "desc": "합리적 설득 및 학문적 의사소통에서 비판적 글쓰기의 중요성과 기능을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "비판적 글쓰기",
      "code": "12논술03-02",
      "desc": "다양한 방법을 활용하여 비판적으로 검토하는 방법을 익힌다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "비판적 글쓰기",
      "code": "12논술03-03",
      "desc": "비판적으로 검토한 내용을 정리하여 비판글을 완성하는 방법을 익힌다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "비판적 글쓰기",
      "code": "12논술03-04",
      "desc": "글쓴이의 견해 또는 문제 해결 내용을 수정 보완하는 방법을 익힌다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "비판적 글쓰기",
      "code": "12논술03-05",
      "desc": "새로운 대안의 모색 및 그 정당화 방법을 익힌다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "비판적 글쓰기",
      "code": "12논술03-06",
      "desc": "자신이 작성한 글이 정당한 방법에 의한 비판인지 검토한다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "문제 해결적 글쓰기",
      "code": "12논술04-01",
      "desc": "논술문의 성격과 구성을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "문제 해결적 글쓰기",
      "code": "12논술04-02",
      "desc": "논술문의 주제를 탐색하는 방법을 익힌다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "문제 해결적 글쓰기",
      "code": "12논술04-03",
      "desc": "설정된 현안문제와 잠정적 해결책을 중심으로 개요를 작성하는 방법을 익힌다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "문제 해결적 글쓰기",
      "code": "12논술04-04",
      "desc": "논술문의 구성에 따른 작성 방법을 익힌다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "문제 해결적 글쓰기",
      "code": "12논술04-05",
      "desc": "퇴고의 방법을 익히고 이에 따라 논술문을 완성한다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "자료 활용과 학습 윤리",
      "code": "12논술05-01",
      "desc": "참고 자료의 다양성을 이해하고, 신뢰성를 평가하는 방법을 익힌다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "자료 활용과 학습 윤리",
      "code": "12논술05-02",
      "desc": "자료 활용 방법으로서 인용과 참고의 차이를 이해한다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "자료 활용과 학습 윤리",
      "code": "12논술05-03",
      "desc": "표절의 정의와 기준, 그리고 다양한 유형을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "논술",
      "domain": "자료 활용과 학습 윤리",
      "code": "12논술05-04",
      "desc": "글쓰기와 관련된 학습 윤리를 함양한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경과 인간",
      "code": "12환경01-01",
      "desc": "자연, 생태, 환경의 개념을 비교하여 구분하고, 환경위기와 지속가능발전의 시대에 적합한 환경 개념을 정의한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경과 인간",
      "code": "12환경01-02",
      "desc": "환경에 대한 다양한 관점을 탐색하고, 인간의 위상에 따라 인간이 환경에 미치는 영향이 달라짐을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경과 인간",
      "code": "12환경01-03",
      "desc": "환경윤리가 인간중심윤리에서 생명윤리 및 생태윤리로 확대되는 과정을 이해하고, 환경윤리적 갈등 상황에서 타인의 의견을 경청하며 자신의 의견을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경과 인간",
      "code": "12환경01-04",
      "desc": "환경 문제와 관련하여 현 세대는 미래 세대를 배려해야 함을 이해하고, 이에 대한 구체적인 사례 및 근거를 제시한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경과 인간",
      "code": "12환경01-05",
      "desc": "자연과의 직접적인 접촉이 줄어들면서 생겨나는 현상을 조사하고, 이러한 현상이 자신의 삶에 미친 영향에 대해 토의한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경과 인간",
      "code": "12환경01-06",
      "desc": "환경 체험을 통해 자신이 살고 있는 지역의 자연적, 역사적, 문화적 특징을 이해하고 자신과 지역의 관계를 다양한 방법으로 표현한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경의 체계",
      "code": "12환경02-01",
      "desc": "인간의 생존에 필요한 조건들을 생태적 요소와 사회적 요소로 목록화해 보고 환경이 생태계와 사회체계로 구성된 체계임을 발견한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경의 체계",
      "code": "12환경02-02",
      "desc": "우리 지역의 옛날 모습과 현재 모습을 비교하여, 생태계와 사회체계의 상호작용이 환경 체계를 어떻게 변화시켰는지 설명한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경의 체계",
      "code": "12환경02-03",
      "desc": "우리 지역의 문화유산을 조사하여 지역 환경의 고유한 특성을 이해하고, 전통 생태지식을 활용하여 우리 지역의 지속가능성을 높이는 방안을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경의 체계",
      "code": "12환경02-04",
      "desc": "물질 순환과 에너지 흐름이라는 측면에서 생태계를 정의하고, 훼손된 생태계가 회복된 사례를 분석하여 안정성, 다양성, 창발성, 되먹임, 수용능력 등 생태계의 특성을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경의 체계",
      "code": "12환경02-05",
      "desc": "생태계를 구성하는 물, 대기, 토양, 생물 요소의 특성을 조사하고, 인간의 건강과 생존이라는 관점에서 생태계 구성요소의 중요성을 설명한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경의 체계",
      "code": "12환경02-06",
      "desc": "우리나라의 대표적인 생태계보전지역의 목록을 조사하고, 생태계의 종류를 육상생태계, 습지생태계, 수생생태계로 나누어 특성과 변화 양상을 비교한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경의 체계",
      "code": "12환경02-07",
      "desc": "지구 생태계의 특성을 이해하기 위해 가이아 가설, 우주선 지구호 등의 개념을 적용하여 설명한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경의 체계",
      "code": "12환경02-08",
      "desc": "일상생활에서 이용하는 상품을 대상으로 생산-유통-소비-폐기의 전체 과정에서 발생하는 환경 문제를 분석하고, 대량소비사회에서 발생하는 환경 문제를 예방하고 억제하기 위해 바람직한 시장의 역할과 경제 체계를 토의한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경의 체계",
      "code": "12환경02-09",
      "desc": "개인 간, 집단 간, 국가 간 환경 분쟁 사례를 통해 환경권의 의미를 구분하고, 환경 갈등 극복에 성공하거나 실패한 원인을 찾아 비교한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경의 체계",
      "code": "12환경02-10",
      "desc": "대표적인 환경재난 사건을 환경정의의 관점에서 분석하고, 위험사회에서 사회경제적 약자들이 더 많은 환경적 위험을 겪지 않도록 하는 방안을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경의 체계",
      "code": "12환경02-11",
      "desc": "환경에서 영감을 얻거나 환경의식을 고취하는 예술 작품을 조사하고, 작품에 담겨있는 환경적 의미를 공감한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경의 체계",
      "code": "12환경02-12",
      "desc": "물의 특성과 이용, 물의 생태·경제·사회적 가치, 물 환경 문제와 보전활동 현황을 탐색하고, 물을 매개로 생태계와 사회체계 간의 상호작용을 이해하고 다양한 방법으로 이를 표현한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경의 체계",
      "code": "12환경02-13",
      "desc": "토양의 특성과 이용, 토양의 생태·경제·사회적 가치, 토양 환경 문제와 보전활동 현황을 탐색하고, 토양을 매개로 하는 생태계와 사회체계 간의 상호작용을 이해하고 이를 표현한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경의 체계",
      "code": "12환경02-14",
      "desc": "대기의 조성과 특성, 위치와 규모에 따른 대기 환경 문제와 보전활동 현황을 탐색하고, 대기를 매개로 한 생태계와 사회체계 간의 상호작용을 개념도 등으로 표현한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경의 체계",
      "code": "12환경02-15",
      "desc": "생물의 종류와 생태계에서의 역할, 생물의 경제·사회·문화적 가치, 생물다양성과 보전활동 현황을 탐색하고, 생물다양성의 감소가 생태계와 사회체계에 미치는 영향을 추론한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경 탐구",
      "code": "12환경03-01",
      "desc": "국·내외의 물, 대기, 토양 관련 환경 사건 및 사례를 환경적, 경제적, 사회적 측면에서 통합적으로 분석하여 그 의미와 시사점을 발견한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경 탐구",
      "code": "12환경03-02",
      "desc": "국·내외의 생물 및 생명윤리 관련 환경 사건 및 사례를 환경적, 경제적, 사회적 측면에서 통합적으로 분석하여 그 의미와 시사점을 발견한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경 탐구",
      "code": "12환경03-03",
      "desc": "국·내외의 대표적인 기후 변화 및 에너지 관련 환경 사건 및 사례를 환경적, 경제적, 사회적 측면에서 통합적으로 분석하여 그 의미와 시사점을 발견한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경 탐구",
      "code": "12환경03-04",
      "desc": "음식과 관련된 환경 주제 및 쟁점을 살펴보고, 우리 사회의 음식 문화와 자신의 식생활에서 개선점을 찾아본다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경 탐구",
      "code": "12환경03-05",
      "desc": "주거와 관련된 환경 주제 및 쟁점을 살펴보고, 개인적 및 사회적 차원의 해결 방안을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경 탐구",
      "code": "12환경03-06",
      "desc": "교통과 관련된 환경 주제 및 쟁점을 살펴보고, 개인적 및 사회적 차원의 해결 방안을 모색하여 실행한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경 탐구",
      "code": "12환경03-07",
      "desc": "소비와 관련된 환경 주제 및 쟁점을 살펴보고, 이것이 자신의 생활에서 갖는 의미에 대해 토론함으로써 개인적 및 사회적 차원의 해결 방안을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경 탐구",
      "code": "12환경03-08",
      "desc": "지역적, 국가적, 지구적 차원의 다양한 환경 쟁점과 사례를 탐색하고, 활동 여건을 고려하여 주제를 설정한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "환경 탐구",
      "code": "12환경03-09",
      "desc": "설정된 주제에 대한 탐구 계획을 체계적으로 수립하고, 역할을 나누어 실행하며, 의미 있는 결과물을 제작하고 평가한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "지속가능한 사회",
      "code": "12환경04-01",
      "desc": "지속가능발전의 다중적인 의미를 파악하고, 높은 수준의 지속가능성을 갖추었다고 평가되는 지역이나 도시의 사례를 조사하여 우리 지역의 지속가능한 사회체계를 모색한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "지속가능한 사회",
      "code": "12환경04-02",
      "desc": "지속가능한 삶을 실천하는 과정에서 나타나는 과학기술의 양면성을 발견하고, 지속가능한 사회를 위한 과학기술의 활용 방안, 적정기술의 역할과 조건에 대해 토론한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "지속가능한 사회",
      "code": "12환경04-03",
      "desc": "환경재난과 위험에 대응하기 위한 정부와 시민 사회의 노력을 조사하고, 재난별 안전 수칙을 숙지하며, 우리 지역의 환경 재난과 위험에 대응할 수 있는 방안을 토의한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "지속가능한 사회",
      "code": "12환경04-04",
      "desc": "음식, 주거, 교통, 소비 등의 측면에서 지속가능한 삶의 양식에 대한 다양한 의견을 비교하고, 자신의 견해를 제시한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "지속가능한 사회",
      "code": "12환경04-05",
      "desc": "자신의 진로와 관련지어 녹색 산업 및 일자리의 특징과 지향점을 이해하고, 환경 관련 실천 사항을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "환경",
      "domain": "지속가능한 사회",
      "code": "12환경04-06",
      "desc": "지속가능한 사회와 개인의 삶이 밀접하게 연결되어 있음을 이해하고, 환경정의와 형평성의 측면에서 지속가능한 사회를 만드는 다양한 활동에 참여한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "교육의 목적과 성격",
      "code": "12교육01-01",
      "desc": "학교 교육의 목적과 가치, 전인 교육에 대한 다양한 관점을 비교한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "교육의 목적과 성격",
      "code": "12교육01-02",
      "desc": "잘 교육받은 인간의 특성을 분석해 보고, 이를 실현하기 위해 필요한 교육의 방향을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "교육의 목적과 성격",
      "code": "12교육01-03",
      "desc": "사회화로서의 교육과 자아실현으로서의 교육이 어떻게 구분되는지 이해한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "교육의 목적과 성격",
      "code": "12교육01-04",
      "desc": "학교 교육이 현재의 나의 모습에 미친 영향을 파악해 보고 교육을 통하여 삶 속에서 자아를 실현할 수 있는 의지와 태도를 기른다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "교육의 역사와 공교육",
      "code": "12교육02-01",
      "desc": "학교가 왜, 어떻게 출현했는지에 대해 이해한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "교육의 역사와 공교육",
      "code": "12교육02-02",
      "desc": "학교 제도가 역사적으로 어떻게 발달해 왔는지에 대해 이해한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "교육의 역사와 공교육",
      "code": "12교육02-03",
      "desc": "근대 공교육은 어떻게 성립되었는가에 대해 알아보고, 우리 삶에 미친 영향이 무엇인지 분석한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "교육의 역사와 공교육",
      "code": "12교육02-04",
      "desc": "한국 공교육의 형성과 전개 과정상의 특징을 알아보고, 그 성과와 한계에 대해 평가한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "교육의 역사와 공교육",
      "code": "12교육02-05",
      "desc": "한국 사회가 당면한 교육 문제에는 무엇이 있는지 알아보고 그 원인을 분석한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "교육의 역사와 공교육",
      "code": "12교육02-06",
      "desc": "교육 문제 해결을 위한 교육의 방향은 어떠해야 하는지에 대해 제시한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "학습과 교수의 원리",
      "code": "12교육03-01",
      "desc": "학습이 어떻게 이루어지는지를 이해한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "학습과 교수의 원리",
      "code": "12교육03-02",
      "desc": "학습을 방해하거나 촉진하는 요소들에 대해 알아본다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "학습과 교수의 원리",
      "code": "12교육03-03",
      "desc": "효과적인 학습을 위해 사용할 수 있는 방법과 전략을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "학습과 교수의 원리",
      "code": "12교육03-04",
      "desc": "효과적인 교수를 위해 사용할 수 있는 방법과 전략을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "학습과 교수의 원리",
      "code": "12교육03-05",
      "desc": "효과적인 교수자의 특징을 알고, 교수 상황에서 필요한 의사소통 능력을 기른다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "미래 사회와 평생 교육",
      "code": "12교육04-01",
      "desc": "급변하는 기술 문명에 적응하기 위한 교육은 무엇인지 탐색한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "미래 사회와 평생 교육",
      "code": "12교육04-02",
      "desc": "미래 사회에 등장하는 위험 요소는 무엇인지 조사해 보고, 이에 교육은 어떻게 대비하여야 하는지 그 대안을 모색한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "미래 사회와 평생 교육",
      "code": "12교육04-03",
      "desc": "변화하는 미래에 적극 대처할 수 있는 교육은 어떠해야 하는지 탐구한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "미래 사회와 평생 교육",
      "code": "12교육04-04",
      "desc": "평생 학습 사회의 개념을 알고 그 특징을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "교육학",
      "domain": "미래 사회와 평생 교육",
      "code": "12교육04-05",
      "desc": "평생 학습 사회에서 어떤 자세와 태도를 보여야 하는지에 대해 비판적으로 성찰한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "심리학에 대한 이해 - 과학과 생활",
      "code": "12심리01-01",
      "desc": "심리학의 정의와 목표를 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "심리학에 대한 이해 - 과학과 생활",
      "code": "12심리01-02",
      "desc": "심리학의 과학적 연구 과정을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "심리학에 대한 이해 - 심리학과 진로",
      "code": "12심리01-03",
      "desc": "심리학의 여러 분야를 이해하고 자신과 타인, 그리고 주변 환경과의 관련성을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "심리학에 대한 이해 - 심리학과 진로",
      "code": "12심리01-04",
      "desc": "심리학과 관련된 직업과 그 최근 경향에 대해 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "기억과 학습,나(self) 알기 - 지각",
      "code": "12심리02-01",
      "desc": "일상생활에서 겪게 되는 지각의 오류를 알아보고 지각의 원리를 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "기억과 학습,나(self) 알기 - 지각",
      "code": "12심리02-02",
      "desc": "기억의 과정과 원리를 이해하고 효과적인 학습 방법을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "기억과 학습,나(self) 알기 - 지각",
      "code": "12심리02-03",
      "desc": "합리적 사고 및 의사 결정을 통한 문제 해결의 원리를 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "나(self) 알기 - 동기와 정서",
      "code": "12심리02-04",
      "desc": "동기와 정서의 의미와 중요성, 그리고 그것이 행동에 미치는 영향을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "나(self) 알기 - 동기와 정서",
      "code": "12심리02-05",
      "desc": "부정적 동기와 정서의 발현 과정과 관리 방법을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "나(self) 알기 - 성격과 자아정체성",
      "code": "12심리02-06",
      "desc": "성격의 의미와 형성 과정, 그리고 행동과의 관계를 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "나(self) 알기 - 성격과 자아정체성",
      "code": "12심리02-07",
      "desc": "나(self), 자아 존중감(self-esteem) 및 자아 정체감(self-identity)의 발달 특성을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "나(self) 알기 - 성격과 자아정체성",
      "code": "12심리02-08",
      "desc": "성격과 자아 정체성의 역할과 개인차를 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "사회적 정체성 - 사회적 관계",
      "code": "12심리03-01",
      "desc": "가족, 친구, 취미 집단 등 사회 속에서 구성되는 다양한 유형의 집단을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "사회적 정체성 - 사회적 관계",
      "code": "12심리03-02",
      "desc": "사회적 존재로서의 개인과 타인의 관계에서 나타나는 갈등과 사회 인지 개념을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "사회적 정체성 - 사회적 관계",
      "code": "12심리03-03",
      "desc": "동조, 순종, 태도 변화, 집단행동과 같은 집단 과정을 이해하고 집단 내 갈등의 해결책을 찾는다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "사회적 정체성 - 사회적 관계",
      "code": "12심리03-04",
      "desc": "학교 안 집단생활에서의 대인 관계 특성을 이해하고 적응적인 대인 관계를 위한 해결책을 찾는다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "사회적 정체성 - 사회적 환경",
      "code": "12심리03-05",
      "desc": "개인에게 영향을 미치는 환경의 다양한 유형을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "사회적 정체성 - 사회적 환경",
      "code": "12심리03-06",
      "desc": "미디어(인터넷, 게임, 휴대 전화 등) 환경에서의 상호 작용과 미디어 환경 내에서의 개인과 실제 환경에서의 개인적 특성의 심리적 차이를 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "삶과 적응 - 적응과 부적응",
      "code": "12심리04-01",
      "desc": "일상생활에서 일어날 수 있는 적응과 부적응 요소를 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "삶과 적응 - 적응과 부적응",
      "code": "12심리04-02",
      "desc": "부적응으로 인한 스트레스의 종류와 그에 대한 대처 방안을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "삶과 적응 - 강점과 행복 찾기",
      "code": "12심리04-03",
      "desc": "청소년기에 경험하는 행복한 삶의 특성을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "삶과 적응 - 강점과 행복 찾기",
      "code": "12심리04-04",
      "desc": "자신의 강점과 약점이 자신의 행복한 삶에 미칠 수 있는 영향을 이해한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "삶과 적응 - 강점과 행복 찾기",
      "code": "12심리04-05",
      "desc": "자신의 강점과 약점을 발견하고 보완할 수 있는 방법을 모색한다."
    },
    {
      "dept": "교양",
      "subject": "심리학",
      "domain": "삶과 적응 - 강점과 행복 찾기",
      "code": "12심리04-06",
      "desc": "자아실현의 의미를 이해하고 행복한 삶을 추구하는 태도를 갖는다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "건강의 이해와 질병 예방-건강증진",
      "code": "12보01-01",
      "desc": "건강에 대한 다양한 관점을 비교하여 건강에 대한 총체적 개념을 이해하고, 다양한 건강 영향 요인과 관련지어 가족·지역 사회 등 공동체의 건강 증진 방안을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "건강의 이해와 질병 예방-건강증진",
      "code": "12보01-02",
      "desc": "지역 사회, 국가 수준에서 활용되는 건강 지표의 의미를 해석하고, 건강 관리 측면에서 수준별 건강 지표를 비교·분석한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "건강의 이해와 질병 예방-생활 주기",
      "code": "12보02-01",
      "desc": "생애주기별 건강 요구 및 지지 요인과 장애 요인을 탐색하여 개인, 가족, 사회 수준의 생애 주기별 건강 증진 전략을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "건강의 이해와 질병 예방-질병 예방",
      "code": "12보03-01",
      "desc": "비만, 암 등 주요 만성 질환에 대해 탐색하고, 예방·관리를 위한 개인·사회적 방안을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "건강의 이해와 질병 예방-질병 예방",
      "code": "12보03-02",
      "desc": "신체 기관별 주요 질병의 발생 기전을 이해하고, 질병 예방·관리를 위한 신체 기관별 건강 관리 방법을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "건강의 이해와 질병 예방-질병 예방",
      "code": "12보03-03",
      "desc": "감염병 발생 기전 및 증상을 탐색하고, 감염병의 예방과 관리를 위한 병문안 예절 등 개인적, 사회적 대처 방안을 제안한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "생활 속의 건강한 선택-약물·담배·술",
      "code": "12보04-01",
      "desc": "약물 오·남용이 건강에 미치는 영향을 탐색하고 의약품의 안전한 사용법을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "생활 속의 건강한 선택-약물·담배·술",
      "code": "12보04-02",
      "desc": "흡연·음주의 폐해와 위험 요인을 조사하고 흡연·음주 예방 및 대처 방법을 옹호한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "생활 속의 건강한 선택-성 건강",
      "code": "12보05-01",
      "desc": "섹슈얼리티의 개념과 생애 주기별 성적 특성을 이해하고, 건강한 섹슈얼리티를 갖기 위한 개인, 공동체의 대안을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "생활 속의 건강한 선택-성 건강",
      "code": "12보05-02",
      "desc": "이성 간의 사랑 및 성적 자기 결정권에 영향을 미치는 요인과 관련하여 바람직한 성적 자기 결정권의 기준을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "생활 속의 건강한 선택-성 건강",
      "code": "12보05-03",
      "desc": "성희롱·성폭력·성매매 유발 요인 및 관련 법·정책과 관련지어 개인·공동체·국가 수준의 예방 대책을 토론한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "생활 속의 건강한 선택-성 건강",
      "code": "12보05-04",
      "desc": "성 문화, 성 의식에 영향을 미치는 개인·사회적 요인과 관련지어 개인·공동체·국가 수준의 개선 방안을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "생활 속의 건강한 선택-성 건강",
      "code": "12보05-05",
      "desc": "성 매개 감염병의 특성과 현황을 탐색하고, 개인·사회적 측면에서 예방법을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "생활 속의 건강한 선택-성 건강",
      "code": "12보05-06",
      "desc": "준비된 임신과 피임의 중요성을 이해하고, 미혼모, 저출산에 대한 관점의 차이와 영향 요인을 탐색하며, 국가별 미혼모, 저출산 관련 정책 및 지원 대책을 비교·분석하여 개선점을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "생활 속의 건강한 선택-정서·정신 건강",
      "code": "12보06-01",
      "desc": "자아존중감과 회복 탄력성의 관계 및 중요성을 이해하고, 회복 탄력성 증진을 위한 실천 방안을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "생활 속의 건강한 선택-정서·정신 건강",
      "code": "12보06-02",
      "desc": "불안·우울 등의 감정을 유발하는 요인을 탐색하고, 자원 활용, 환경 개선 등 개인·사회적 대처 방안을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "생활 속의 건강한 선택-정서·정신 건강",
      "code": "12보06-03",
      "desc": "자살을 유발하는 개인·사회적 위험 요인과 관련지어 개인·사회적 대처 방안을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "생활 속의 건강한 선택-정서·정신 건강",
      "code": "12보06-04",
      "desc": "정신 건강 문제에 대한 편견이 개인·사회에 미치는 영향을 탐색하고, 정신 건강 증진 및 편견 해소 방안을 고안한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "생활 속의 건강한 선택-건강 생활 기술",
      "code": "12보07-01",
      "desc": "흡연·음주, 일탈 등 건강을 위협하는 다양한 상황 속에서 건강 증진을 위한 협상, 거절, 갈등 관리 등 적절하고 효과적인 의사소통 기술을 선택하여 적용한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "생활 속의 건강한 선택-건강 생활 기술",
      "code": "12보07-02",
      "desc": "공동체의 건강 의사 결정 사례를 합리성을 근거로 평가하고, 공동체의 건강 문제 해결을 위한 목표 설정, 대안 탐색, 조정, 계획 수립, 실천 및 평가 등 의사 결정 방안을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "생활 속의 건강한 선택-건강 생활 기술",
      "code": "12보07-03",
      "desc": "국가적, 국제적 수준에서 직면한 건강 문제를 탐색하고, 건강 정보·자원의 활용과 관련지어 건강 증진 옹호 활동에 참여한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "안전과 응급처치-생활 안전",
      "code": "12보08-01",
      "desc": "건강과 안전을 위협하는 인적·물리적·사회적 영향 요인 등을 평가하고, 개인·공동체·국가수준의 안전사고 예방과 안전 문화 정착을 위한 방안을 토론한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "안전과 응급처치-생활 안전",
      "code": "12보08-02",
      "desc": "차별, 학대, 폭력이 건강과 안전에 미치는 영향을 평가하고, 법 및 정책과 관련지어 공동체·국가 수준의 개선 방안을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "안전과 응급처치-생활 안전",
      "code": "12보08-03",
      "desc": "근로 조건, 작업 환경 등과 직업병의 관계를 이해하고, 주요 직업병의 현황 및 문제점을 조사하여 직업병의 예방법과 발생 시 대처 방안을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "안전과 응급처치-응급 처치",
      "code": "12보09-01",
      "desc": "상황별 사례와 연계하여 생활 속 응급 처치의 원리와 방법을 익히고, 상황별 응급 처치 방법을 올바르게 시연한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "안전과 응급처치-응급 처치",
      "code": "12보09-02",
      "desc": "심폐소생술의 적용 원리에 대한 이해를 바탕으로 심폐소생술과 자동제세동기의 사용법을 시연한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "안전과 응급처치-응급 처치",
      "code": "12보09-03",
      "desc": "응급 의료 체계와 응급 의료 기관의 이용 방법을 탐색하고, 테러, 화재, 붕괴, 각종 체험 활동시 안전사고 예방 및 구조를 위한 안전 수칙을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "건강자원과 사회문화-건강권과 건강 자원",
      "code": "12보10-01",
      "desc": "헌법, 학교보건법, UN 아동권리협약 등 건강과 안전에 대한 법적 권리를 이해하고 국가 및 국제 차원에서의 건강·안전권 보호 제도와 구제 절차를 평가한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "건강자원과 사회문화-건강권과 건강 자원",
      "code": "12보10-02",
      "desc": "건강 및 안전 정보 매체의 종류와 특성을 이해하고, 건강 및 안전 자원을 탐색하여 사회권으로서의 건강권을 평가한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "건강자원과 사회문화-건강권과 건강 자원",
      "code": "12보10-03",
      "desc": "인공 임신 중절, 자살, 안락사 등 건강 문제와 관련된 윤리적 쟁점을 평가하고, 계층·지역별 건강 격차를 줄이기 위한 방안을 토론한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "건강자원과 사회문화-건강권과 건강 자원",
      "code": "12보10-04",
      "desc": "조류인플루엔자(avian influenza), 신종인플루엔자, 중동호흡기증후군 등 공동체 건강 문제가 사회적 쟁점화가 되는 사례와 관련지어 건강 정책 수립 시 집단 간의 관점 조정을 위한 이익 단체, 시민 단체, 언론, 전문가, 일반 시민 등 다양한 집단의 기능과 역할을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "건강자원과 사회문화-건강권과 건강 자원",
      "code": "12보10-05",
      "desc": "보건 의료 서비스와 의료 보장 제도의 특성을 비교하고, 각각의 기능과 역할을 이해하여 주체적 선택과 활용 방안을 모색한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "건강자원과 사회 문화-건강 문화",
      "code": "12보11-01",
      "desc": "건강 신념·관행·미디어 등이 건강에 미치는 영향과 관련하여 건강 증진 개선 방안에 적용한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "건강자원과 사회 문화-건강 문화",
      "code": "12보11-02",
      "desc": "생명과 죽음에 대한 인식이 다른 다양한 문화 속에서의 헌혈, 장기 기증, 장례 문화 등의 현황을 조사·비교하여 문제점과 개선 방안을 제시한다."
    },
    {
      "dept": "교양",
      "subject": "보건",
      "domain": "건강자원과 사회 문화-건강 문화",
      "code": "12보11-03",
      "desc": "장애인, 다문화 가족 등 사회적 소수자약자에 대한 건강 정책 사례를 문화적 측면에서 평가하고, 문화적 다양성이 건강 정책에 미치는 영향과 관련지어 개선 방향을 제시한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "여행과 미래 사회 그리고 진로",
      "code": "12여지06-03",
      "desc": "자신의 진로 탐색에 도움이 될 여행 주제를 탐구하여 정한 뒤 구체적인 여행 계획을 세우는 과정으로 실천적인 진로를 탐색한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "여행과 미래 사회 그리고 진로",
      "code": "12여지06-02",
      "desc": "여행 산업과 관련된 직업의 종류와 특성에 대해 탐구하고 관심 있는 직업에 대해서는 간접 또는 직접 체험한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "여행과 미래 사회 그리고 진로",
      "code": "12여지06-01",
      "desc": "여행 산업의 특성과 변화 과정을 조사하고 미래 사회의 변화에 따라 여행 산업이 어떻게 변화할지 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "여행자와 여행지 주민이 모두 행복한 여행",
      "code": "12여지05-03",
      "desc": "여행자에게는 의미 있는 경험이 되고 여행지 주민에게는 경제적 이익과 긍지, 지속가능한 개발이 된 사례를 찾아 분석한 뒤 우리 지역 여행 상품 개발에 적용한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "여행자와 여행지 주민이 모두 행복한 여행",
      "code": "12여지05-02",
      "desc": "공정여행, 생태관광 등 다양한 대안여행이 출현한 배경과 각 대안여행별 특징을 사례를 통해 조사하고 특히 관심이 가는 대안여행에 대해 분석·탐구한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "여행자와 여행지 주민이 모두 행복한 여행",
      "code": "12여지05-01",
      "desc": "여행 산업이 여행지에 미치는 경제적·환경적·문화적 영향을 파악하고 책임 있고 바람직한 여행을 위한 실천 방법을 모색한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "인류의 성찰과 공존을 위한 여행",
      "code": "12여지04-03",
      "desc": "생태, 첨단 기술, 문화 창조 등으로 미래를 지향하는 지역을 사례로 인류의 미래를 탐색하고 실현할 수 있는 방안을 모색한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "인류의 성찰과 공존을 위한 여행",
      "code": "12여지04-02",
      "desc": "분쟁, 재난, 빈곤, 환경 문제 등으로 고통 받는 지역으로의 봉사여행이 지역과 여행자에게 주는 긍정적 변화를 탐구하고 인류의 행복한 공존을 위한 노력에 공감하고 실천 방법을 모색한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "인류의 성찰과 공존을 위한 여행",
      "code": "12여지04-01",
      "desc": "산업유산이나 전쟁박물관 같은 다양한 기념물을 통해 인류의 물질적·정신적 발전 과정을 성찰할 수 있는 여행 계획을 세우고, 이를 통해 시민의식을 고취한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "다채로운 문화를 찾아가는 여행",
      "code": "12여지03-04",
      "desc": "우리나라의 다채로운 문화여행이라는 주제로 우리나라의 문화에 대한 이해를 높이고 즐길 수 있는 여행지를 선정하고 소개한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "다채로운 문화를 찾아가는 여행",
      "code": "12여지03-03",
      "desc": "촌락 여행과 도시 여행이 제공해줄 수 있는 매력을 촌락과 도시의 기능적 특성과 관련시켜 사례 중심으로 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "다채로운 문화를 찾아가는 여행",
      "code": "12여지03-02",
      "desc": "종교, 건축, 음식, 예술 등 다양한 문화로 널리 알려진 지역을 사례로 각 문화의 형성 배경과 의미를 이해하고 관광적 매력을 끄는 이유를 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "다채로운 문화를 찾아가는 여행",
      "code": "12여지03-01",
      "desc": "스포츠, 문화, 엑스포 등 세계 각국에서 벌어지는 축제의 사례를 선정하여 축제의 개최 배경, 의미, 성공적인 축제 관광의 조건을 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "매력적인 자연을 찾아가는 여행",
      "code": "12여지02-04",
      "desc": "우리나라의 매력적인 생태 및 자연여행이라는 주제로 우리나라의 생태 및 자연에 대한 이해를 높이고 즐길 수 있는 여행지를 선정하고 소개한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "매력적인 자연을 찾아가는 여행",
      "code": "12여지02-03",
      "desc": "천연기념물, 국립공원, 남극 같은 지구환경의 다양성과 지속가능성을 위해 여행이 제한되고 있는 지역의 가치를 이해하고, 보존과 개발의 갈등 속에서 변화하고 있는 모습을 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "매력적인 자연을 찾아가는 여행",
      "code": "12여지02-02",
      "desc": "매력적인 기후로 널리 알려진 지역을 선정하여 관광적 매력을 조사하고, 기후와 인간 생활의 관계와 관광으로 인한 지역 특색을 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "매력적인 자연을 찾아가는 여행",
      "code": "12여지02-01",
      "desc": "매력적인 지형으로 널리 알려진 지역을 선정하여 관광적 매력을 조사하고, 지형과 인간 생활의 관계와 관광으로 인한 지역 특색을 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "어떻게 할까?,여행을 왜",
      "code": "12여지01-04",
      "desc": "바람직하고 안전한 여행을 위한 여행 계획 수립의 중요성을 이해하고 여행 준비에 필요한 지식과 기능, 가치 및 태도를 탐구하고 이를 몇몇 사례 지역에 적용한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "어떻게 할까?,여행을 왜",
      "code": "12여지01-03",
      "desc": "다양한 지도 및 지리 정보 시스템을 활용하여 여행지 및 여행 경로에 대한 정보를 수집·정리·조직한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "어떻게 할까?,여행을 왜",
      "code": "12여지01-02",
      "desc": "교통수단의 발전에 따라 여행의 일정, 경로, 방식 등이 어떻게 변화했는지 탐구함으로써 교통수단과 여행의 관계를 이해한다."
    },
    {
      "dept": "사회",
      "subject": "여행지리",
      "domain": "어떻게 할까?,여행을 왜",
      "code": "12여지01-01",
      "desc": "책이나 대중매체에 나타난 여행 사례를 통해 다양한 여행의 의미와 종류를 찾아보고 여행이 개인 삶과 세계 인식에 미치는 영향을 탐구한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "사회문제 사례연구",
      "code": "12사탐06-04",
      "desc": "토의를 통해 도출된 사회문제 해결 방안을 직접 실천해보고, 사회문제 탐구 및 해결 과정에 대한 보고서를 작성하여 발표한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "사회문제 사례연구",
      "code": "12사탐06-03",
      "desc": "선정한 사회문제를 바라보는 다양한 관점을 파악하고, 토의를 통해 해결 방안을 도출한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "사회문제 사례연구",
      "code": "12사탐06-02",
      "desc": "선정한 사회문제를 해결하기 위한 탐구 계획을 수립하고, 다양한 자료 수집 방법을 활용하여 선정한 사회문제의 현황을 분석한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "사회문제 사례연구",
      "code": "12사탐06-01",
      "desc": "자신이 일상생활에서 경험하는 사회문제 중 하나를 탐구 대상으로 선정하고, 선정 이유에 대해 설명한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "사회적 소수자에 대한 차별",
      "code": "12사탐05-04",
      "desc": "사회적 소수자의 인권 문제 해결을 위한 우리 사회의 제도 및 기구(국가인권위원회, 시민단체 등)를 탐구하고, 관련 직업에 대해 조사한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "사회적 소수자에 대한 차별",
      "code": "12사탐05-03",
      "desc": "사회적 소수자에 대한 편견과 차별의 발생 원인에 대한 다양한 관점을 파악하고, 토의 등을 통해 사회적 소수자 차별 문제의 해결 방안을 도출한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "사회적 소수자에 대한 차별",
      "code": "12사탐05-02",
      "desc": "사회적 소수자 문제가 지구촌 곳곳에서 나타나고 있음을 인식하고, 사회문제 탐구 절차를 적용하여 사회적 소수자 차별 문제에 대한 탐구 계획을 수립한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "사회적 소수자에 대한 차별",
      "code": "12사탐05-01",
      "desc": "사회적 소수자 및 차별의 의미를 이해하고, 대중매체(TV, 영화, 광고 등)를 통해 사회적 소수자에 대한 다양한 차별 양상을 파악한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "저출산？고령화에 따른 문제",
      "code": "12사탐04-04",
      "desc": "저출산·고령화 사회로의 변화에 따라 수요가 증가할 것으로 예상되는 직업과 수요가 감소할 것으로 예상되는 직업에 대해 조사한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "저출산？고령화에 따른 문제",
      "code": "12사탐04-03",
      "desc": "저출산·고령화의 원인에 대한 다양한 관점을 파악하고, 비용 편익 분석 등을 통해 저출산·고령화 문제 해결을 위해 제시된 대안들을 평가한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "저출산？고령화에 따른 문제",
      "code": "12사탐04-02",
      "desc": "통계 자료를 통해 우리나라의 저출산·고령화 현황을 분석하고, 사회문제 탐구 절차를 적용하여 저출산·고령화로 인해 나타날 수 있는 문제점에 대한 탐구 계획을 수립한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "저출산？고령화에 따른 문제",
      "code": "12사탐04-01",
      "desc": "출생과 사망의 사회적 의의를 이해하고, 근대 이후 나타난 인구 구조의 변화를 파악한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "학교 폭력",
      "code": "12사탐03-04",
      "desc": "범죄 문제 해결을 위한 제도적 노력 및 사회 기관(경찰, 법원, 교도소, 소년원 등)을 탐구하고, 관련 직업에 대해 조사한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "학교 폭력",
      "code": "12사탐03-03",
      "desc": "학교 폭력의 원인에 대한 다양한 관점을 확인하고, 토의 등을 통해 학교 폭력의 해결 방안을 도출한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "학교 폭력",
      "code": "12사탐03-02",
      "desc": "학교 공동체에서 발생하는 폭력 문제의 심각성을 인식하고, 사회문제 탐구 절차를 적용하여 학교 폭력 문제에 대한 탐구 계획을 수립한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "학교 폭력",
      "code": "12사탐03-01",
      "desc": "문헌연구법(시사자료, 통계자료 등)을 활용하여 범죄 현황을 분석하고, 범죄의 유형을 분류한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "게임 과몰입",
      "code": "12사탐02-04",
      "desc": "정보사회의 문제 해결을 위한 제도적 노력 및 사회 기관(정보통신위원회, 시민단체, 사이버범죄수사대 등)을 탐구하고, 관련 직업에 대해 조사한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "게임 과몰입",
      "code": "12사탐02-03",
      "desc": "청소년 게임 과몰입의 원인에 대한 다양한 관점을 파악하고, 토의 등을 통해 게임 과몰입 문제의 해결 방안을 도출한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "게임 과몰입",
      "code": "12사탐02-02",
      "desc": "또래집단에 대한 관찰을 통해 게임 과몰입으로 인해 나타나는 문제점을 인식하고, 사회문제 탐구 절차를 적용하여 게임 과몰입 문제에 대한 탐구 계획을 수립한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "게임 과몰입",
      "code": "12사탐02-01",
      "desc": "정보사회의 의미와 특징을 이해하고, 정보사회에서 나타나고 있는 다양한 사회문제에 대해 조사한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "사회문제의 이해",
      "code": "12사탐01-04",
      "desc": "사회현상에 대한 통계적 조사를 수행하는 다양한 기관(통계청, 한국은행, 여론조사 기관 등)과 관련 직업에 대해 파악한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "사회문제의 이해",
      "code": "12사탐01-03",
      "desc": "사회문제 탐구 과정에서 발생할 수 있는 윤리적 쟁점을 파악하고, 이에 대한 해결 방안을 모색한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "사회문제의 이해",
      "code": "12사탐01-02",
      "desc": "사회문제 탐구를 위한 과학적 방법과 절차를 파악하고, 사회문제 탐구를 위해 필요한 다양한 자료 수집 방법의 특징을 설명한다."
    },
    {
      "dept": "사회",
      "subject": "사회문제탐구",
      "domain": "사회문제의 이해",
      "code": "12사탐01-01",
      "desc": "사회문제의 의미와 특징을 이해하고, 사회문제를 바라보는 서로 다른 관점을 비교한다."
    }
  ]
};
